Repository: lnxelnope/miro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, pt, th, vi

# backupImportantNotes
source: • Save this file in a safe place (Google Drive, etc.) • Photos are NOT included in the backup • Transfer Key expires in 30 days • Key can only be used once
de: • Speichern Sie diese Datei an einem sicheren Ort (Google-Laufwerk usw.). • Fotos sind NICHT im Backup enthalten • Der Übertragungsschlüssel läuft in 30 Tagen ab • Der Schlüssel kann nur einmal verwendet werden
es: • Guarde este archivo en un lugar seguro (Google Drive, etc.) • Las fotos NO están incluidas en la copia de seguridad • La clave de transferencia vence en 30 días • La clave solo se puede usar una vez
fr: • Enregistrez ce fichier dans un endroit sûr (lecteur Google, etc.) • Les photos ne sont PAS incluses dans la sauvegarde • La clé de transfert expire dans 30 jours. • La clé ne peut être utilisée qu'une seule fois
hi: • इस फ़ाइल को किसी सुरक्षित स्थान पर सहेजें (Google ड्राइव, आदि) • तस्वीरें बैकअप में शामिल नहीं हैं • स्थानांतरण कुंजी 30 दिनों में समाप्त हो जाती है • कुंजी का उपयोग केवल एक बार किया जा सकता है
id: • Simpan file ini di tempat yang aman (Google Drive, dll.) • Foto TIDAK disertakan dalam cadangan • Masa berlaku Kunci Transfer akan habis dalam 30 hari • Kunci hanya dapat digunakan satu kali
pt: • Salve este arquivo em um local seguro (unidade Google, etc.) • As fotos NÃO estão incluídas no backup • A chave de transferência expira em 30 dias • A chave só pode ser usada uma vez
th: • บันทึกไฟล์นี้ในที่ปลอดภัย (Google Drive เป็นต้น) • รูปภาพไม่รวมอยู่ในสำรองข้อมูล • Transfer Key หมดอายุใน 30 วัน • Key ใช้ได้ครั้งเดียวเท่านั้น
vi: • Lưu tệp này ở nơi an toàn (Google Drive, v.v.) • Ảnh KHÔNG được đưa vào bản sao lưu • Khóa chuyển sẽ hết hạn sau 30 ngày • Chìa khóa chỉ được sử dụng một lần

source: Restore Backup?
de: Backup wiederherstellen?
es: ¿Restaurar copia de seguridad?
fr: Restaurer la sauvegarde ?
hi: बैकअप बहाल?
id: Pulihkan Cadangan?
pt: Restaurar cópia de segurança?
th: กู้คืนจากสำรองข้อมูล?
vi: Khôi phục bản sao lưu?

source: Backup from:
de: Backup von:
es: Copia de seguridad desde:
fr: Sauvegarde depuis :
hi: यहां से बैकअप:
id: Cadangan dari:
pt: Backup de:
th: สำรองจาก:
vi: Sao lưu từ:

source: Date:
de: Datum:
es: Fecha:
hi: तारीख:
id: Tanggal:
pt: Data:
th: วันที่:
vi: Ngày:

source: Energy:
de: Energie:
es: Energía:
fr: Énergie:
hi: ऊर्जा:
id: Energi:
pt: Energia:
th: พลังงาน:
vi: Năng lượng:

source: Food entries:
de: Lebensmitteleinträge:
es: Entradas de comida:
fr: Entrées alimentaires :
hi: खाद्य प्रविष्टियाँ:
id: Entri makanan:
pt: Entradas de alimentos:
th: รายการอาหาร:
vi: Mục thực phẩm:

# restoreImportant
source: Important
de: Wichtig
es: Importante
hi: महत्वपूर्ण
id: Penting
pt: Importante
th: สำคัญ
vi: Quan trọng

# restoreImportantNotes
source: • Current Energy on this device will be REPLACED with Energy from backup ({energy}) • Food entries will be MERGED (not replaced) • Photos are NOT included in backup • Transfer Key will be used (cannot be reused)
de: • Die aktuelle Energie auf diesem Gerät wird durch Energie aus dem Backup ({energy}) ERSETZT. • Lebensmitteleinträge werden ZUSAMMENGEFÜHRT (nicht ersetzt) • Fotos sind NICHT im Backup enthalten • Übertragungsschlüssel wird verwendet (kann nicht wiederverwendet werden)
es: • La energía actual en este dispositivo será SUSTITUIDA con energía de respaldo ({energy}) • Las entradas de alimentos se fusionarán (no se reemplazarán) • Las fotos NO están incluidas en la copia de seguridad • Se utilizará la clave de transferencia (no se puede reutilizar)
fr: • L'énergie actuelle sur cet appareil sera REMPLACÉE par l'énergie de la sauvegarde ({energy}). • Les entrées d'aliments seront FUSIONNÉES (non remplacées) • Les photos ne sont PAS incluses dans la sauvegarde • La clé de transfert sera utilisée (ne peut pas être réutilisée).
hi: • इस उपकरण पर वर्तमान ऊर्जा को बैकअप से प्राप्त ऊर्जा से प्रतिस्थापित किया जाएगा ({energy}) • खाद्य प्रविष्टियों को मर्ज कर दिया जाएगा (प्रतिस्थापित नहीं किया जाएगा) • तस्वीरें बैकअप में शामिल नहीं हैं • स्थानांतरण कुंजी का उपयोग किया जाएगा (पुन: उपयोग नहीं किया जा सकता)
id: • Energi Saat Ini pada perangkat ini akan DIGANTI dengan Energi dari cadangan ({energy}) • Entri makanan akan DIGABUNG (tidak diganti) • Foto TIDAK disertakan dalam cadangan • Transfer Key akan digunakan (tidak dapat digunakan kembali)
pt: • A energia atual neste dispositivo será SUBSTITUÍDA pela energia do backup ({energy}) • As inscrições de alimentos serão MESCLADAS (não substituídas) • As fotos NÃO estão incluídas no backup • A chave de transferência será usada (não pode ser reutilizada)
th: • พลังงานปัจจุบันบนอุปกรณ์นี้จะถูกแทนที่ด้วยพลังงานจากสำรองข้อมูล ({energy}) • รายการอาหารจะถูกรวม (ไม่ใช่แทนที่) • รูปภาพไม่รวมอยู่ในสำรองข้อมูล • Transfer Key จะถูกใช้ (ใช้ซ้ำไม่ได้)
vi: • Năng lượng hiện tại trên thiết bị này sẽ được THAY THẾ bằng Năng lượng từ dự phòng ({energy}) • Các mục thực phẩm sẽ được HỢP NHẤT (không thay thế) • Ảnh KHÔNG được đưa vào bản sao lưu • Transfer Key sẽ được sử dụng (không thể sử dụng lại)

source: Restore
de: Wiederherstellen
es: Restaurar
fr: Restaurer
hi: पुनर्स्थापित करना
id: Memulihkan
pt: Restaurar
th: กู้คืน
vi: Khôi phục

source: Restore Complete!
de: Wiederherstellung abgeschlossen!
es: ¡Restauración completa!
fr: Restauration terminée !
hi: पूर्ण पुनर्स्थापित करें!
id: Pemulihan Selesai!
pt: Restauração concluída!
th: กู้คืนสำเร็จ!
vi: Khôi phục hoàn tất!

# restoreCompleteContent
source: Your data has been restored successfully.
de: Ihre Daten wurden erfolgreich wiederhergestellt.
es: Sus datos han sido restaurados exitosamente.
fr: Vos données ont été restaurées avec succès.
hi: आपका डेटा सफलतापूर्वक पुनर्स्थापित कर दिया गया है.
id: Data Anda telah berhasil dipulihkan.
pt: Seus dados foram restaurados com sucesso.
th: กู้คืนข้อมูลสำเร็จแล้ว
vi: Dữ liệu của bạn đã được khôi phục thành công.

source: New Energy Balance:
de: Neue Energiebilanz:
es: Nuevo equilibrio energético:
fr: Nouveau bilan énergétique :
hi: नई ऊर्जा संतुलन:
id: Neraca Energi Baru:
pt: Novo Balanço Energético:
th: ยอดพลังงานใหม่:
vi: Cân bằng năng lượng mới:

source: Food Entries Imported:
de: Importierte Lebensmitteleinträge:
es: Entradas de alimentos importados:
fr: Entrées d'aliments importés :
hi: आयातित खाद्य प्रविष्टियाँ:
id: Entri Makanan yang Diimpor:
pt: Entradas Alimentares Importadas:
th: รายการอาหารที่นำเข้า:
vi: Mục thực phẩm nhập khẩu:

source: My Meals Imported:
de: Meine importierten Mahlzeiten:
es: Mis comidas importadas:
fr: Mes repas importés :
hi: मेरा भोजन आयातित:
id: Makanan Saya Diimpor:
pt: Minhas refeições importadas:
th: อาหารของฉันที่นำเข้า:
vi: Bữa ăn của tôi được nhập khẩu:

# appWillRefresh
source: Your app will refresh to show the restored data.
de: Ihre App wird aktualisiert und zeigt die wiederhergestellten Daten an.
es: Su aplicación se actualizará para mostrar los datos restaurados.
fr: Votre application sera actualisée pour afficher les données restaurées.
hi: आपका ऐप पुनर्स्थापित डेटा दिखाने के लिए रीफ़्रेश हो जाएगा।
id: Aplikasi Anda akan disegarkan untuk menampilkan data yang dipulihkan.
pt: Seu aplicativo será atualizado para mostrar os dados restaurados.
th: แอปจะรีเฟรชเพื่อแสดงข้อมูลที่กู้คืน
vi: Ứng dụng của bạn sẽ làm mới để hiển thị dữ liệu được khôi phục.

source: Backup Failed
de: Sicherung fehlgeschlagen
es: Error de copia de seguridad
fr: Échec de la sauvegarde
hi: बैकअप विफल
id: Pencadangan Gagal
pt: Falha no backup
th: สร้างสำรองข้อมูลล้มเหลว
vi: Sao lưu không thành công

source: Invalid Backup File
de: Ungültige Sicherungsdatei
es: Archivo de copia de seguridad no válido
fr: Fichier de sauvegarde invalide
hi: अमान्य बैकअप फ़ाइल
id: File Cadangan Tidak Valid
pt: Arquivo de backup inválido
th: ไฟล์สำรองข้อมูลไม่ถูกต้อง
vi: Tệp sao lưu không hợp lệ

source: Restore Failed
de: Wiederherstellung fehlgeschlagen
es: Restauración fallida
fr: Échec de la restauration
hi: पुनर्स्थापना विफल
id: Pemulihan Gagal
pt: Falha na restauração
th: กู้คืนล้มเหลว
vi: Khôi phục không thành công

source: Analytics Data Collection
de: Analytics-Datenerfassung
es: Recopilación de datos analíticos
fr: Collecte de données analytiques
hi: विश्लेषिकी डेटा संग्रह
id: Pengumpulan Data Analisis
pt: Coleta de dados analíticos
th: การเก็บข้อมูลการวิเคราะห์
vi: Thu thập dữ liệu phân tích

# analyticsEnabled
source: Analytics enabled - ขอบคุณที่ช่วยปรับปรุงแอป
de: Analytics aktiviert – ขอบคุณที่ช่วยปรับปรุงแอป
es: Análisis habilitados - ขอบคุณที่ช่วยปรับปรุงแอป
fr: Analyses activées
hi: एनालिटिक्स सक्षम - डाउनलोड करें
id: Analytics diaktifkan -
pt: Analytics ativado -
th: เปิดการวิเคราะห์แล้ว - ขอบคุณที่ช่วยปรับปรุงแอป
vi: Đã bật phân tích - ขอบคุณที่ช่วยปรับปรุงแอป

# analyticsDisabled
source: Analytics disabled - ไม่เก็บข้อมูลการใช้งาน
de: Analytics deaktiviert – nicht verfügbar
es: Análisis deshabilitados - ไม่เก็บข้อมูลการใช้งาน
fr: Analyse désactivée
hi: एनालिटिक्स अक्षम - डाउनलोड करें
id: Analytics dinonaktifkan - ไม่เก็บข้อมูลการใช้งาน
pt: Análise desativada -
th: ปิดการวิเคราะห์แล้ว - ไม่เก็บข้อมูลการใช้งาน
vi: Analytics bị vô hiệu hóa - ไม่เก็บข้อมูลการใช้งาน

source: Enabled
de: Ermöglicht
es: Activado
fr: Activé
hi: सक्रिय
id: Diaktifkan
pt: Habilitado
th: เปิด
vi: Đã bật

# enabledSubtitle
source: Enabled - ช่วยปรับปรุงประสบการณ์ใช้งาน
de: Aktiviert – aktiviert
es: Habilitado - ช่วยปรับปรุงประสบการณ์ใช้งาน
fr: Activé -
hi: सक्षम - सक्रिय
id: Diaktifkan - ช่วยปรับปรุงประสบการณ์ใช้งาน
pt: Ativado -
th: เปิด - ช่วยปรับปรุงประสบการณ์ใช้งาน
vi: Đã bật - ช่วยปรับปรุงประสบการณ์ใช้งาน

source: Disabled
de: Deaktiviert
es: Desactivado
fr: Désactivé
hi: अक्षम
id: Dengan disabilitas
pt: Desabilitado
th: ปิด
vi: Tàn tật

# disabledSubtitle
source: Disabled - ไม่เก็บข้อมูลการใช้งาน
de: Deaktiviert – nicht verfügbar
es: Discapacitado - ไม่เก็บข้อมูลการใช้งาน
fr: Désactivé
hi: विकलांग - विकलांग व्यक्ति
id: Disabilitas - ไม่เก็บข้อมูลการใช้งาน
pt: Desativado - ไม่เก็บข้อมูลการใช้งาน
th: ปิด - ไม่เก็บข้อมูลการใช้งาน
vi: Đã tắt - ไม่เก็บข้อมูลการใช้งาน

source: Images per day
de: Bilder pro Tag
es: Imágenes por día
fr: Images par jour
hi: प्रति दिन छवियां
id: Gambar per hari
pt: Imagens por dia
th: รูปภาพต่อวัน
vi: Hình ảnh mỗi ngày

# scanUpToImagesPerDay
source: Scan up to {limit} images per day
de: Scannen Sie bis zu {limit} Bilder pro Tag
es: Escanee hasta {limit} imágenes por día
fr: Numérisez jusqu'à {limit} images par jour
hi: प्रति दिन {limit} छवियों तक स्कैन करें
id: Pindai hingga {limit} gambar per hari
pt: Digitalize até {limit} imagens por dia
th: สแกนได้สูงสุด {limit} รูปภาพต่อวัน
vi: Quét tối đa {limit} hình ảnh mỗi ngày

source: Reset
de: Zurücksetzen
es: Reiniciar
fr: Réinitialiser
hi: रीसेट करें
id: Mengatur ulang
pt: Reiniciar
th: รีเซ็ต
vi: Cài lại

source: Reset Scan History
de: Scanverlauf zurücksetzen
es: Restablecer el historial de escaneo
fr: Réinitialiser l'historique des analyses
hi: स्कैन इतिहास रीसेट करें
id: Atur Ulang Riwayat Pemindaian
pt: Redefinir histórico de verificação
th: รีเซ็ตประวัติการสแกน
vi: Đặt lại lịch sử quét

# resetScanHistorySubtitle
source: Delete all scanned entries and re-scan
de: Löschen Sie alle gescannten Einträge und scannen Sie erneut
es: Elimine todas las entradas escaneadas y vuelva a escanear
fr: Supprimez toutes les entrées numérisées et réanalysez
hi: सभी स्कैन की गई प्रविष्टियाँ हटाएँ और पुनः स्कैन करें
id: Hapus semua entri yang dipindai dan pindai ulang
pt: Exclua todas as entradas digitalizadas e verifique novamente
th: ลบรายการที่สแกนทั้งหมดและสแกนใหม่
vi: Xóa tất cả các mục được quét và quét lại

# imagesPerDayDialog
source: Images per day
de: Bilder pro Tag
es: Imágenes por día
fr: Images par jour
hi: प्रति दिन छवियां
id: Gambar per hari
pt: Imagens por dia
th: รูปภาพต่อวัน
vi: Hình ảnh mỗi ngày

# maxImagesPerDayDescription
source: Maximum images to scan per day Scans only the selected date
de: Maximal zu scannende Bilder pro Tag Scannt nur das ausgewählte Datum
es: Máximo de imágenes para escanear por día Escanea solo la fecha seleccionada
fr: Nombre maximum d'images à numériser par jour Scanne uniquement la date sélectionnée
hi: प्रति दिन स्कैन करने के लिए अधिकतम छवियाँ केवल चयनित दिनांक को स्कैन करता है
id: Gambar maksimum untuk dipindai per hari Hanya memindai tanggal yang dipilih
pt: Máximo de imagens para digitalizar por dia Verifica apenas a data selecionada
th: จำนวนรูปภาพสูงสุดที่สแกนต่อวัน สแกนเฉพาะวันที่เลือก
vi: Hình ảnh tối đa để quét mỗi ngày Chỉ quét ngày đã chọn

# scanLimitSetTo
source: Scan limit set to {limit} images per day
de: Das Scanlimit ist auf {limit} Bilder pro Tag festgelegt
es: Límite de escaneo establecido en {limit} imágenes por día
fr: Limite de numérisation définie sur {limit} images par jour
hi: प्रति दिन छवियों को स्कैन करने की सीमा {limit} पर सेट की गई
id: Batas pemindaian disetel ke {limit} gambar per hari
pt: Limite de digitalização definido para {limit} imagens por dia
th: ตั้งค่าจำกัดการสแกนเป็น {limit} รูปภาพต่อวัน
vi: Đã đặt giới hạn quét thành {limit} hình ảnh mỗi ngày

# resetScanHistoryDialog
source: Reset Scan History?
de: Scanverlauf zurücksetzen?
es: ¿Restablecer el historial de escaneo?
fr: Réinitialiser l'historique des analyses ?
hi: स्कैन इतिहास रीसेट करें?
id: Setel Ulang Riwayat Pemindaian?
pt: Redefinir histórico de verificação?
th: รีเซ็ตประวัติการสแกน?
vi: Đặt lại lịch sử quét?

# resetScanHistoryContent
source: All gallery-scanned food entries will be deleted. Pull down on any date to re-scan images.
de: Alle in der Galerie gescannten Lebensmitteleinträge werden gelöscht. Ziehen Sie an einem beliebigen Datum nach unten, um Bilder erneut zu scannen.
es: Se eliminarán todas las entradas de alimentos escaneadas en la galería. Despliega cualquier fecha para volver a escanear las imágenes.
fr: Toutes les entrées de nourriture numérisées dans la galerie seront supprimées. Déroulez n’importe quelle date pour numériser à nouveau les images.
hi: गैलरी-स्कैन की गई सभी खाद्य प्रविष्टियाँ हटा दी जाएंगी। छवियों को पुनः स्कैन करने के लिए किसी भी तारीख को नीचे खींचें।
id: Semua entri makanan yang dipindai di galeri akan dihapus. Tarik ke bawah pada tanggal mana saja untuk memindai ulang gambar.
pt: Todas as entradas de alimentos digitalizadas na galeria serão excluídas. Puxe para baixo em qualquer data para digitalizar novamente as imagens.
th: รายการอาหารที่สแกนจากแกลเลอรีทั้งหมดจะถูกลบ ดึงลงที่วันที่ใดก็ได้เพื่อสแกนรูปภาพใหม่
vi: Tất cả các mục thực phẩm được quét trong thư viện sẽ bị xóa. Kéo xuống bất kỳ ngày nào để quét lại hình ảnh.

# resetComplete
source: Reset complete - {count} entries deleted. Pull down to re-scan.
de: Zurücksetzen abgeschlossen – {count} Einträge gelöscht. Zum erneuten Scannen nach unten ziehen.
es: Restablecimiento completo: {count} entradas eliminadas. Tire hacia abajo para volver a escanear.
fr: Réinitialisation terminée – entrées {count} supprimées. Déroulez vers le bas pour re-scanner.
hi: रीसेट पूर्ण - {count} प्रविष्टियाँ हटा दी गईं। पुन: स्कैन करने के लिए नीचे खींचें.
id: Reset selesai - {count} entri dihapus. Tarik ke bawah untuk memindai ulang.
pt: Redefinição concluída - entradas {count} excluídas. Puxe para baixo para digitalizar novamente.
th: รีเซ็ตเสร็จแล้ว - ลบ {count} รายการ ดึงลงเพื่อสแกนใหม่
vi: Đặt lại hoàn tất - {count} mục đã bị xóa. Kéo xuống để quét lại.

# questBarStreak
source: Streak {days} day
de: Streak {days} Tag
es: Racha {days} día
fr: Séquence {days} jour
hi: स्ट्रीक {days} दिन
id: Garis {days} hari
pt: Sequência {days} dia
th: Streak {days} วัน
vi: Chuỗi {days} ngày

# questBarDaysToNextTier
source: {days} days → {tier}
de: {days} Tage → {tier}
es: {days} días → {tier}
fr: {days} jours → {tier}
hi: {days} दिन → {tier}
id: {days} hari → {tier}
pt: {days} dias → {tier}
th: อีก {days} วัน → {tier}
vi: {days} ngày → {tier}

# questBarMaxTier
source: Max Tier! 💎
de: Maximale Stufe! 💎
es: ¡Nivel máximo! 💎
fr: Niveau maximum ! 💎
hi: मैक्स टियर! 💎
id: Tingkat Maks! 💎
pt: Nível máximo! 💎
vi: Cấp tối đa! 💎

# questBarOfferDismissed
source: Offer hidden
de: Angebot ausgeblendet
es: Oferta oculta
fr: Offre masquée
hi: प्रस्ताव छिपा हुआ
id: Penawaran disembunyikan
pt: Oferta oculta
th: Offer ถูกซ่อน
vi: Ưu đãi bị ẩn

# questBarViewOffer
source: View Offer
de: Angebot ansehen
es: Ver oferta
fr: Voir l'offre
hi: ऑफर देखें
id: Lihat Penawaran
pt: Ver oferta
th: ดู Offer
vi: Xem ưu đãi

# questBarNoOffersNow
source: • No offers right now
de: • Zur Zeit keine Angebote
es: • No hay ofertas en este momento
fr: • Aucune offre pour le moment
hi: • अभी कोई ऑफर नहीं
id: • Tidak ada penawaran saat ini
pt: • Nenhuma oferta no momento
th: • ไม่มี Offer ในตอนนี้
vi: • Hiện không có ưu đãi nào

# questBarWeeklyChallenges
source: 🎯 Weekly Challenges
de: 🎯 Wöchentliche Herausforderungen
es: 🎯 Desafíos semanales
fr: 🎯 Défis hebdomadaires
hi: 🎯साप्ताहिक चुनौतियाँ
id: 🎯 Tantangan Mingguan
pt: 🎯 Desafios Semanais
vi: 🎯 Thử thách hàng tuần

# questBarMilestones
source: 🏆 Milestones
de: 🏆 Meilensteine
es: 🏆 Hitos
fr: 🏆 Jalons
hi: 🏆 मील के पत्थर
id: 🏆 Tonggak sejarah
pt: 🏆 Marcos
vi: 🏆 Các mốc quan trọng

# questBarInviteFriends
source: 👥 Invite friends & get 20E
de: 👥 Freunde einladen und 20E erhalten
es: 👥 Invita amigos y obtén 20E
fr: 👥 Invitez des amis et obtenez 20E
hi: 👥 मित्रों को आमंत्रित करें और 20ई प्राप्त करें
id: 👥 Undang teman & dapatkan 20E
pt: 👥 Convide amigos e ganhe 20E
th: 👥 ชวนเพื่อนได้ 20E
vi: 👥 Mời bạn bè và nhận 20E

# questBarTimeRemaining
source: ⏰ Time left {time}
de: ⏰ Verbleibende Zeit {time}
es: ⏰ Tiempo restante {time}
fr: ⏰ Temps restant {time}
hi: ⏰ शेष समय {time}
id: ⏰ Waktu tersisa {time}
pt: ⏰ Tempo restante {time}
th: ⏰ เหลือเวลา {time}
vi: ⏰ Thời gian còn lại {time}

# questBarShareReferralError
source: Error sharing: {error}
de: Fehler beim Teilen: {error}
es: Error al compartir: {error}
fr: Partage d'erreur : {error}
hi: साझा करने में त्रुटि: {error}
id: Kesalahan berbagi: {error}
pt: Erro ao compartilhar: {error}
th: เกิดข้อผิดพลาด: {error}
vi: Lỗi chia sẻ: {error}

# tierCelebrationTitle
source: {tier} Celebration 🎉
de: {tier} Feier 🎉
es: {tier} Celebración 🎉
fr: {tier} Célébration 🎉
hi: {tier} उत्सव 🎉
id: {tier} Perayaan 🎉
pt: {tier} Comemoração 🎉
th: ฉลองระดับ {tier} 🎉
vi: {tier} Lễ kỷ niệm 🎉

# tierCelebrationDay
source: Day {day}
de: Tag {day}
es: Día {day}
fr: Jour {day}
hi: दिन {day}
id: Hari {day}
pt: Dia {day}
th: วันที่ {day}
vi: Ngày {day}

# tierCelebrationExpired
source: Expired
de: Abgelaufen
es: Venció
fr: Expiré
hi: खत्म हो चुका
id: Kedaluwarsa
pt: Expirado
th: หมดอายุ
vi: Hết hạn

# tierCelebrationComplete
source: Complete!
de: Vollständig!
es: ¡Completo!
fr: Complet!
hi: पूरा!
id: Menyelesaikan!
pt: Completo!
th: สำเร็จ!
vi: Hoàn thành!

# questBarWatchAd
source: Watch Ad +{energy}⚡
de: Anzeige ansehen +{energy}⚡
es: Ver anuncio +{energy}⚡
fr: Regarder l'annonce +{energy}⚡
hi: विज्ञापन देखें +{energy}⚡
id: Tonton Iklan +{energy}⚡
pt: Assistir ao anúncio +{energy}⚡
th: ดูโฆษณา +{energy}⚡
vi: Xem Quảng cáo +{energy}⚡

# questBarAdRemaining
source: {remaining}/{total} remaining today
de: Heute verbleiben noch {remaining}/{total}
es: {remaining}/{total} restantes hoy
fr: {remaining}/{total} restant aujourd'hui
hi: {remaining}/{total} आज शेष है
id: {remaining}/{total} tersisa hari ini
pt: {remaining}/{total} restantes hoje
th: เหลือ {remaining}/{total} ครั้งวันนี้
vi: {remaining}/{total} còn lại hôm nay

# questBarAdSuccess
source: Ad watched! +{energy} Energy incoming...
de: Anzeige gesehen! +{energy} Energieeingang...
es: ¡Anuncio visto! +{energy} Energía entrante...
fr: Annonce regardée ! +{energy} Énergie entrante...
hi: विज्ञापन देखा! +{energy} आने वाली ऊर्जा...
id: Iklan ditonton! +{energy} Energi masuk...
pt: Anúncio assistido! +{energy} Energia entrando...
th: 🎉 ดูโฆษณาเสร็จแล้ว! +{energy} Energy กำลังเข้าบัญชี...
vi: Quảng cáo đã xem! +{energy} Năng lượng đi vào...

# questBarAdNotReady
source: Ad not ready, please try again
de: Anzeige nicht fertig, bitte versuchen Sie es erneut
es: El anuncio no está listo, inténtalo de nuevo.
fr: L'annonce n'est pas prête, veuillez réessayer
hi: विज्ञापन तैयार नहीं है, कृपया पुनः प्रयास करें
id: Iklan belum siap, silakan coba lagi
pt: O anúncio não está pronto. Tente novamente
th: โฆษณายังไม่พร้อม กรุณาลองอีกครั้ง
vi: Quảng cáo chưa sẵn sàng, vui lòng thử lại

# questBarDailyChallenge
source: Daily Challenge
de: Tägliche Herausforderung
es: Desafío diario
fr: Défi quotidien
hi: दैनिक चुनौती
id: Tantangan Harian
pt: Desafio Diário
vi: Thử thách hàng ngày

# questBarUseAi
source: Use Energy
de: Nutzen Sie Energie
es: Usar energía
fr: Utiliser l'énergie
hi: ऊर्जा का प्रयोग करें
id: Gunakan Energi
pt: Usar energia
th: ใช้ Energy
vi: Sử dụng năng lượng

# questBarResetsMonday
source: Resets every Monday
de: Wird jeden Montag zurückgesetzt
es: Se reinicia todos los lunes
fr: Réinitialise tous les lundis
hi: प्रत्येक सोमवार को रीसेट होता है
id: Reset setiap hari Senin
pt: Reinicia toda segunda-feira
th: รีเซ็ตทุกวันจันทร์
vi: Đặt lại vào thứ Hai hàng tuần

# questBarClaimed
source: Claimed!
de: Behauptet!
es: ¡Reclamado!
fr: Réclamé !
hi: दावा किया!
id: Diklaim!
pt: Reivindicado!
th: เคลมแล้ว!
vi: Đã xác nhận quyền sở hữu!

# questBarHideOffer
source: Hide
de: Verstecken
es: Esconder
fr: Cacher
hi: छिपाना
id: Bersembunyi
pt: Esconder
th: ซ่อน
vi: Trốn

# questBarViewDetails
source: View
de: Sicht
es: Vista
fr: Voir
hi: देखना
id: Melihat
pt: Visualizar
th: ดูเลย
vi: Xem

# questBarShareText
source: Try MiRO! AI-powered food analysis 🍔 Use this link and we both get +20 Energy free! {link}
de: Versuchen Sie es mit MiRO! KI-gestützte Lebensmittelanalyse 🍔 Benutzen Sie diesen Link und wir bekommen beide +20 Energie gratis! {link}
es: ¡Prueba MiRO! Análisis de alimentos impulsado por IA 🍔 ¡Usa este enlace y ambos obtendremos +20 de energía gratis! {link}
fr: Essayez MiRO ! Analyse alimentaire basée sur l'IA 🍔 Utilisez ce lien et nous obtiendrons tous les deux +20 d'énergie gratuite ! {link}
hi: MiRO आज़माएं! एआई-संचालित भोजन विश्लेषण 🍔 इस लिंक का उपयोग करें और हम दोनों को +20 ऊर्जा निःशुल्क मिलेगी! {link}
id: Coba MiRO! Analisis makanan bertenaga AI 🍔 Gunakan tautan ini dan kita berdua mendapatkan +20 Energi gratis! {link}
pt: Experimente MiRO! Análise de alimentos com tecnologia de IA 🍔 Use este link e ambos ganharemos +20 de energia grátis! {link}
th: มาลองแอป MiRO กัน! วิเคราะห์อาหารด้วย AI 🍔 ใช้ลิงก์นี้ เราทั้งคู่ได้ +20 Energy ฟรี! {link}
vi: Hãy thử MiRO! Phân tích thực phẩm được hỗ trợ bởi AI 🍔 Sử dụng liên kết này và cả hai chúng ta đều nhận được +20 Năng lượng miễn phí! {link}

# questBarShareSubject
source: Try MiRO
de: Versuchen Sie es mit MiRO
es: Pruebe MiRO
fr: Essayez MiRO
hi: प्रयास करें MiRO
id: Coba MiRO
pt: Tente MiRO
th: ชวนใช้ MiRO
vi: Hãy thử MiRO

# claimButtonTitle
source: Claim Daily Energy
de: Fordern Sie tägliche Energie an
es: Reclama energía diaria
fr: Réclamez de l'énergie quotidienne
hi: दैनिक ऊर्जा का दावा करें
id: Klaim Energi Harian
pt: Reivindique energia diária
th: กดเพื่อรับ Daily Energy
vi: Yêu cầu năng lượng hàng ngày

# claimButtonReceived
source: Received +{energy}E!
de: +{energy}E erhalten!
es: ¡Recibido +{energy}E!
fr: Reçu +{energy}E !
hi: +{energy}E प्राप्त हुआ!
id: Diterima +{energy}E!
pt: Recebido +{energy}E!
th: ได้รับ +{energy}E แล้ว!
vi: Đã nhận được +{energy}E!

# claimButtonAlreadyClaimed
source: Already claimed today
de: Heute bereits beansprucht
es: Ya reclamado hoy
fr: Déjà réclamé aujourd'hui
hi: आज पहले ही दावा किया जा चुका है
id: Sudah diklaim hari ini
pt: Já reivindicado hoje
th: วันนี้เคลมไปแล้ว
vi: Đã xác nhận hôm nay

# claimButtonError
source: Error: {error}
de: Fehler: {error}
fr: Erreur : {error}
hi: त्रुटि: {error}
id: Kesalahan: {error}
pt: Erro: {error}
th: เกิดข้อผิดพลาด: {error}
vi: Lỗi: {error}

# seasonalQuestLimitedTime
source: LIMITED TIME
de: BEGRENZTE ZEIT
es: TIEMPO LIMITADO
fr: DURÉE LIMITÉE
hi: सीमित समय
id: WAKTU TERBATAS
pt: TEMPO LIMITADO
th: จำกัดเวลา
vi: THỜI GIAN CÓ HẠN
