Repository: lnxelnope/miro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, pt, th, vi

# analyzeFoodWithAiDesc
source: Snap a photo → AI calculates calories automatically Gemini API is free to use!
de: Machen Sie ein Foto → KI berechnet Kalorien automatisch Die Nutzung von Gemini API ist kostenlos!
es: Toma una foto → La IA calcula las calorías automáticamente ¡Gemini API es de uso gratuito!
fr: Prendre une photo → L'IA calcule automatiquement les calories Gemini API est gratuit !
hi: एक फोटो खींचें → AI स्वचालित रूप से कैलोरी की गणना करता है Gemini API का उपयोग निःशुल्क है!
id: Ambil foto → AI menghitung kalori secara otomatis Gemini API gratis untuk digunakan!
pt: Tire uma foto → IA calcula calorias automaticamente Gemini API é de uso gratuito!
th: ถ่ายรูปอาหาร → AI คำนวณแคลอรี่ให้อัตโนมัติ Gemini API ใช้ฟรี ไม่ต้องจ่ายเงิน!
vi: Chụp ảnh → AI tự động tính toán lượng calo Gemini API được sử dụng miễn phí!

source: Open Google AI Studio
de: Öffnen Sie Google AI Studio
es: Abierto Google AI Studio
fr: Ouvrir Google AI Studio
hi: Google AI Studio खोलें
id: Buka Google AI Studio
pt: Abra Google AI Studio
th: เปิด Google AI Studio
vi: Mở Google AI Studio

# step1Title
source: Open Google AI Studio
de: Öffnen Sie Google AI Studio
es: Abierto Google AI Studio
fr: Ouvrir Google AI Studio
hi: Google AI Studio खोलें
id: Buka Google AI Studio
pt: Abra Google AI Studio
th: เปิด Google AI Studio
vi: Mở Google AI Studio

# step1Desc
source: Click the button below to create an API Key
de: Klicken Sie auf die Schaltfläche unten, um ein API Key zu erstellen.
es: Haga clic en el botón a continuación para crear un API Key
fr: Cliquez sur le bouton ci-dessous pour créer un API Key
hi: API Key बनाने के लिए नीचे दिए गए बटन पर क्लिक करें
id: Klik tombol di bawah untuk membuat API Key
pt: Clique no botão abaixo para criar um API Key
th: กดปุ่มด้านล่างเพื่อไปสร้าง API Key
vi: Nhấp vào nút bên dưới để tạo API Key

# step2Title
source: Sign in with Google Account
de: Melden Sie sich mit dem Google-Konto an
es: Iniciar sesión con la cuenta Google
fr: Connectez-vous avec le compte Google
hi: Google खाते से साइन इन करें
id: Masuk dengan Akun Google
pt: Faça login com a conta Google
th: ล็อกอิน Google Account
vi: Đăng nhập bằng tài khoản Google

# step2Desc
source: Use your Gmail or Google Account (create one for free if you don't have one)
de: Verwenden Sie Ihr Gmail- oder Google-Konto (erstellen Sie kostenlos eines, wenn Sie noch keins haben)
es: Utilice su cuenta de Gmail o Google (cree una gratis si no tiene una)
fr: Utilisez votre compte Gmail ou Google (créez-en un gratuitement si vous n'en avez pas)
hi: अपने जीमेल या Google खाते का उपयोग करें (यदि आपके पास एक नहीं है तो निःशुल्क बनाएं)
id: Gunakan Akun Gmail atau Google Anda (buat gratis jika Anda belum punya)
pt: Use sua conta Gmail ou Google (crie uma gratuitamente se não tiver uma)
th: ใช้ Gmail หรือ Google Account ที่มีอยู่ (ถ้ายังไม่มี สร้างฟรี)
vi: Sử dụng Tài khoản Gmail hoặc Google của bạn (tạo một tài khoản miễn phí nếu bạn chưa có)

# step3Title
source: Click "Create API Key"
de: Klicken Sie auf „API Key erstellen“
es: Haga clic en "Crear API Key"
fr: Cliquez sur "Créer API Key"
hi: "बनाएंAPI Key" पर क्लिक करें
id: Klik "Buat API Key"
pt: Clique em "Criar API Key"
th: คลิก "Create API Key"
vi: Nhấp vào "Tạo API Key"

# step3Desc
source: Click the blue "Create API Key" button If asked to select a Project → Click "Create API key in new project"
de: Klicken Sie auf die blaue Schaltfläche „API Key erstellen“. Wenn Sie aufgefordert werden, ein Pro-Projekt auszuwählen → Klicken Sie auf „API-Schlüssel in neuem Projekt erstellen“.
es: Haga clic en el botón azul "Crear API Key" Si se le solicita que seleccione un Project → Haga clic en "Crear clave API en un nuevo proyecto"
fr: Cliquez sur le bouton bleu "Créer API Key" Si on vous demande de sélectionner un projet Pro → Cliquez sur "Créer la clé API dans un nouveau projet"
hi: नीले "Create API Key" बटन पर क्लिक करें यदि Project चुनने के लिए कहा जाए तो → "नए प्रोजेक्ट में API कुंजी बनाएं" पर क्लिक करें
id: Klik tombol biru "Buat API Key". Jika diminta untuk memilih Project → Klik "Buat kunci API di proyek baru"
pt: Clique no botão azul "Criar API Key" Se for solicitado a selecionar um Project → Clique em "Criar chave API no novo projeto"
th: กดปุ่มสีน้ำเงิน "Create API Key" ถ้าถามให้เลือก Project → กด "Create API key in new project"
vi: Nhấp vào nút "Tạo API Key" màu xanh lam Nếu được yêu cầu chọn Project → Nhấp vào "Tạo khóa API trong dự án mới"

# step4Title
source: Copy Key and paste below
de: Kopieren Sie den Schlüssel und fügen Sie ihn unten ein
es: Copie la clave y péguela a continuación
fr: Copiez la clé et collez-la ci-dessous
hi: कुंजी की प्रतिलिपि बनाएँ और नीचे चिपकाएँ
id: Salin Kunci dan tempel di bawah
pt: Copie a chave e cole abaixo
th: คัดลอก Key แล้วกลับมาวางด้านล่าง
vi: Sao chép Key và dán bên dưới

# step4Desc
source: Click Copy next to the created Key Key will look like: AIzaSyxxxx...
de: Klicken Sie neben dem erstellten Schlüssel auf Kopieren Der Schlüssel sieht so aus: AIzaSyxxxx...
es: Haga clic en Copiar junto a la clave creada La clave se verá así: AIzaSyxxxx...
fr: Cliquez sur Copier à côté de la clé créée La clé ressemblera à : AIzaSyxxxx...
hi: बनाई गई कुंजी के आगे कॉपी पर क्लिक करें कुंजी इस तरह दिखेगी: AIzaSyxxx...
id: Klik Salin di sebelah Kunci yang dibuat Kuncinya akan terlihat seperti: AIzaSyxxxx...
pt: Clique em Copiar ao lado da chave criada A chave será semelhante a: AIzaSyxxxx...
th: กดปุ่ม Copy ข้างกล่อง Key ที่สร้างเสร็จ Key จะหน้าตาประมาณ: AIzaSyxxxx...
vi: Nhấn Copy bên cạnh Key đã tạo Khóa sẽ có dạng: AIzaSyxxxx...

# step5Title
source: Paste API Key here
de: Fügen Sie hier API Key ein
es: Pegue API Key aquí
fr: Collez API Key ici
hi: API Key को यहां चिपकाएं
id: Tempel API Key di sini
pt: Cole API Key aqui
th: วาง API Key ที่นี่
vi: Dán API Key vào đây

# pasteApiKeyHint
source: Paste the copied API Key
de: Fügen Sie den kopierten API Key ein.
es: Pegue el API Key copiado
fr: Collez le API Key copié
hi: कॉपी किया गया API Key चिपकाएँ
id: Tempelkan API Key yang disalin
pt: Cole o API Key copiado
th: วาง API Key ที่คัดลอกมา
vi: Dán API Key đã sao chép

source: Save API Key
de: Speichern API Key
es: Guardar API Key
fr: Enregistrer API Key
hi: API Key सहेजें
id: Simpan API Key
pt: Salvar API Key
th: บันทึก API Key
vi: Lưu API Key

# testingConnection
source: Testing...
de: Testen...
es: Pruebas...
fr: Essai...
hi: परीक्षण...
id: Menguji...
pt: Testando...
th: กำลังทดสอบ...
vi: Đang thử nghiệm...

source: Delete API Key
de: API Key löschen
es: Eliminar API Key
fr: Supprimer API Key
hi: API Key हटाएं
id: Hapus API Key
pt: Excluir API Key
th: ลบ API Key
vi: Xóa API Key

# deleteApiKeyConfirm
source: Delete API Key?
de: API Key löschen?
es: ¿Eliminar API Key?
fr: Supprimer API Key ?
hi: API Key हटाएं?
id: Hapus API Key?
pt: Excluir API Key?
th: ลบ API Key?
vi: Xóa API Key?

# deleteApiKeyConfirmDesc
source: You won't be able to use AI food analysis until you set it up again
de: Sie können die KI-Lebensmittelanalyse erst verwenden, wenn Sie sie erneut einrichten
es: No podrás utilizar el análisis de alimentos con IA hasta que lo vuelvas a configurar
fr: Vous ne pourrez pas utiliser l'analyse alimentaire par l'IA tant que vous ne l'aurez pas reconfiguré.
hi: जब तक आप इसे दोबारा सेट नहीं करेंगे तब तक आप एआई खाद्य विश्लेषण का उपयोग नहीं कर पाएंगे
id: Anda tidak akan dapat menggunakan analisis makanan AI sampai Anda menyiapkannya lagi
pt: Você não poderá usar a análise alimentar de IA até configurá-la novamente
th: จะไม่สามารถใช้ AI วิเคราะห์อาหารได้จนกว่าจะตั้งค่าใหม่
vi: Bạn sẽ không thể sử dụng tính năng phân tích thực phẩm bằng AI cho đến khi thiết lập lại

# apiKeySaved
source: API Key saved successfully
de: API Key erfolgreich gespeichert
es: API Key guardado exitosamente
fr: API Key enregistré avec succès
hi: API Key सफलतापूर्वक सहेजा गया
id: API Key berhasil disimpan
pt: API Key salvo com sucesso
th: บันทึก API Key เรียบร้อย
vi: API Key đã lưu thành công

# apiKeyDeleted
source: API Key deleted successfully
de: API Key erfolgreich gelöscht
es: API Key eliminado exitosamente
fr: API Key supprimé avec succès
hi: API Key सफलतापूर्वक हटा दिया गया
id: API Key berhasil dihapus
pt: API Key excluído com sucesso
th: ลบ API Key เรียบร้อย
vi: API Key đã xóa thành công

# pleasePasteApiKey
source: Please paste API Key first
de: Bitte fügen Sie zuerst API Key ein
es: Por favor pegue API Key primero
fr: Veuillez d'abord coller API Key
hi: कृपया पहले API Key पेस्ट करें
id: Silakan tempel API Key terlebih dahulu
pt: Por favor cole API Key primeiro
th: กรุณาวาง API Key ก่อน
vi: Vui lòng dán API Key trước

# apiKeyInvalidFormat
source: Invalid API Key — must start with "AIza"
de: Ungültiger API Key – muss mit „AIza“ beginnen
es: API Key no válido: debe comenzar con "AIza"
fr: API Key invalide — doit commencer par « AIza »
hi: अमान्य API Key - "AIza" से शुरू होना चाहिए
id: API Key tidak valid — harus dimulai dengan "AIza"
pt: API Key inválido — deve começar com "AIza"
th: API Key ไม่ถูกต้อง — ต้องขึ้นต้นด้วย "AIza"
vi: API Key không hợp lệ — phải bắt đầu bằng "AIza"

# connectionSuccessMessage
source: ✅ Connected successfully! Ready to use
de: ✅ Erfolgreich verbunden! Gebrauchsfertig
es: ✅ ¡Conectado exitosamente! Preparado para usar
fr: ✅ Connecté avec succès ! Prêt à l'emploi
hi: ✅ सफलतापूर्वक कनेक्ट हो गया! इस्तेमाल के लिए तैयार
id: ✅ Berhasil terhubung! Siap digunakan
pt: ✅Conectado com sucesso! Pronto para usar
th: ✅ เชื่อมต่อสำเร็จ! พร้อมใช้งาน
vi: ✅ Kết nối thành công! Sẵn sàng để sử dụng

# connectionFailedMessage
source: ❌ Connection failed
de: ❌ Verbindung fehlgeschlagen
es: ❌ Error de conexión
fr: ❌ La connexion a échoué
hi: ❌ कनेक्शन विफल
id: ❌ Koneksi gagal
pt: ❌ Falha na conexão
th: ❌ เชื่อมต่อไม่สำเร็จ
vi: ❌ Kết nối không thành công

# faqTitle
source: Frequently Asked Questions
de: Häufig gestellte Fragen
es: Preguntas frecuentes
fr: Foire aux questions
hi: अक्सर पूछे जाने वाले प्रश्नों
id: Pertanyaan yang Sering Diajukan
pt: Perguntas frequentes
th: คำถามที่พบบ่อย
vi: Câu hỏi thường gặp

# faqFreeQuestion
source: Is it really free?
de: Ist es wirklich kostenlos?
es: ¿Es realmente gratis?
fr: Est-ce vraiment gratuit ?
hi: क्या यह सचमुच मुफ़्त है?
id: Apakah ini benar-benar gratis?
pt: É realmente grátis?
th: ฟรีจริงไหม?
vi: Nó có thực sự miễn phí không?

# faqFreeAnswer
source: Yes! Gemini 2.0 Flash is free for 1,500 requests/day For food logging (5-15 times/day) → Free forever, no payment required
de: Ja! Gemini 2.0 Flash ist für 1.500 Anfragen/Tag kostenlos Für die Lebensmittelprotokollierung (5–15 Mal/Tag) → Für immer kostenlos, keine Zahlung erforderlich
es: ¡Sí! Gemini 2.0 Flash es gratuito para 1.500 solicitudes/día Para registro de alimentos (5-15 veces/día) → Gratis para siempre, no se requiere pago
fr: Oui! Gemini 2.0 Flash est gratuit pour 1 500 requêtes/jour Pour l'enregistrement des aliments (5 à 15 fois/jour) → Gratuit pour toujours, aucun paiement requis
hi: हाँ! Gemini 2.0 फ्लैश 1,500 अनुरोध/दिन के लिए निःशुल्क है भोजन लॉगिंग के लिए (5-15 बार/दिन) → हमेशा के लिए निःशुल्क, किसी भुगतान की आवश्यकता नहीं
id: Ya! Gemini 2.0 Flash gratis untuk 1.500 permintaan/hari Untuk pencatatan makanan (5-15 kali/hari) → Gratis selamanya, tidak perlu pembayaran
pt: Sim! Gemini 2.0 Flash é gratuito para 1.500 solicitações/dia Para registro de alimentos (5-15 vezes/dia) → Gratuito para sempre, sem necessidade de pagamento
th: ฟรีจริง! Gemini 2.0 Flash ใช้ฟรี 1,500 ครั้ง/วัน สำหรับบันทึกอาหาร (5-15 ครั้ง/วัน) → ฟรีตลอด ไม่ต้องจ่ายเงิน
vi: Đúng! Gemini 2.0 Flash miễn phí cho 1.500 yêu cầu/ngày Để ghi nhật ký thực phẩm (5-15 lần/ngày) → Miễn phí mãi mãi, không cần thanh toán

# faqSafeQuestion
source: Is it safe?
de: Ist es sicher?
es: ¿Es seguro?
fr: Est-ce sécuritaire?
hi: क्या यह सुरक्षित है?
id: Apakah aman?
pt: É seguro?
th: ปลอดภัยไหม?
vi: Nó có an toàn không?

# faqSafeAnswer
source: API Key is stored in Secure Storage on your device only App doesn't send Key to our server If Key leaks → Delete and create a new one (it's not your Google password)
de: API Key wird nur im sicheren Speicher auf Ihrem Gerät gespeichert Die App sendet den Schlüssel nicht an unseren Server Wenn der Schlüssel verloren geht → Löschen und einen neuen erstellen (es ist nicht Ihr Google-Passwort)
es: API Key se almacena en Almacenamiento seguro solo en su dispositivo La aplicación no envía la clave a nuestro servidor Si la clave se filtra → Eliminar y crear una nueva (no es su contraseña Google)
fr: API Key est stocké dans le stockage sécurisé sur votre appareil uniquement L'application n'envoie pas la clé à notre serveur Si la clé fuit → Supprimez et créez-en une nouvelle (ce n'est pas votre mot de passe Google)
hi: API Key केवल आपके डिवाइस पर सिक्योर स्टोरेज में संग्रहीत है ऐप हमारे सर्वर पर कुंजी नहीं भेजता है यदि कुंजी लीक हो जाती है → हटाएं और एक नया पासवर्ड बनाएं (यह आपका Google पासवर्ड नहीं है)
id: API Key disimpan di Penyimpanan Aman di perangkat Anda saja Aplikasi tidak mengirimkan Kunci ke server kami Jika Kunci bocor → Hapus dan buat yang baru (itu bukan kata sandi Google Anda)
pt: API Key é armazenado no armazenamento seguro apenas no seu dispositivo O aplicativo não envia a chave para o nosso servidor Se a chave vazar → Exclua e crie uma nova (não é sua senha Google)
th: API Key เก็บใน Secure Storage ในเครื่องเท่านั้น แอปไม่ส่ง Key ไปที่ server ของเรา ถ้า Key หลุด → ลบทิ้งสร้างใหม่ได้เลย (ไม่ใช่รหัสผ่าน Google)
vi: API Key chỉ được lưu trữ trong Bộ nhớ an toàn trên thiết bị của bạn Ứng dụng không gửi Key đến máy chủ của chúng tôi Nếu Key bị rò rỉ → Xóa và tạo một cái mới (không phải mật khẩu Google của bạn)

# faqNoKeyQuestion
source: What if I don't create a Key?
de: Was passiert, wenn ich keinen Schlüssel erstelle?
es: ¿Qué pasa si no creo una clave?
fr: Que se passe-t-il si je ne crée pas de clé ?
hi: यदि मैं कुंजी नहीं बनाऊं तो क्या होगा?
id: Bagaimana jika saya tidak membuat Kunci?
pt: E se eu não criar uma chave?
th: ถ้าไม่สร้าง Key ล่ะ?
vi: Nếu tôi không tạo Chìa khóa thì sao?

# faqNoKeyAnswer
source: You can still use the app! But: ❌ Cannot take photo → AI analysis ✅ Can log food manually ✅ Quick Add works ✅ View kcal/macro summary works
de: Sie können die App weiterhin nutzen! Aber: ❌ Foto kann nicht aufgenommen werden → KI-Analyse ✅ Kann Lebensmittel manuell protokollieren ✅ Quick Add funktioniert ✅ Sehen Sie sich kcal/Makro-Zusammenfassungsarbeiten an
es: ¡Aún puedes usar la aplicación! Pero: ❌ No se puede tomar una foto → Análisis de IA ✅ Puede registrar alimentos manualmente ✅ Agregar rápido funciona ✅ Ver kcal/macro resumen de trabajos
fr: Vous pouvez toujours utiliser l'application ! Mais : ❌ Impossible de prendre une photo → Analyse IA ✅ Peut enregistrer les aliments manuellement ✅ L'ajout rapide fonctionne ✅ Voir les travaux de résumé kcal/macro
hi: आप अभी भी ऐप का उपयोग कर सकते हैं! लेकिन: ❌ फ़ोटो नहीं ले सकते → AI विश्लेषण ✅ भोजन को मैन्युअल रूप से लॉग कर सकते हैं ✅ त्वरित जोड़ें कार्य करता है ✅ kcal/मैक्रो सारांश कार्य देखें
id: Anda masih dapat menggunakan aplikasi ini! Tapi: ❌ Tidak dapat mengambil foto → Analisis AI ✅ Dapat mencatat makanan secara manual ✅ Tambah Cepat berfungsi ✅ Lihat karya ringkasan kcal/makro
pt: Você ainda pode usar o aplicativo! Mas: ❌ Não é possível tirar foto → Análise de IA ✅ Pode registrar alimentos manualmente ✅ A adição rápida funciona ✅ Ver trabalhos de resumo de kcal/macro
th: ยังใช้แอปได้! แต่: ❌ ไม่สามารถถ่ายรูป → AI วิเคราะห์ ✅ บันทึกอาหารด้วยมือได้ ✅ Quick Add ได้ ✅ ดูสรุป kcal/macro ได้
vi: Bạn vẫn có thể sử dụng ứng dụng! Nhưng: ❌ Không chụp được ảnh → Phân tích AI ✅ Có thể đăng nhập thực phẩm bằng tay ✅ Thêm nhanh hoạt động ✅ Xem kcal/tác phẩm tóm tắt macro

# faqCreditCardQuestion
source: Do I need a credit card?
de: Brauche ich eine Kreditkarte?
es: ¿Necesito una tarjeta de crédito?
fr: Ai-je besoin d'une carte de crédit ?
hi: क्या मुझे क्रेडिट कार्ड की आवश्यकता है?
id: Apakah saya memerlukan kartu kredit?
pt: Preciso de um cartão de crédito?
th: ต้องมีบัตรเครดิตไหม?
vi: Tôi có cần thẻ tín dụng không?

# faqCreditCardAnswer
source: No — Create API Key for free without credit card
de: Nein – Erstellen Sie API Key kostenlos und ohne Kreditkarte
es: No — Crea API Key gratis sin tarjeta de crédito
fr: Non — Créez API Key gratuitement sans carte de crédit
hi: नहीं - बिना क्रेडिट कार्ड के निःशुल्क API Key बनाएं
id: Tidak — Buat API Key gratis tanpa kartu kredit
pt: Não — Crie API Key gratuitamente sem cartão de crédito
th: ไม่ต้อง — สร้าง API Key ได้ฟรีโดยไม่ต้องใส่บัตรเครดิต
vi: Không — Tạo API Key miễn phí mà không cần thẻ tín dụng

# navDashboard
source: Dashboard
de: Armaturenbrett
es: Panel
fr: Tableau de bord
hi: डैशबोर्ड
id: Dasbor
pt: Painel
vi: Trang tổng quan

# navMyMeals
source: My Meals
de: Meine Mahlzeiten
es: Mis comidas
fr: Mes repas
hi: मेरा भोजन
id: Makananku
pt: Minhas refeições
th: เมนูของฉัน
vi: Bữa ăn của tôi

# navCamera
source: Camera
de: Kamera
es: Cámara
fr: Caméra
hi: कैमरा
id: Kamera
pt: Câmera
th: กล้อง
vi: Máy ảnh

# navAiChat
source: AI Chat
de: KI-Chat
es: Chat de IA
fr: Chat IA
hi: एआई चैट
id: Obrolan AI
pt: Bate-papo com IA
th: แชท AI
vi: Trò chuyện AI

# navProfile
source: Profile
de: ProDatei
es: Proarchivo
fr: Fichier Pro
hi: Proफ़ाइल
id: Proberkas
pt: Proarquivo
th: โปรไฟล์
vi: Protập tin

# appBarTodayIntake
source: Today's Intake
de: Die heutige Aufnahme
es: La ingesta de hoy
fr: La prise d'aujourd'hui
hi: आज का सेवन
id: Asupan hari ini
pt: Ingestão de hoje
th: สรุปวันนี้
vi: Lượng tiêu thụ hôm nay

# appBarMyMeals
source: My Meals
de: Meine Mahlzeiten
es: Mis comidas
fr: Mes repas
hi: मेरा भोजन
id: Makananku
pt: Minhas refeições
th: เมนูของฉัน
vi: Bữa ăn của tôi

# appBarCamera
source: Camera
de: Kamera
es: Cámara
fr: Caméra
hi: कैमरा
id: Kamera
pt: Câmera
th: กล้อง
vi: Máy ảnh

# appBarAiChat
source: AI Chat
de: KI-Chat
es: Chat de IA
fr: Chat IA
hi: एआई चैट
id: Obrolan AI
pt: Bate-papo com IA
th: แชท AI
vi: Trò chuyện AI

# appBarMiro
source: MIRO
hi: मिरो

source: Permission Required
de: Erlaubnis erforderlich
es: Permiso requerido
fr: Autorisation requise
hi: अनुमति आवश्यक है
id: Izin Diperlukan
pt: Permissão necessária
th: ต้องการสิทธิ์
vi: Cần có sự cho phép

# permissionRequiredDesc
source: MIRO needs access to the following:
de: MIRO benötigt Zugriff auf Folgendes:
es: MIRO necesita acceso a lo siguiente:
fr: MIRO a besoin d'accéder aux éléments suivants :
hi: MIRO को निम्नलिखित तक पहुंच की आवश्यकता है:
id: MIRO memerlukan akses ke hal-hal berikut:
pt: MIRO precisa de acesso ao seguinte:
th: MIRO ต้องการเข้าถึง:
vi: MIRO cần quyền truy cập vào các thông tin sau:

# permissionPhotos
source: Photos — to scan food
de: Fotos – zum Scannen von Lebensmitteln
es: Fotos — para escanear alimentos
fr: Photos — pour numériser des aliments
hi: तस्वीरें - भोजन स्कैन करने के लिए
id: Foto — untuk memindai makanan
pt: Fotos – para escanear alimentos
th: รูปภาพ — เพื่อสแกนอาหาร
vi: Hình ảnh - để quét thực phẩm

# permissionCamera
source: Camera — to photograph food
de: Kamera – um Essen zu fotografieren
es: Cámara: para fotografiar comida.
fr: Appareil photo – pour photographier la nourriture
hi: कैमरा - भोजन की तस्वीरें खींचने के लिए
id: Kamera — untuk memotret makanan
pt: Câmera – para fotografar comida
th: กล้อง — เพื่อถ่ายรูปอาหาร
vi: Máy ảnh - để chụp ảnh đồ ăn

# permissionSkip
source: Skip
de: Überspringen
es: Saltar
fr: Sauter
hi: छोडना
id: Melewati
pt: Pular
th: ข้าม
vi: Nhảy

# permissionAllow
source: Allow
de: Erlauben
es: Permitir
fr: Permettre
hi: अनुमति दें
id: Mengizinkan
pt: Permitir
th: อนุญาต
vi: Cho phép

# permissionAllGranted
source: All permissions granted
de: Alle Berechtigungen erteilt
es: Todos los permisos concedidos
fr: Toutes les autorisations accordées
hi: सभी अनुमतियाँ प्रदान की गईं
id: Semua izin diberikan
pt: Todas as permissões concedidas
th: ได้รับสิทธิ์ทั้งหมดแล้ว
vi: Tất cả các quyền được cấp

# permissionDenied
source: Permission denied: {denied}
de: Berechtigung verweigert: {denied}
es: Permiso denegado: {denied}
fr: Autorisation refusée : {denied}
hi: अनुमति अस्वीकृत: {denied}
id: Izin ditolak: {denied}
pt: Permissão negada: {denied}
th: ปฏิเสธสิทธิ์: {denied}
vi: Quyền bị từ chối: {denied}

source: Open Settings
de: Öffnen Sie Einstellungen
es: Abrir configuración
fr: Ouvrir les paramètres
hi: खुली सेटिंग
id: Buka Pengaturan
pt: Abra Configurações
th: เปิดการตั้งค่า
vi: Mở cài đặt

# exitAppTitle
source: Exit App?
de: App beenden?
es: ¿Salir de la aplicación?
fr: Quitter l'application ?
hi: ऐप से बाहर निकलें?
id: Keluar dari Aplikasi?
pt: Sair do aplicativo?
th: ออกจากแอป?
vi: Thoát ứng dụng?

# exitAppMessage
source: Are you sure you want to exit?
de: Sind Sie sicher, dass Sie den Vorgang beenden möchten?
es: ¿Estás seguro de que quieres salir?
fr: Êtes-vous sûr de vouloir quitter ?
hi: क्या आप निश्चित हैं आपकी बाहर निकलने की इच्छा है?
id: Apakah Anda yakin ingin keluar?
pt: Tem certeza de que deseja sair?
th: คุณแน่ใจหรือไม่ว่าต้องการออก?
vi: Bạn có chắc chắn muốn thoát không?

source: Exit
de: Ausfahrt
es: Salida
fr: Sortie
hi: बाहर निकलना
id: KELUAR
pt: Saída
th: ออก
vi: Ra

# healthGoalsTitle
source: Health Goals
de: Gesundheitsziele
es: Metas de salud
fr: Objectifs de santé
hi: स्वास्थ्य लक्ष्य
id: Tujuan Kesehatan
pt: Metas de saúde
th: เป้าหมายสุขภาพ
vi: Mục tiêu sức khỏe

# healthGoalsInfo
source: Set your daily calorie goal, macros, and per-meal budgets. Lock to auto-calculate: 2 macros or 3 meals.
de: Legen Sie Ihr tägliches Kalorienziel, Ihre Makros und Ihr Budget pro Mahlzeit fest. Sperren, um automatisch zu berechnen: 2 Makros oder 3 Mahlzeiten.
es: Establezca su objetivo diario de calorías, macros y presupuestos por comida. Bloquear para calcular automáticamente: 2 macros o 3 comidas.
fr: Définissez votre objectif calorique quotidien, vos macros et vos budgets par repas. Verrouillage pour calculer automatiquement : 2 macros ou 3 repas.
hi: अपना दैनिक कैलोरी लक्ष्य, मैक्रोज़ और प्रति-भोजन बजट निर्धारित करें। स्वतः-गणना करने के लिए लॉक करें: 2 मैक्रोज़ या 3 भोजन।
id: Tetapkan sasaran kalori harian, makro, dan anggaran per makanan Anda. Kunci untuk menghitung otomatis: 2 makro atau 3 kali makan.
pt: Defina sua meta diária de calorias, macros e orçamentos por refeição. Bloqueie para calcular automaticamente: 2 macros ou 3 refeições.
th: ตั้งเป้าหมายแคลอรี่รายวัน แมโคร และงบประมาณต่อมื้อ ล็อคเพื่อคำนวณอัตโนมัติ: 2 แมโคร หรือ 3 มื้อ
vi: Đặt mục tiêu lượng calo hàng ngày, macro và ngân sách mỗi bữa ăn của bạn. Khóa để tự động tính toán: 2 macro hoặc 3 bữa ăn.

source: Daily Calorie Goal
de: Tägliches Kalorienziel
es: Meta diaria de calorías
fr: Objectif calorique quotidien
hi: दैनिक कैलोरी लक्ष्य
id: Sasaran Kalori Harian
pt: Meta diária de calorias
th: เป้าหมายแคลอรี่รายวัน
vi: Mục tiêu calo hàng ngày

# proteinLabel
source: Protein
es: Proteína
hi: Proटीन
pt: Proteína
th: โปรตีน

# carbsLabel
source: Carbs
de: Kohlenhydrate
es: carbohidratos
fr: Crabes
hi: कार्बोहाइड्रेट
id: Karbohidrat
pt: Carboidratos
th: คาร์บ
vi: Carb

# fatLabel
source: Fat
de: Fett
es: Gordo
fr: Graisse
hi: मोटा
id: Gemuk
pt: Gordo
th: ไขมัน
vi: Mập

# autoBadge
source: auto
hi: ऑटो
id: mobil
vi: tự động

# kcalPerGram
source: {kcalPerGram} kcal/g • {kcal} kcal
de: {kcalPerGram} kcal/g • {kcal} __SW0__
es: {kcalPerGram} kcal/g • {kcal} __SW0__
fr: {kcalPerGram} kcal/g • {kcal} __SW0__
hi: {kcalPerGram} kcal/g • {kcal} __SW0__
id: {kcalPerGram} kcal/g • {kcal} __SW0__
pt: {kcalPerGram} kcal/g • {kcal} __SW0__
vi: {kcalPerGram} kcal/g • {kcal} __SW0__

source: Meal Calorie Budget
de: Kalorienbudget einer Mahlzeit
es: Presupuesto de calorías de las comidas
fr: Budget calorique des repas
hi: भोजन कैलोरी बजट
id: Anggaran Kalori Makanan
pt: Orçamento de calorias de refeição
th: งบประมาณแคลอรี่ต่อมื้อ
vi: Ngân sách calo bữa ăn
