Repository: lnxelnope/miro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, pt, th, vi

source: Save
de: Speichern
es: Ahorrar
fr: Sauvegarder
hi: बचाना
id: Menyimpan
pt: Salvar
th: บันทึก
vi: Cứu

source: Cancel
de: Stornieren
es: Cancelar
fr: Annuler
hi: रद्द करना
id: Membatalkan
pt: Cancelar
th: ยกเลิก
vi: Hủy bỏ

source: Delete
de: Löschen
es: Borrar
fr: Supprimer
hi: मिटाना
id: Menghapus
pt: Excluir
th: ลบ
vi: Xóa bỏ

source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
hi: संपादन करना
id: Sunting
pt: Editar
th: แก้ไข
vi: Biên tập

source: Search
de: Suchen
es: Buscar
fr: Recherche
hi: खोज
id: Mencari
pt: Procurar
th: ค้นหา
vi: Tìm kiếm

source: Loading...
de: Laden...
es: Cargando...
fr: Chargement...
hi: लोड हो रहा है...
id: Memuat...
pt: Carregando...
th: กำลังโหลด...
vi: Đang tải...

# error
source: An error occurred
de: Es ist ein Fehler aufgetreten
es: Se produjo un error
fr: Une erreur s'est produite
hi: एक त्रुटि पाई गई
id: Terjadi kesalahan
pt: Ocorreu um erro
th: เกิดข้อผิดพลาด
vi: Đã xảy ra lỗi

source: Confirm
de: Bestätigen
es: Confirmar
fr: Confirmer
hi: पुष्टि करना
id: Mengonfirmasi
pt: Confirmar
th: ยืนยัน
vi: Xác nhận

source: Close
de: Schließen
es: Cerca
fr: Fermer
hi: बंद करना
id: Menutup
pt: Fechar
th: ปิด
vi: Đóng

source: Done
de: Erledigt
es: Hecho
fr: Fait
hi: हो गया
id: Selesai
pt: Feito
th: เสร็จ
vi: Xong

source: Next
de: Nächste
es: Próximo
fr: Suivant
hi: अगला
id: Berikutnya
pt: Próximo
th: ถัดไป
vi: Kế tiếp

source: Skip
de: Überspringen
es: Saltar
fr: Sauter
hi: छोडना
id: Melewati
pt: Pular
th: ข้าม
vi: Nhảy

source: Retry
de: Wiederholen
es: Rever
fr: Réessayer
hi: पुन: प्रयास करें
id: Mencoba kembali
pt: Tentar novamente
th: ลองใหม่
vi: Thử lại

source: OK
es: DE ACUERDO
fr: D'ACCORD
hi: ठीक है
id: OKE
th: ตกลง
vi: ĐƯỢC RỒI

source: Food name
de: Lebensmittelname
es: Nombre del alimento
fr: Nom de l'aliment
hi: भोजन का नाम
id: Nama makanan
pt: Nome da comida
th: ชื่ออาหาร
vi: Tên món ăn

source: Calories
de: Kalorien
es: calorías
hi: कैलोरी
id: Kalori
pt: Calorias
th: แคลอรี่
vi: Calo

source: Protein
es: Proteína
hi: Proटीन
pt: Proteína
th: โปรตีน

source: Carbs
de: Kohlenhydrate
es: carbohidratos
fr: Crabes
hi: कार्बोहाइड्रेट
id: Karbohidrat
pt: Carboidratos
th: คาร์บ
vi: Carb

source: Fat
de: Fett
es: Gordo
fr: Graisse
hi: मोटा
id: Gemuk
pt: Gordo
th: ไขมัน
vi: Mập

source: Serving size
de: Portionsgröße
es: Tamaño de la porción
fr: Taille de la portion
hi: सेवारत आकार
id: Ukuran porsi
pt: Tamanho da porção
th: ปริมาณ
vi: Kích thước phục vụ

# servingUnit
source: Unit
de: Einheit
es: Unidad
fr: Unité
hi: इकाई
id: Satuan
pt: Unidade
th: หน่วย
vi: Đơn vị

# mealBreakfast
source: Breakfast
de: Frühstück
es: Desayuno
fr: Petit-déjeuner
hi: नाश्ता
id: Sarapan
pt: Café da manhã
th: เช้า
vi: Bữa sáng

# mealLunch
source: Lunch
de: Mittagessen
es: Almuerzo
fr: Déjeuner
hi: दिन का खाना
id: Makan siang
pt: Almoço
th: กลางวัน
vi: Bữa trưa

# mealDinner
source: Dinner
de: Abendessen
es: Cena
fr: Dîner
hi: रात का खाना
id: Makan malam
pt: Jantar
th: เย็น
vi: Bữa tối

# mealSnack
source: Snack
es: Bocadillo
fr: Collation
hi: नाश्ता
id: Camilan
pt: Lanche
th: ของว่าง
vi: Đồ ăn vặt

# todaySummary
source: Today's Summary
de: Die heutige Zusammenfassung
es: Resumen de hoy
fr: Le résumé du jour
hi: आज का सारांश
id: Ringkasan Hari Ini
pt: Resumo de hoje
th: สรุปวันนี้
vi: Tóm tắt hôm nay

# dateSummary
source: Summary for {date}
de: Zusammenfassung für {date}
es: Resumen de {date}
fr: Résumé pour {date}
hi: {date} के लिए सारांश
id: Ringkasan untuk {date}
pt: Resumo para {date}
th: สรุป {date}
vi: Tóm tắt cho {date}

# savedSuccess
source: Saved successfully
de: Erfolgreich gespeichert
es: Guardado exitosamente
fr: Enregistré avec succès
hi: सफलतापूर्वक बचाया
id: Berhasil disimpan
pt: Salvo com sucesso
th: บันทึกเรียบร้อย
vi: Đã lưu thành công

# deletedSuccess
source: Deleted successfully
de: Erfolgreich gelöscht
es: Eliminado exitosamente
fr: Supprimé avec succès
hi: सफलतापूर्वक मिटाया गया
id: Berhasil dihapus
pt: Excluído com sucesso
th: ลบเรียบร้อย
vi: Đã xóa thành công

source: Please enter food name
de: Bitte geben Sie den Lebensmittelnamen ein
es: Por favor ingrese el nombre del alimento
fr: Veuillez entrer le nom de l'aliment
hi: कृपया भोजन का नाम दर्ज करें
id: Silakan masukkan nama makanan
pt: Por favor insira o nome do alimento
th: กรุณากรอกชื่ออาหาร
vi: Vui lòng nhập tên món ăn

source: No data yet
de: Noch keine Daten
es: Aún no hay datos
fr: Aucune donnée pour l'instant
hi: अभी तक कोई डेटा नहीं
id: Belum ada datanya
pt: Ainda não há dados
th: ยังไม่มีข้อมูล
vi: Chưa có dữ liệu

source: Add food
de: Essen hinzufügen
es: agregar comida
fr: Ajouter de la nourriture
hi: भोजन जोड़ें
id: Tambahkan makanan
pt: Adicione comida
th: เพิ่มอาหาร
vi: Thêm thức ăn

source: Edit food
de: Essen bearbeiten
es: Editar comida
fr: Modifier la nourriture
hi: भोजन संपादित करें
id: Sunting makanan
pt: Editar comida
th: แก้ไขอาหาร
vi: Chỉnh sửa món ăn

source: Delete food
de: Lebensmittel löschen
es: eliminar comida
fr: Supprimer la nourriture
hi: खाना हटा दें
id: Hapus makanan
pt: Excluir comida
th: ลบอาหาร
vi: Xóa thực phẩm

# deleteConfirm
source: Confirm delete?
de: Löschen bestätigen?
es: ¿Confirmar eliminación?
fr: Confirmer la suppression ?
hi: हटाने की पुष्टि करें?
id: Konfirmasi penghapusan?
pt: Confirmar exclusão?
th: ยืนยันการลบ?
vi: Xác nhận xóa?

# foodLoggedSuccess
source: Food logged!
de: Essen protokolliert!
es: ¡Comida registrada!
fr: Nourriture enregistrée !
hi: भोजन लॉग किया गया!
id: Makanan dicatat!
pt: Alimentos registrados!
th: บันทึกอาหารแล้ว!
vi: Thực phẩm được ghi lại!

# noApiKey
source: Please set up Gemini API Key
de: Bitte richten Sie Gemini API Key ein
es: Por favor configure Gemini API Key
fr: Veuillez configurer Gemini API Key
hi: कृपया Gemini API Key सेट करें
id: Harap siapkan Gemini API Key
pt: Configure Gemini API Key
th: กรุณาตั้งค่า Gemini API Key
vi: Vui lòng thiết lập Gemini API Key

# noApiKeyDescription
source: Go to Profile → API Settings to set up
de: Gehen Sie zum Einrichten zu Profile → API Settings
es: Vaya a Profile → API Configuración para configurar
fr: Accédez au fichier Pro → API Paramètres à configurer
hi: सेट अप करने के लिए Profile → API सेटिंग्स पर जाएं
id: Buka Profile → API Pengaturan untuk menyiapkan
pt: Vá para Profile → API Configurações para configurar
th: ไปที่ โปรไฟล์ → API Settings เพื่อตั้งค่า
vi: Vào Profile → API Cài đặt để thiết lập

# apiKeyTitle
source: Set up Gemini API Key
de: Einrichten Gemini API Key
es: Configurar Gemini API Key
fr: Configurer Gemini API Key
hi: Gemini API Key सेट करें
id: Siapkan Gemini API Key
pt: Configurar Gemini API Key
th: ตั้งค่า Gemini API Key
vi: Thiết lập Gemini API Key

source: API Key required
de: API Key erforderlich
es: API Key requerido
fr: API Key requis
hi: API Key आवश्यक
id: API Key diperlukan
pt: API Key obrigatório
th: ต้องการ API Key
vi: API Key bắt buộc

# apiKeyFreeNote
source: Gemini API is free to use
de: Die Nutzung von Gemini API ist kostenlos
es: Gemini API es de uso gratuito
fr: Gemini API est gratuit
hi: Gemini API का उपयोग निःशुल्क है
id: Gemini API gratis untuk digunakan
pt: Gemini API é de uso gratuito
th: Gemini API ใช้ฟรี ไม่ต้องจ่ายเงิน
vi: Gemini API được sử dụng miễn phí

# apiKeySetup
source: Set up API Key
de: API Key einrichten
es: Configurar API Key
fr: Configurer API Key
hi: API Key सेट करें
id: Siapkan API Key
pt: Configurar API Key
th: ตั้งค่า API Key
vi: Thiết lập API Key

source: Test connection
de: Testverbindung
es: Conexión de prueba
fr: Tester la connexion
hi: कनेक्शन का परीक्षण करें
id: Uji koneksi
pt: Conexão de teste
th: ทดสอบการเชื่อมต่อ
vi: Kiểm tra kết nối

# connectionSuccess
source: Connected successfully! Ready to use
de: Erfolgreich verbunden! Gebrauchsfertig
es: ¡Conectado exitosamente! Preparado para usar
fr: Connecté avec succès ! Prêt à l'emploi
hi: सफलतापूर्वक कनेक्ट हो गया! इस्तेमाल के लिए तैयार
id: Berhasil terhubung! Siap digunakan
pt: Conectado com sucesso! Pronto para usar
th: เชื่อมต่อสำเร็จ! พร้อมใช้งาน
vi: Đã kết nối thành công! Sẵn sàng để sử dụng

source: Connection failed
de: Verbindung fehlgeschlagen
es: La conexión falló
fr: La connexion a échoué
hi: कनेक्शन विफल
id: Koneksi gagal
pt: Falha na conexão
th: เชื่อมต่อไม่สำเร็จ
vi: Kết nối không thành công

# pasteKey
source: Paste
es: Pasta
fr: Coller
hi: पेस्ट करें
id: Pasta
pt: Colar
th: วาง
vi: Dán

# deleteKey
source: Delete API Key
de: API Key löschen
es: Eliminar API Key
fr: Supprimer API Key
hi: API Key हटाएं
id: Hapus API Key
pt: Excluir API Key
th: ลบ API Key
vi: Xóa API Key

# openAiStudio
source: Open Google AI Studio
de: Öffnen Sie Google AI Studio
es: Abierto Google AI Studio
fr: Ouvrir Google AI Studio
hi: Google AI Studio खोलें
id: Buka Google AI Studio
pt: Abra Google AI Studio
th: เปิด Google AI Studio
vi: Mở Google AI Studio

# chatHint
source: Tell Miro e.g. "Log fried rice"...
de: Sagen Sie Miro z.B. „Gebratener Reis“...
es: Dígale a Miro, p. "Arroz frito con troncos"...
fr: Dites à Miro par ex. "Bûche de riz frit"...
hi: Miro बताएं जैसे "लॉग फ्राइड राइस"...
id: Beritahu Miro mis. "Log nasi goreng"...
pt: Diga Miro, por exemplo. "Arroz frito"...
th: สั่ง Miro เช่น "บันทึกข้าวผัด"...
vi: Nói với Miro ví dụ: "Cơm chiên khúc gỗ"...

# chatFoodSaved
source: Food logged!
de: Essen protokolliert!
es: ¡Comida registrada!
fr: Nourriture enregistrée !
hi: भोजन लॉग किया गया!
id: Makanan dicatat!
pt: Alimentos registrados!
th: บันทึกอาหารแล้ว!
vi: Thực phẩm được ghi lại!

# featureNotAvailable
source: Sorry, this feature is not available yet
de: Leider ist diese Funktion noch nicht verfügbar
es: Lo sentimos, esta función aún no está disponible
fr: Désolé, cette fonctionnalité n'est pas encore disponible
hi: क्षमा करें, यह सुविधा अभी तक उपलब्ध नहीं है
id: Maaf, fitur ini belum tersedia
pt: Desculpe, este recurso ainda não está disponível
th: ขออภัย ฟังก์ชันนี้ยังไม่พร้อมในเวอร์ชันนี้
vi: Rất tiếc, tính năng này chưa khả dụng

# goalCalories
source: Calories/day
de: Kalorien/Tag
es: Calorías/día
fr: Calories/jour
hi: कैलोरी/दिन
id: Kalori/hari
pt: Calorias/dia
th: แคลอรี่/วัน
vi: Calo/ngày

# goalProtein
source: Protein/day
de: Protein/Tag
es: Proteína/día
fr: Protein/jour
hi: Proतीन/दिन
id: Protein/hari
pt: Proteína/dia
th: โปรตีน/วัน
vi: Protein/ngày

# goalCarbs
source: Carbs/day
de: Kohlenhydrate/Tag
es: carbohidratos/día
fr: Glucides/jour
hi: कार्ब्स/दिन
id: Karbohidrat/hari
pt: Carboidratos/dia
th: คาร์บ/วัน
vi: Carb/ngày

# goalFat
source: Fat/day
de: Fett/Tag
es: Grasa/día
fr: Graisse/jour
hi: मोटा/दिन
id: Lemak/hari
pt: Gordura/dia
th: ไขมัน/วัน
vi: Béo/ngày

# goalWater
source: Water/day
de: Wasser/Tag
es: Agua/día
fr: Eau/jour
hi: जल डे
id: Air/hari
pt: Água/dia
th: น้ำ/วัน
vi: Nước/ngày

source: Health Goals
de: Gesundheitsziele
es: Metas de salud
fr: Objectifs de santé
hi: स्वास्थ्य लक्ष्य
id: Tujuan Kesehatan
pt: Metas de saúde
th: เป้าหมายสุขภาพ
vi: Mục tiêu sức khỏe

source: Profile
de: ProDatei
es: Proarchivo
fr: Fichier Pro
hi: Proफ़ाइल
id: Proberkas
pt: Proarquivo
th: โปรไฟล์
vi: Protập tin

source: Settings
de: Einstellungen
es: Ajustes
fr: Paramètres
hi: सेटिंग्स
id: Pengaturan
pt: Configurações
th: การตั้งค่า
vi: Cài đặt

source: Privacy Policy
de: Datenschutzrichtlinie
es: política de privacidad
fr: politique de confidentialité
hi: गोपनीयता नीति
id: Kebijakan Privasi
pt: política de Privacidade
th: นโยบายความเป็นส่วนตัว
vi: Chính sách bảo mật

source: Terms of Service
de: Nutzungsbedingungen
es: Términos de servicio
fr: Conditions d'utilisation
hi: सेवा की शर्तें
id: Ketentuan Layanan
pt: Termos de Serviço
th: เงื่อนไขการใช้งาน
vi: Điều khoản dịch vụ

source: Clear all data
de: Alle Daten löschen
es: Borrar todos los datos
fr: Effacer toutes les données
hi: सभी डेटा साफ़ करें
id: Hapus semua data
pt: Limpar todos os dados
th: ล้างข้อมูลทั้งหมด
vi: Xóa tất cả dữ liệu

# clearAllDataConfirm
source: All data will be deleted. This cannot be undone!
de: Alle Daten werden gelöscht. Dies kann nicht rückgängig gemacht werden!
es: Todos los datos serán eliminados. ¡Esto no se puede deshacer!
fr: Toutes les données seront supprimées. Cela ne peut pas être annulé !
hi: सारा डेटा हटा दिया जाएगा. इसे असंपादित नहीं किया जा सकता है!
id: Semua data akan dihapus. Hal ini tidak dapat dibatalkan!
pt: Todos os dados serão excluídos. Isso não pode ser desfeito!
th: ข้อมูลทั้งหมดจะถูกลบ ลบแล้วกู้คืนไม่ได้!
vi: Tất cả dữ liệu sẽ bị xóa. Điều này không thể được hoàn tác!

source: About
de: Um
es: Acerca de
fr: À propos
hi: के बारे में
id: Tentang
pt: Sobre
th: เกี่ยวกับแอป
vi: Về

source: Language
de: Sprache
es: Idioma
fr: Langue
hi: भाषा
id: Bahasa
pt: Linguagem
th: ภาษา
vi: Ngôn ngữ

# upgradePro
source: Upgrade to Pro
de: Upgrade auf Pro
es: Actualizar a Pro
fr: Mise à niveau vers Pro
hi: Pro पर अपग्रेड करें
id: Tingkatkan ke Pro
pt: Atualizar para Pro
th: อัปเกรด Pro
vi: Nâng cấp lên Pro

# proDescription
source: Unlimited AI food analysis
de: Unbegrenzte KI-Lebensmittelanalyse
es: Análisis ilimitado de alimentos con IA
fr: Analyse alimentaire illimitée par l'IA
hi: असीमित एआई खाद्य विश्लेषण
id: Analisis makanan AI tanpa batas
pt: Análise ilimitada de alimentos com IA
th: ใช้ AI วิเคราะห์อาหารไม่จำกัด
vi: Phân tích thực phẩm AI không giới hạn

# aiRemaining
source: AI analysis: {remaining}/{total} remaining today
de: KI-Analyse: {remaining}/{total} verbleiben heute
es: Análisis de IA: {remaining}/{total} restantes hoy
fr: Analyse IA : {remaining}/{total} restants aujourd'hui
hi: एआई विश्लेषण: {remaining}/{total} आज शेष है
id: Analisis AI: {remaining}/{total} tersisa hari ini
pt: Análise de IA: {remaining}/{total} restantes hoje
th: AI วิเคราะห์: เหลือ {remaining}/{total} ครั้งวันนี้
vi: Phân tích AI: {remaining}/{total} còn lại hôm nay

# aiLimitReached
source: AI limit reached for today (3/3)
de: KI-Grenze für heute erreicht (3/3)
es: Límite de IA alcanzado para hoy (3/3)
fr: Limite IA atteinte pour aujourd'hui (3/3)
hi: आज के लिए AI सीमा पूरी हो गई (3/3)
id: Batas AI tercapai hari ini (3/3)
pt: Limite de IA atingido para hoje (3/3)
th: ใช้ AI ครบ 3 ครั้งแล้ววันนี้
vi: Đã đạt giới hạn AI cho ngày hôm nay (3/3)

source: Restore purchase
de: Kauf wiederherstellen
es: Restaurar compra
fr: Restaurer l'achat
hi: पुनःस्थापन क्रय
id: Pulihkan pembelian
pt: Restaurar compra
th: กู้คืนการซื้อ
vi: Khôi phục mua hàng

source: My Meals:
de: Meine Mahlzeiten:
es: Mis comidas:
fr: Mes repas :
hi: मेरा भोजन:
id: Makanan Saya:
pt: Minhas refeições:
th: อาหารของฉัน:
vi: Bữa ăn của tôi:

source: Create Meal
de: Mahlzeit erstellen
es: Crear comida
fr: Créer un repas
hi: भोजन बनाएँ
id: Buat Makanan
pt: Criar refeição
th: สร้างเมนู
vi: Tạo bữa ăn

source: Ingredients
fr: Ingrédients
hi: सामग्री
id: Bahan-bahan
th: ส่วนประกอบ

source: Search food
de: Essen suchen
es: buscar comida
fr: Rechercher de la nourriture
hi: भोजन खोजें
id: Cari makanan
pt: Pesquisar comida
th: ค้นหาอาหาร
vi: Tìm kiếm món ăn

source: Analyzing...
de: Analysieren...
es: Analizando...
fr: Analyser...
hi: विश्लेषण कर रहा हूँ...
id: Menganalisis...
pt: Analisando...
th: กำลังวิเคราะห์...
vi: Đang phân tích...

source: Analyze with AI
de: Analysieren Sie mit KI
es: Analizar con IA
fr: Analyser avec l'IA
hi: एआई के साथ विश्लेषण करें
id: Analisis dengan AI
pt: Analise com IA
th: วิเคราะห์ด้วย AI
vi: Phân tích bằng AI

source: Analysis complete
de: Analyse abgeschlossen
es: Análisis completo
fr: Analyse terminée
hi: विश्लेषण पूरा हुआ
id: Analisis selesai
pt: Análise concluída
th: วิเคราะห์เสร็จ
vi: Phân tích hoàn tất

source: Timeline
de: Zeitleiste
es: Línea de tiempo
fr: Chronologie
hi: समय
id: Garis Waktu
pt: Linha do tempo
vi: Dòng thời gian

source: Diet
de: Diät
es: Dieta
fr: Régime
hi: आहार
pt: Dieta
vi: Ăn kiêng

source: Quick Add
de: Schnell hinzufügen
es: Agregar rápido
fr: Ajout rapide
hi: शीघ्र जोड़ें
id: Tambah Cepat
pt: Adição rápida
vi: Thêm nhanh

# welcomeSubtitle
source: Easy food logging with AI
de: Einfache Lebensmittelprotokollierung mit KI
es: Registro de alimentos sencillo con IA
fr: Enregistrement facile des aliments avec l'IA
hi: एआई के साथ आसान भोजन लॉगिंग
id: Pencatatan makanan yang mudah dengan AI
pt: Registro fácil de alimentos com IA
th: บันทึกอาหารง่ายๆ ด้วย AI
vi: Ghi nhật ký thực phẩm dễ dàng với AI

# onboardingFeature1
source: Snap a photo
de: Machen Sie ein Foto
es: Toma una foto
fr: Prendre une photo
hi: एक फोटो खींचो
id: Ambil foto
pt: Tire uma foto
th: ถ่ายรูปอาหาร
vi: Chụp ảnh

# onboardingFeature1Desc
source: AI calculates calories automatically
de: KI berechnet Kalorien automatisch
es: La IA calcula las calorías automáticamente
fr: L'IA calcule automatiquement les calories
hi: AI स्वचालित रूप से कैलोरी की गणना करता है
id: AI menghitung kalori secara otomatis
pt: AI calcula calorias automaticamente
th: AI วิเคราะห์ kcal อัตโนมัติ
vi: AI tự động tính toán lượng calo

# onboardingFeature2
source: Type to log
de: Geben Sie Folgendes ein, um sich zu protokollieren
es: Escriba para iniciar sesión
fr: Tapez pour vous connecter
hi: लॉग करने के लिए टाइप करें
id: Ketik untuk mencatat
pt: Digite para registrar
th: พิมพ์แชท
vi: Nhập để đăng nhập

# onboardingFeature2Desc
source: Say "had fried rice" and it's logged
de: Sagen Sie „hatte gebratenen Reis“ und es wird protokolliert
es: Di "comí arroz frito" y se registrará.
fr: Dites "j'avais du riz frit" et c'est enregistré
hi: कहें "तला हुआ चावल खाया" और यह लॉग हो गया
id: Ucapkan "nasi goreng" dan itu dicatat
pt: Diga "comi arroz frito" e está registrado
th: บอกว่า "กินข้าวผัด" → บันทึกให้เลย
vi: Nói "đã ăn cơm chiên" và nó được ghi lại

# onboardingFeature3
source: Daily summary
de: Tägliche Zusammenfassung
es: Resumen diario
fr: Résumé quotidien
hi: दैनिक सारांश
id: Ringkasan harian
pt: Resumo diário
th: สรุปทุกวัน
vi: Tóm tắt hàng ngày

# onboardingFeature3Desc
source: Track kcal, protein, carbs, fat
de: Verfolgen Sie kcal, Protein, Kohlenhydrate, Fett
es: Seguimiento kcal, proteínas, carbohidratos, grasas
fr: Suivez kcal, protéines, glucides, graisses
hi: ट्रैक kcal, प्रोटीन, कार्बोहाइड्रेट, वसा
id: Lacak kcal, protein, karbohidrat, lemak
pt: Rastreie kcal, proteínas, carboidratos, gordura
th: ดู kcal, โปรตีน, คาร์บ, ไขมัน
vi: Theo dõi kcal, protein, carbs, chất béo

source: Basic Info
de: Grundlegende Informationen
es: Información básica
fr: Informations de base
hi: बुनियादी जानकारी
id: Info Dasar
pt: Informações básicas
th: ข้อมูลพื้นฐาน
vi: Thông tin cơ bản

# basicInfoDesc
source: To calculate your recommended daily calories
de: Um Ihre empfohlenen täglichen Kalorien zu berechnen
es: Para calcular tus calorías diarias recomendadas
fr: Pour calculer vos calories quotidiennes recommandées
hi: आपकी अनुशंसित दैनिक कैलोरी की गणना करने के लिए
id: Untuk menghitung kalori harian yang Anda rekomendasikan
pt: Para calcular suas calorias diárias recomendadas
th: เพื่อคำนวณเป้าหมายแคลอรี่ที่เหมาะกับคุณ
vi: Để tính lượng calo khuyến nghị hàng ngày của bạn

source: Gender
de: Geschlecht
es: Género
fr: Genre
hi: लिंग
id: Jenis kelamin
pt: Gênero
th: เพศ
vi: Giới tính

source: Male
de: Männlich
es: Masculino
fr: Mâle
hi: पुरुष
id: Pria
pt: Macho
th: ชาย
vi: Nam giới

source: Female
de: Weiblich
es: Femenino
fr: Femelle
hi: महिला
id: Perempuan
pt: Fêmea
th: หญิง
vi: Nữ giới

source: Age
de: Alter
es: Edad
fr: Âge
hi: आयु
id: Usia
pt: Idade
th: อายุ
vi: Tuổi

source: Weight
de: Gewicht
es: Peso
fr: Poids
hi: वज़न
id: Berat
pt: Peso
th: น้ำหนัก
vi: Cân nặng

source: Height
de: Höhe
es: Altura
fr: Hauteur
hi: ऊंचाई
id: Tinggi
pt: Altura
th: ส่วนสูง
vi: Chiều cao

source: Activity Level
de: Aktivitätsniveau
es: Nivel de actividad
fr: Niveau d'activité
hi: गतिविधि स्तर
id: Tingkat Aktivitas
pt: Nível de atividade
th: ระดับกิจกรรม
vi: Cấp độ hoạt động

# tdeeResult
source: Your TDEE: {kcal} kcal/day
de: Ihr TDEE: {kcal} kcal/Tag
es: Su TDEE: {kcal} kcal/día
fr: Votre TDEE : {kcal} kcal/jour
hi: आपका TDEE: {kcal} kcal/दिन
id: TDEE Anda: {kcal} kcal/hari
pt: Seu TDEE: {kcal} kcal/dia
th: TDEE ของคุณ: {kcal} kcal/วัน
vi: TDEE của bạn: {kcal} kcal/ngày

# setupAiTitle
source: Set up Gemini AI
de: Richten Sie Gemini AI ein
es: Configurar Gemini AI
fr: Configurer Gemini IA
hi: Gemini AI सेट करें
id: Siapkan Gemini AI
pt: Configurar Gemini IA
th: ตั้งค่า Gemini AI
vi: Thiết lập Gemini AI

# setupAiDesc
source: Snap a photo and AI analyzes it automatically
de: Machen Sie ein Foto und die KI analysiert es automatisch
es: Toma una foto y la IA la analiza automáticamente
fr: Prenez une photo et l'IA l'analyse automatiquement
hi: एक फोटो खींचें और AI स्वचालित रूप से उसका विश्लेषण करेगा
id: Ambil foto dan AI menganalisisnya secara otomatis
pt: Tire uma foto e a IA a analisa automaticamente
th: ถ่ายรูปอาหาร → AI วิเคราะห์ให้อัตโนมัติ
vi: Chụp ảnh và AI sẽ tự động phân tích nó

source: Set up now
de: Jetzt einrichten
es: Configurar ahora
fr: Configurer maintenant
hi: अभी सेट करें
id: Siapkan sekarang
pt: Configurar agora
th: ตั้งค่าเลย
vi: Thiết lập ngay bây giờ

source: Skip for now
de: Überspringen Sie es vorerst
es: Saltar por ahora
fr: Passer pour l'instant
hi: अभी के लिए छोड़ दे
id: Lewati untuk saat ini
pt: Pular por enquanto
th: ข้ามไปก่อน → เข้าแอป
vi: Bỏ qua bây giờ

# errorTimeout
source: Connection timeout — please try again
de: Verbindungszeitüberschreitung – bitte versuchen Sie es erneut
es: Tiempo de espera de conexión: inténtelo de nuevo
fr: Délai de connexion expiré : veuillez réessayer
hi: कनेक्शन समयबाह्य - कृपया पुनः प्रयास करें
id: Batas waktu koneksi habis — silakan coba lagi
pt: Tempo limite de conexão — tente novamente
th: หมดเวลาเชื่อมต่อ — ลองใหม่อีกครั้ง
vi: Hết thời gian kết nối - vui lòng thử lại

# errorInvalidKey
source: Invalid API Key — check your settings
de: Ungültiger API Key – überprüfen Sie Ihre Einstellungen
es: API Key no válido: verifique su configuración
fr: API Key invalide : vérifiez vos paramètres
hi: अमान्य API Key — अपनी सेटिंग्स जांचें
id: API Key tidak valid — periksa pengaturan Anda
pt: API Key inválido — verifique suas configurações
th: API Key ไม่ถูกต้อง — ตรวจสอบการตั้งค่า
vi: API Key không hợp lệ — hãy kiểm tra cài đặt của bạn

# errorNoInternet
source: No internet connection
de: Keine Internetverbindung
es: Sin conexión a internet
fr: Pas de connexion Internet
hi: कोई इंटरनेट कनेक्शन नहीं
id: Tidak ada koneksi internet
pt: Sem conexão com a internet
th: ไม่มีอินเทอร์เน็ต — ตรวจสอบการเชื่อมต่อ
vi: Không có kết nối internet

# errorGeneral
source: An error occurred — please try again
de: Es ist ein Fehler aufgetreten. Bitte versuchen Sie es erneut
es: Se produjo un error. Inténtelo de nuevo.
fr: Une erreur s'est produite — veuillez réessayer
hi: एक त्रुटि हुई थी। कृपया दोबारा प्रयास करें
id: Terjadi kesalahan — silakan coba lagi
pt: Ocorreu um erro. Tente novamente
th: เกิดข้อผิดพลาด — ลองใหม่อีกครั้ง
vi: Đã xảy ra lỗi - vui lòng thử lại

# errorQuotaExceeded
source: API quota exceeded — please wait and retry
de: API-Kontingent überschritten – bitte warten Sie und versuchen Sie es erneut
es: Se superó la cuota API. Espere y vuelva a intentarlo.
fr: Quota API dépassé : veuillez patienter et réessayer
hi: API कोटा पार हो गया - कृपया प्रतीक्षा करें और पुनः प्रयास करें
id: Kuota API terlampaui — harap tunggu dan coba lagi
pt: Cota API excedida. Aguarde e tente novamente
th: ใช้ API เกินโควต้า — รอสักครู่แล้วลองใหม่
vi: API đã vượt quá hạn ngạch — vui lòng đợi và thử lại

# apiKeyScreenTitle
source: Set up Gemini API Key
de: Einrichten Gemini API Key
es: Configurar Gemini API Key
fr: Configurer Gemini API Key
hi: Gemini API Key सेट करें
id: Siapkan Gemini API Key
pt: Configurar Gemini API Key
th: ตั้งค่า Gemini API Key
vi: Thiết lập Gemini API Key

source: Analyze food with AI
de: Analysieren Sie Lebensmittel mit KI
es: Analizar alimentos con IA
fr: Analyser les aliments avec l'IA
hi: एआई के साथ भोजन का विश्लेषण करें
id: Analisis makanan dengan AI
pt: Analise alimentos com IA
th: วิเคราะห์อาหารด้วย AI
vi: Phân tích thực phẩm bằng AI
