Repository: lnxelnope/miro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, pt, th, vi

# greetingCalorieSummary
source: Hi! How can I help you today? You still have {remaining} kcal left. So far: Protein {protein}g, Carbs {carbs}g, Fat {fat}g. Tell me what you ate — list everything by meal and I'll log them all for you. More Detail more precise!!
de: Hallo! Wie kann ich Ihnen heute helfen? Sie haben noch {remaining} kcal übrig. Bisher: Protein {protein}g, Kohlenhydrate {carbs}g, Fett {fat}g. Sagen Sie mir, was Sie gegessen haben – listen Sie alles nach Mahlzeit auf und ich protokolliere alles für Sie. Mehr Details, genauer!!
es: ¡Hola! ¿Cómo puedo ayudarte hoy? Todavía te queda {remaining} kcal. Hasta ahora: Proteína {protein}g, carbohidratos {carbs}g, grasas {fat}g. Dígame qué comió; enumere todo por comida y lo registraré todo por usted. ¡Más detalles más precisos!
fr: Salut! Comment puis-je vous aider aujourd'hui ? Il vous reste encore {remaining} kcal. Jusqu'à présent : Protein {protein}g, glucides {carbs}g, lipides {fat}g. Dites-moi ce que vous avez mangé – listez tout par repas et je les enregistrerai tous pour vous. Plus de détails plus précis !!
hi: नमस्ते! आज मैं आपकी मदद करने में कैसे सक्षम हूं? आपके पास अभी भी {remaining} kcal शेष है। अब तक: Protein {protein}g, कार्ब्स {carbs}g, वसा {fat}g। मुझे बताएं कि आपने क्या खाया - भोजन के अनुसार सब कुछ सूचीबद्ध करें और मैं उन सभी को आपके लिए लॉग कर दूंगा। अधिक विवरण अधिक सटीक!!
id: Hai! Apa yang bisa saya bantu hari ini? Anda masih memiliki {remaining} kcal tersisa. Sejauh ini: Protein {protein}g, Karbohidrat {carbs}g, Lemak {fat}g. Beri tahu saya apa yang Anda makan — daftarkan semuanya berdasarkan makanan dan saya akan mencatat semuanya untuk Anda. Lebih Detail lebih tepat!!
pt: Oi! Como posso ajudá-lo hoje? Você ainda tem {remaining} kcal sobrando. Até agora: Proteína {protein}g, Carboidratos {carbs}g, Gordura {fat}g. Diga-me o que você comeu - liste tudo por refeição e eu registrarei tudo para você. Mais detalhes mais precisos!!
th: สวัสดีค่ะ วันนี้ช่วยอะไรได้บ้าง? ตอนนี้คุณเหลือแคลอรี่ให้ทานอีก {remaining} kcal ทานโปรตีน {protein}g คาร์บ {carbs}g ไขมัน {fat}g ทานอะไรเล่าให้ฉันฟัง แยกเป็นมื้อๆ มาทีเดียวได้เลยค่ะ ดิฉันจะแยกเป็นรายการๆ และบันทึกให้เองค่ะ ยิ่งบอกละเอียด ยิ่งแม่นยำคะ
vi: CHÀO! Hôm nay tôi có thể giúp gì cho bạn? Bạn vẫn còn {remaining} kcal. Cho đến nay: Protein {protein}g, Carbs {carbs}g, Chất béo {fat}g. Hãy cho tôi biết bạn đã ăn gì - liệt kê mọi thứ theo bữa ăn và tôi sẽ ghi lại tất cả cho bạn. Thêm chi tiết chính xác hơn!!

# greetingCuisineTip
source: Your preferred cuisine is set to {cuisine}. You can change it in Settings anytime!
de: Ihre bevorzugte Küche ist auf {cuisine} eingestellt. Sie können es jederzeit in den Einstellungen ändern!
es: Su cocina preferida está configurada en {cuisine}. ¡Puedes cambiarlo en Configuración en cualquier momento!
fr: Votre cuisine préférée est définie sur {cuisine}. Vous pouvez le modifier dans les paramètres à tout moment !
hi: आपका पसंदीदा व्यंजन {cuisine} पर सेट है। आप इसे सेटिंग में कभी भी बदल सकते हैं!
id: Masakan pilihan Anda disetel ke {cuisine}. Anda dapat mengubahnya di Pengaturan kapan saja!
pt: Sua culinária preferida está definida como {cuisine}. Você pode alterá-lo em Configurações a qualquer momento!
th: ตอนนี้คุณตั้งค่าอาหารที่ทานบ่อยเป็น {cuisine} หากต้องการเปลี่ยนแปลง สามารถเปลี่ยนได้ที่การตั้งค่านะคะ
vi: Món ăn ưa thích của bạn được đặt thành {cuisine}. Bạn có thể thay đổi nó trong Cài đặt bất cứ lúc nào!

# greetingEnergyTip
source: You have {balance} Energy available. Don't forget to claim your daily streak reward on the Energy badge!
de: Ihnen stehen {balance} Energie zur Verfügung. Vergessen Sie nicht, Ihre tägliche Streak-Belohnung auf dem Energieabzeichen einzufordern!
es: Tienes {balance} Energía disponible. ¡No olvides reclamar tu recompensa de racha diaria en la insignia de Energía!
fr: Vous disposez de {balance} Énergie. N'oubliez pas de réclamer votre récompense de séquence quotidienne sur le badge Énergie !
hi: आपके पास {balance} ऊर्जा उपलब्ध है। एनर्जी बैज पर अपने दैनिक स्ट्रीक पुरस्कार का दावा करना न भूलें!
id: Anda memiliki {balance} Energi yang tersedia. Jangan lupa untuk mengklaim hadiah pukulan harian Anda pada lencana Energi!
pt: Você tem {balance} Energia disponível. Não se esqueça de resgatar sua recompensa diária no emblema de Energia!
th: ตอนนี้คุณมี Energy อีก {balance} กดเคลมได้ที่แถบ streak ได้นะคะ
vi: Bạn có sẵn {balance} Năng lượng. Đừng quên nhận phần thưởng liên tục hàng ngày của bạn trên huy hiệu Năng lượng!

# greetingRenamePhotoTip
source: Tip: You can rename food photos to help MiRO analyze more accurately!
de: Tipp: Sie können Lebensmittelfotos umbenennen, um MiRO eine genauere Analyse zu ermöglichen!
es: Consejo: ¡Puedes cambiar el nombre de las fotos de alimentos para ayudar a MiRO a analizarlas con mayor precisión!
fr: Astuce : Vous pouvez renommer les photos de plats pour aider MiRO à analyser plus précisément !
hi: युक्ति: MiRO को अधिक सटीकता से विश्लेषण करने में सहायता के लिए आप भोजन फ़ोटो का नाम बदल सकते हैं!
id: Tip: Anda dapat mengganti nama foto makanan untuk membantu MiRO menganalisis dengan lebih akurat!
pt: Dica: você pode renomear fotos de alimentos para ajudar MiRO a analisar com mais precisão!
th: คุณสามารถเปลี่ยนชื่ออาหารของรูปถ่ายเพื่อให้ MiRO วิเคราะห์ได้แม่นยำขึ้นนะคะ
vi: Mẹo: Bạn có thể đổi tên ảnh đồ ăn để giúp MiRO phân tích chính xác hơn!

# greetingAddIngredientsTip
source: Tip: You can add ingredients you're sure about before sending to MiRO for analysis. I'll figure out all the boring little details for you!
de: Tipp: Sie können Zutaten hinzufügen, bei denen Sie sich sicher sind, bevor Sie sie zur Analyse an MiRO senden. Ich werde all die langweiligen kleinen Details für Sie herausfinden!
es: Consejo: Puede agregar ingredientes de los que esté seguro antes de enviarlos a MiRO para su análisis. ¡Me ocuparé de todos los pequeños detalles aburridos por ti!
fr: Astuce : Vous pouvez ajouter des ingrédients dont vous êtes sûr avant de les envoyer à MiRO pour analyse. Je vais comprendre tous les petits détails ennuyeux pour vous !
hi: युक्ति: आप विश्लेषण के लिए MiRO पर भेजने से पहले ऐसी सामग्री जोड़ सकते हैं जिसके बारे में आप निश्चित हों। मैं आपके लिए सभी उबाऊ छोटी-छोटी जानकारियों का पता लगाऊंगा!
id: Tip: Anda dapat menambahkan bahan-bahan yang Anda yakini sebelum mengirim ke MiRO untuk dianalisis. Saya akan memikirkan semua detail kecil yang membosankan untuk Anda!
pt: Dica: você pode adicionar ingredientes de que tenha certeza antes de enviar para MiRO para análise. Vou descobrir todos os pequenos detalhes chatos para você!
th: คุณสามารถเพิ่มวัตถุดิบที่คุณมั่นใจในปริมาณที่ทานไปในรายการก่อนส่งมาให้ MiRO วิเคราะห์ได้นะ ฉันจะวิเคราะห์ส่วนยิบย่อยน่าเบื่อให้เอง
vi: Mẹo: Bạn có thể thêm các thành phần mà bạn chắc chắn trước khi gửi tới MiRO để phân tích. Tôi sẽ tìm ra tất cả những chi tiết nhỏ nhàm chán cho bạn!

# greetingBackupReminder
source: Hey boss! You haven't backed up your data for {days} days. I recommend backing up in Settings — your data is stored locally and I can't recover it if something happens!
de: Hey Chef! Sie haben Ihre Daten seit {days} Tagen nicht gesichert. Ich empfehle die Sicherung in den Einstellungen – Ihre Daten werden lokal gespeichert und ich kann sie nicht wiederherstellen, wenn etwas passiert!
es: ¡Hola jefe! No has realizado una copia de seguridad de tus datos durante {days} días. Recomiendo hacer una copia de seguridad en Configuración: sus datos se almacenan localmente y no puedo recuperarlos si sucede algo.
fr: Hé patron ! Vous n'avez pas sauvegardé vos données depuis {days} jours. Je recommande de sauvegarder dans Paramètres : vos données sont stockées localement et je ne peux pas les récupérer si quelque chose arrive !
hi: अरे मालिक! आपने {days} दिनों से अपने डेटा का बैकअप नहीं लिया है। मैं सेटिंग्स में बैकअप लेने की सलाह देता हूं - आपका डेटा स्थानीय रूप से संग्रहीत है और अगर कुछ होता है तो मैं इसे पुनर्प्राप्त नहीं कर सकता!
id: Hai bos! Anda belum mencadangkan data Anda selama {days} hari. Saya sarankan membuat cadangan di Pengaturan — data Anda disimpan secara lokal dan saya tidak dapat memulihkannya jika terjadi sesuatu!
pt: Ei chefe! Você não faz backup dos seus dados há {days} dias. Recomendo fazer backup em Configurações — seus dados são armazenados localmente e não poderei recuperá-los se algo acontecer!
th: เจ้านายตอนนี้คุณไม่ได้ backup ข้อมูลมาแล้ว {days} วันนะคะ ดิฉันแนะนำให้ backup ใน Setting เพราะข้อมูลของเจ้านายอยู่ในเครื่อง ไม่ได้อยู่ใน internet และฉันไม่สามารถกู้คืนข้อมูลให้ได้นะคะ
vi: Này ông chủ! Bạn chưa sao lưu dữ liệu của mình trong {days} ngày. Tôi khuyên bạn nên sao lưu trong Cài đặt — dữ liệu của bạn được lưu trữ cục bộ và tôi không thể khôi phục dữ liệu đó nếu có chuyện gì xảy ra!

# greetingFallback
source: Hi! How can I help you today? Tell me what you ate!
de: Hallo! Wie kann ich Ihnen heute helfen? Sag mir, was du gegessen hast!
es: ¡Hola! ¿Cómo puedo ayudarte hoy? ¡Cuéntame qué comiste!
fr: Salut! Comment puis-je vous aider aujourd'hui ? Dis-moi ce que tu as mangé !
hi: नमस्ते! आज मैं आपकी मदद करने में कैसे सक्षम हूं? मुझे बताओ तुमने क्या खाया!
id: Hai! Apa yang bisa saya bantu hari ini? Katakan padaku apa yang kamu makan!
pt: Oi! Como posso ajudá-lo hoje? Me conta o que você comeu!
th: สวัสดีค่ะ วันนี้ช่วยอะไรได้บ้าง? ทานอะไรเล่าให้ฉันฟังนะ!
vi: CHÀO! Hôm nay tôi có thể giúp gì cho bạn? Hãy cho tôi biết bạn đã ăn gì!

# searchModeLabel
source: Search Mode
es: Modo de búsqueda
id: Mode Pencarian
pt: Modo de pesquisa
th: โหมดค้นหา
vi: Chế độ tìm kiếm

# normalFood
source: Food
es: Comida
id: Makanan
pt: Comida
th: อาหาร
vi: Thực phẩm

# normalFoodDesc
source: Regular home-cooked food
es: Comida casera regular
id: Makanan rumahan biasa
pt: Comida caseira regular
th: อาหารทั่วไปทำกินเอง
vi: Thức ăn nấu tại nhà thông thường

# packagedProduct
source: Product
es: Producto
id: Produk
pt: Produto
th: สินค้า
vi: Sản phẩm

# packagedProductDesc
source: Packaged with nutrition label
es: Empaquetado con etiqueta nutricional
id: Kemasan dengan label nutrisi
pt: Embalado com etiqueta nutricional
th: สินค้าที่มีฉลากโภชนาการ
vi: Đóng gói với nhãn dinh dưỡng

# foodNameQuantityAndModeImprovesAccuracy
source: Providing food name, quantity, and choosing if it's food or product will improve AI accuracy.
es: Proporcionar el nombre del alimento, la cantidad y elegir si es comida o producto mejorará la precisión de la IA.
id: Memberikan nama makanan, jumlah, dan memilih apakah itu makanan atau produk akan meningkatkan akurasi AI.
pt: Fornecer o nome do alimento, a quantidade e escolher se é comida ou produto melhorará a precisão da IA.
th: ระบุชื่ออาหาร ปริมาณ และเลือกว่าเป็นอาหารหรือสินค้าจะช่วยให้ AI วิเคราะห์แม่นยำขึ้น
vi: Cung cấp tên thực phẩm, số lượng và chọn đó là thực phẩm hay sản phẩm sẽ cải thiện độ chính xác của AI.

# chatContentTooLongError
source: List is too long. Could you split it into 2-3 items? 🙏 Your Energy has not been deducted.
th: รายการยาวเกินไป ช่วยแบ่งส่งทีละ 2-3 รายการได้ไหมครับ 🙏 Energy ไม่ถูกหักนะครับ

# ingredientsTapToExpand
source: Tap to view and edit
th: แตะเพื่อดูและแก้ไข

# analyzeFoodImageTitle
source: Analyze Food Image
th: วิเคราะห์รูปอาหาร

# foodNameImprovesAccuracy
source: Providing food name & quantity improves AI accuracy.
th: ระบุชื่ออาหารและปริมาณช่วยให้ AI วิเคราะห์แม่นยำขึ้น

source: Hide details
th: ซ่อนรายละเอียด

source: Show details
th: แสดงรายละเอียด

# saveAndAnalyzeButton
source: Save & Analyze
th: บันทึก & วิเคราะห์

source: Save without analysis
th: บันทึกโดยไม่วิเคราะห์

# nutritionSection
source: Nutrition
th: โภชนาการ

# nutritionSectionHint
source: Enter 0 if unknown
th: ใส่ 0 หากไม่ทราบ

# quickEditFoodName
source: Edit name
th: แก้ไขชื่อ

# quickEditCancel
source: Cancel
th: ยกเลิก

# quickEditSave
source: Save
th: บันทึก

# mealSuggestionsToggle
source: Meal Suggestions
th: คำแนะนำมื้ออาหาร

# mealSuggestionsOn
source: On
th: เปิด

# mealSuggestionsOff
source: Off
th: ปิด
