Repository: lnxelnope/miro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, pt, th, vi

# thinkingMealIdeas
source: 🤖 Thinking of great meal ideas for you...
de: 🤖 Überlegen Sie sich tolle Essensideen für Sie ...
es: 🤖 Pensando en grandes ideas de comidas para ti...
fr: 🤖 Je pense à de bonnes idées de repas pour vous...
hi: 🤖आपके लिए बढ़िया भोजन के विचारों के बारे में सोच रहा हूँ...
id: 🤖 Memikirkan ide makanan enak untuk Anda...
pt: 🤖 Pensando em ótimas ideias de refeições para você...
th: 🤖 กำลังคิดเมนูอาหารดีๆ ให้คุณ...
vi: 🤖 Đang nghĩ ra ý tưởng cho bữa ăn tuyệt vời dành cho bạn...

source: Recent meals:
de: Letzte Mahlzeiten:
es: Comidas recientes:
fr: Repas récents :
hi: हाल का भोजन:
id: Makanan terkini:
pt: Refeições recentes:
th: มื้ออาหารล่าสุด:
vi: Bữa ăn gần đây:

# noRecentFood
source: No recent food logged.
de: Keine aktuellen Lebensmittel protokolliert.
es: No se ha registrado ningún alimento reciente.
fr: Aucun aliment récent enregistré.
hi: हाल ही में कोई भोजन लॉग नहीं किया गया।
id: Tidak ada makanan terbaru yang dicatat.
pt: Nenhum alimento recente registrado.
th: ไม่มีอาหารล่าสุดที่บันทึก
vi: Không có thực phẩm gần đây được ghi lại.

# remainingCaloriesToday
source: . Remaining calories today: {remaining} kcal.
de: . Verbleibende Kalorien heute: {remaining} kcal.
es: . Calorías restantes hoy: {remaining} kcal.
fr: . Calories restantes aujourd'hui : {remaining} kcal.
hi: . आज शेष कैलोरी: {remaining} kcal।
id: . Sisa kalori hari ini: {remaining} kcal.
pt: . Calorias restantes hoje: {remaining} kcal.
th: แคลอรี่ที่เหลือวันนี้: {remaining} kcal
vi: . Lượng calo còn lại hôm nay: {remaining} kcal.

# failedToGetMenuSuggestions
source: ❌ Failed to get menu suggestions: {error}
de: ❌ Menüvorschläge konnten nicht abgerufen werden: {error}
es: ❌ No se pudieron obtener sugerencias de menú: {error}
fr: ❌ Échec de l'obtention des suggestions de menu : {error}
hi: ❌ मेनू सुझाव प्राप्त करने में विफल: {error}
id: ❌ Gagal mendapatkan saran menu: {error}
pt: ❌ Falha ao obter sugestões de menu: {error}
th: ❌ ไม่สามารถรับคำแนะนำเมนูได้: {error}
vi: ❌ Không nhận được gợi ý menu: {error}

# mealSuggestionsTitle
source: 🤖 Based on your food log, here are 3 meal suggestions:
de: 🤖 Basierend auf Ihrem Ernährungsprotokoll finden Sie hier 3 Essensvorschläge:
es: 🤖 Según tu registro de alimentos, aquí tienes 3 sugerencias de comidas:
fr: 🤖 En fonction de votre journal alimentaire, voici 3 suggestions de repas :
hi: 🤖 आपके भोजन लॉग के आधार पर, यहां 3 भोजन सुझाव दिए गए हैं:
id: 🤖 Berdasarkan catatan makanan Anda, berikut 3 saran makan:
pt: 🤖 Com base no seu registo alimentar, aqui ficam 3 sugestões de refeições:
th: 🤖 จากบันทึกอาหารของคุณ นี่คือคำแนะนำเมนู 3 รายการ:
vi: 🤖 Dựa trên nhật ký ăn uống của bạn, đây là 3 gợi ý về bữa ăn:

# mealSuggestionMacros
source: P: {protein}g | C: {carbs}g | F: {fat}g
hi: पी: {protein}g | सी: {carbs}g | एफ: {fat}g

# pickOneAndLog
source: Pick one and I'll log it for you! 😊
de: Wählen Sie eines aus und ich protokolliere es für Sie! 😊
es: ¡Elige uno y lo registraré por ti! 😊
fr: Choisissez-en un et je l'enregistrerai pour vous ! 😊
hi: एक चुनें और मैं इसे आपके लिए लॉग कर दूंगा! 😊
id: Pilih satu dan saya akan mencatatnya untuk Anda! 😊
pt: Escolha um e eu registrarei para você! 😊
th: เลือกหนึ่งรายการแล้วผมจะบันทึกให้คุณ! 😊
vi: Hãy chọn một cái và tôi sẽ ghi nó cho bạn! 😊

# energyCost
source: ⚡ -{cost} Energy
de: ⚡ -{cost} Energie
es: ⚡ -{cost} Energía
fr: ⚡ -{cost} Énergie
hi: ⚡ -{cost} ऊर्जा
id: ⚡ -{cost} Energi
pt: ⚡ -{cost} Energia
vi: ⚡ -{cost} Năng lượng

source: Give me tips for healthy eating
de: Gib mir Tipps für eine gesunde Ernährung
es: Dame consejos para una alimentación saludable.
fr: Donnez-moi des conseils pour manger sainement
hi: मुझे स्वस्थ भोजन के लिए सुझाव दें
id: Beri saya tip untuk makan sehat
pt: Dê-me dicas para uma alimentação saudável
th: ให้คำแนะนำการกินเพื่อสุขภาพ
vi: Hãy cho tôi lời khuyên để ăn uống lành mạnh

source: How many calories today?
de: Wie viele Kalorien heute?
es: ¿Cuántas calorías hoy?
fr: Combien de calories aujourd'hui ?
hi: आज कितनी कैलोरी?
id: Berapa banyak kalori hari ini?
pt: Quantas calorias hoje?
th: วันนี้กินกี่แคลอรี่?
vi: Hôm nay có bao nhiêu calo?

# menuLabel
source: Menu
de: Speisekarte
es: Menú
hi: मेनू
th: เมนู
vi: Thực đơn

# weeklyLabel
source: Weekly
de: Wöchentlich
es: Semanalmente
fr: Hebdomadaire
hi: साप्ताहिक
id: Mingguan
pt: Semanalmente
th: รายสัปดาห์
vi: hàng tuần

# monthlyLabel
source: Monthly
de: Monatlich
es: Mensual
fr: Mensuel
hi: महीने के
id: Bulanan
pt: Mensal
th: รายเดือน
vi: hàng tháng

# tipsLabel
source: Tips
de: Tipps
es: Consejos
fr: Conseils
hi: सुझावों
id: Kiat
pt: Pontas
th: เคล็ดลับ
vi: Mẹo

# summaryLabel
source: Summary
de: Zusammenfassung
es: Resumen
fr: Résumé
hi: सारांश
id: Ringkasan
pt: Resumo
th: สรุป
vi: Bản tóm tắt

# helpLabel
source: Help
de: Helfen
es: Ayuda
fr: Aide
hi: मदद
id: Membantu
pt: Ajuda
th: ช่วยเหลือ
vi: Giúp đỡ

# onboardingWelcomeSubtitle
source: Track calories effortlessly with AI-powered analysis
de: Verfolgen Sie mühelos Kalorien mit KI-gestützter Analyse
es: Realice un seguimiento de las calorías sin esfuerzo con análisis impulsado por IA
fr: Suivez les calories sans effort avec une analyse basée sur l'IA
hi: कैलोरी को सहजता से ट्रैक करें एआई-संचालित विश्लेषण के साथ
id: Lacak kalori dengan mudah dengan analisis bertenaga AI
pt: Monitore calorias sem esforço com análise alimentada por IA
th: ติดตามแคลอรี่ได้ง่ายๆ ด้วยการวิเคราะห์ด้วย AI
vi: Theo dõi lượng calo dễ dàng với phân tích được hỗ trợ bởi AI

# onboardingSnap
source: Snap
de: Schnapp
es: Quebrar
fr: Instantané
hi: स्नैप
id: Patah
pt: Foto
th: ถ่ายรูป
vi: Chụp nhanh

# onboardingSnapDesc
source: AI analyzes instantly
de: KI analysiert sofort
es: La IA analiza al instante
fr: L'IA analyse instantanément
hi: एआई तुरंत विश्लेषण करता है
id: Analisis AI secara instan
pt: A IA analisa instantaneamente
th: AI วิเคราะห์ทันที
vi: AI phân tích ngay lập tức

# onboardingType
source: Type
de: Typ
es: Tipo
fr: Taper
hi: प्रकार
id: Jenis
pt: Tipo
th: พิมพ์
vi: Kiểu

# onboardingTypeDesc
source: Log in seconds
de: Melden Sie sich in Sekunden an
es: Iniciar sesión en segundos
fr: Connectez-vous en quelques secondes
hi: सेकंड में लॉग इन करें
id: Masuk dalam hitungan detik
pt: Faça login em segundos
th: บันทึกในไม่กี่วินาที
vi: Đăng nhập vài giây

# onboardingEdit
source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
hi: संपादन करना
id: Sunting
pt: Editar
th: แก้ไข
vi: Biên tập

# onboardingEditDesc
source: Fine-tune accuracy
de: Feinabstimmung der Genauigkeit
es: Precisión de ajuste fino
fr: Affiner la précision
hi: फाइन-ट्यून सटीकता
id: Sempurnakan akurasi
pt: Precisão de ajuste fino
th: ปรับแต่งความแม่นยำ
vi: Tinh chỉnh độ chính xác

# onboardingNext
source: Next →
de: Weiter →
es: Siguiente →
fr: Suivant →
hi: अगला →
id: Selanjutnya →
pt: Próximo →
th: ถัดไป →
vi: Tiếp theo →

# onboardingDisclaimer
source: AI-estimated data. Not medical advice.
de: KI-geschätzte Daten. Kein medizinischer Rat.
es: Datos estimados por IA. No consejo médico.
fr: Données estimées par l’IA. Pas un avis médical.
hi: एआई-अनुमानित डेटा। चिकित्सीय सलाह नहीं.
id: Data perkiraan AI. Bukan nasihat medis.
pt: Dados estimados por IA. Não é conselho médico.
th: ข้อมูลที่ AI ประมาณการ ไม่ใช่คำแนะนำทางการแพทย์
vi: Dữ liệu ước tính của AI. Không phải lời khuyên y tế.

# onboardingQuickSetup
source: Quick Setup
de: Schnelle Einrichtung
es: Configuración rápida
fr: Configuration rapide
hi: शीघ्र व्यवस्थित
id: Pengaturan Cepat
pt: Configuração rápida
th: ตั้งค่าเร็ว
vi: Thiết lập nhanh

# onboardingHelpAiUnderstand
source: Help AI understand your food better
de: Helfen Sie der KI, Ihr Essen besser zu verstehen
es: Ayude a la IA a comprender mejor su comida
fr: Aidez l’IA à mieux comprendre votre alimentation
hi: एआई को आपके भोजन को बेहतर ढंग से समझने में सहायता करें
id: Bantu AI memahami makanan Anda dengan lebih baik
pt: Ajude a IA a entender melhor sua comida
th: ช่วยให้ AI เข้าใจอาหารของคุณดีขึ้น
vi: Giúp AI hiểu rõ hơn về thực phẩm của bạn

# onboardingYourTypicalCuisine
source: Your typical cuisine:
de: Ihre typische Küche:
es: Su cocina típica:
fr: Votre cuisine typique :
hi: आपका विशिष्ट व्यंजन:
id: Masakan khas Anda:
pt: Sua culinária típica:
th: อาหารที่คุณกินบ่อย:
vi: Món ăn đặc trưng của bạn:

# onboardingDailyCalorieGoal
source: Daily calorie goal (optional):
de: Tägliches Kalorienziel (optional):
es: Meta diaria de calorías (opcional):
fr: Objectif calorique quotidien (facultatif) :
hi: दैनिक कैलोरी लक्ष्य (वैकल्पिक):
id: Sasaran kalori harian (opsional):
pt: Meta diária de calorias (opcional):
th: เป้าหมายแคลอรี่รายวัน (ไม่บังคับ):
vi: Mục tiêu calo hàng ngày (tùy chọn):

# onboardingKcalPerDay
source: kcal/day
de: kcal/Tag
es: kcal/día
fr: kcal/jour
hi: kcal/दिन
id: kcal/hari
pt: kcal/dia
th: kcal/วัน
vi: kcal/ngày

# onboardingCanChangeAnytime
source: You can change this anytime in Profile settings
de: Sie können dies jederzeit in den ProDateieinstellungen ändern
es: Puedes cambiar esto en cualquier momento en la configuración del archivo Pro
fr: Vous pouvez modifier cela à tout moment dans les paramètres du fichier Pro
hi: आप इसे Proफ़ाइल सेटिंग में कभी भी बदल सकते हैं
id: Anda dapat mengubahnya kapan saja di pengaturan Profile
pt: Você pode alterar isso a qualquer momento nas configurações do Profile
th: คุณสามารถเปลี่ยนได้ทุกเมื่อในการตั้งค่าโปรไฟล์
vi: Bạn có thể thay đổi điều này bất kỳ lúc nào trong phần cài đặt tệp Pro

# onboardingYoureAllSet
source: You're All Set!
de: Sie sind bereit!
es: ¡Ya estás listo!
fr: Vous êtes prêt !
hi: तुम सब सेट हो!
id: Anda sudah siap!
pt: Está tudo pronto!
th: พร้อมแล้ว!
vi: Bạn đã hoàn tất!

# onboardingStartTracking
source: Start tracking your meals today. Snap a photo or type what you ate.
de: Beginnen Sie noch heute damit, Ihre Mahlzeiten zu verfolgen. Machen Sie ein Foto oder geben Sie ein, was Sie gegessen haben.
es: Comience a realizar un seguimiento de sus comidas hoy. Toma una foto o escribe lo que comiste.
fr: Commencez à suivre vos repas dès aujourd'hui. Prenez une photo ou tapez ce que vous avez mangé.
hi: आज ही अपने भोजन पर नज़र रखना शुरू करें। एक फोटो खींचें या लिखें कि आपने क्या खाया।
id: Mulailah melacak makanan Anda hari ini. Ambil foto atau ketik apa yang Anda makan.
pt: Comece a monitorar suas refeições hoje. Tire uma foto ou digite o que você comeu.
th: เริ่มติดตามมื้ออาหารของคุณวันนี้ ถ่ายรูปหรือพิมพ์สิ่งที่คุณกิน
vi: Bắt đầu theo dõi bữa ăn của bạn ngay hôm nay. Chụp ảnh hoặc nhập những gì bạn đã ăn.

# onboardingWelcomeGift
source: Welcome Gift
de: Willkommensgeschenk
es: Regalo de bienvenida
fr: Cadeau de bienvenue
hi: स्वागत उपहार
id: Hadiah Selamat Datang
pt: Presente de boas-vindas
th: ของขวัญต้อนรับ
vi: Quà chào mừng

# onboardingFreeEnergy
source: 10 FREE Energy
de: 10 KOSTENLOSE Energie
es: 10 Energía GRATIS
fr: 10 Énergie GRATUITE
hi: 10 मुफ़्त ऊर्जा
id: 10 Energi GRATIS
pt: 10 Energia GRATUITA
th: พลังงานฟรี 10 หน่วย
vi: 10 năng lượng MIỄN PHÍ

# onboardingFreeEnergyDesc
source: = 10 AI analyses to get started
de: = 10 KI-Analysen zum Einstieg
es: = 10 análisis de IA para comenzar
fr: = 10 analyses IA pour commencer
hi: = आरंभ करने के लिए 10 एआई विश्लेषण
id: = 10 analisis AI untuk memulai
pt: = 10 análises de IA para começar
th: = การวิเคราะห์ AI 10 ครั้งเพื่อเริ่มต้น
vi: = 10 phân tích AI để bắt đầu

# onboardingEnergyCost
source: Each analysis costs 1 Energy The more you use, the more you earn!
de: Jede Analyse kostet 1 Energie Je mehr Sie verwenden, desto mehr verdienen Sie!
es: Cada análisis cuesta 1 Energía ¡Cuanto más uses, más ganarás!
fr: Chaque analyse coûte 1 Énergie Plus vous en utilisez, plus vous gagnez !
hi: प्रत्येक विश्लेषण में 1 ऊर्जा खर्च होती है जितना अधिक आप उपयोग करेंगे, उतना अधिक कमायेंगे!
id: Setiap analisis membutuhkan 1 Energi Semakin banyak Anda menggunakan, semakin banyak penghasilan Anda!
pt: Cada análise custa 1 Energia Quanto mais você usa, mais você ganha!
th: การวิเคราะห์แต่ละครั้งใช้พลังงาน 1 หน่วย ยิ่งใช้มากยิ่งได้มาก!
vi: Mỗi lần phân tích tốn 1 Năng lượng Bạn càng sử dụng nhiều, bạn càng kiếm được nhiều tiền!

# onboardingStartTrackingButton
source: Start Tracking! →
de: Beginnen Sie mit der Verfolgung! →
es: ¡Comience a rastrear! →
fr: Commencez le suivi ! →
hi: ट्रैकिंग शुरू करें! →
id: Mulai Pelacakan! →
pt: Comece a rastrear! →
th: เริ่มติดตาม! →
vi: Bắt đầu theo dõi! →

# onboardingNoCreditCard
source: No credit card • No hidden fees
de: Keine Kreditkarte • Keine versteckten Gebühren
es: Sin tarjeta de crédito • Sin cargos ocultos
fr: Pas de carte de crédit • Pas de frais cachés
hi: कोई क्रेडिट कार्ड नहीं • कोई छिपी हुई फीस नहीं
id: Tanpa kartu kredit • Tanpa biaya tersembunyi
pt: Sem cartão de crédito • Sem taxas ocultas
th: ไม่ต้องใช้บัตรเครดิต • ไม่มีค่าธรรมเนียมแอบแฝง
vi: Không có thẻ tín dụng • Không có phí ẩn

# cameraTakePhotoOfFood
source: Take a photo of your food
de: Machen Sie ein Foto von Ihrem Essen
es: Toma una foto de tu comida.
fr: Prenez une photo de votre nourriture
hi: अपने भोजन का फ़ोटो लें
id: Ambil foto makanan Anda
pt: Tire uma foto da sua comida
th: ถ่ายรูปอาหารของคุณ
vi: Chụp ảnh món ăn của bạn

# cameraFailedToInitialize
source: Failed to initialize camera
de: Kamera konnte nicht initialisiert werden
es: No se pudo inicializar la cámara
fr: Échec de l'initialisation de la caméra
hi: कैमरा प्रारंभ करने में विफल
id: Gagal menginisialisasi kamera
pt: Falha ao inicializar a câmera
th: ไม่สามารถเริ่มต้นกล้องได้
vi: Không khởi tạo được máy ảnh

# cameraFailedToCapture
source: Failed to capture photo
de: Foto konnte nicht aufgenommen werden
es: No se pudo capturar la foto
fr: Échec de la capture de la photo
hi: फ़ोटो कैप्चर करने में विफल
id: Gagal mengambil foto
pt: Falha ao capturar foto
th: ถ่ายรูปไม่สำเร็จ
vi: Không chụp được ảnh

# cameraFailedToPickFromGallery
source: Failed to pick image from gallery
de: Bild konnte nicht aus der Galerie ausgewählt werden
es: No se pudo seleccionar la imagen de la galería
fr: Échec de la sélection de l'image dans la galerie
hi: गैलरी से छवि चुनने में विफल
id: Gagal mengambil gambar dari galeri
pt: Falha ao escolher a imagem da galeria
th: ไม่สามารถเลือกรูปจากแกลเลอรีได้
vi: Không thể chọn hình ảnh từ thư viện

# cameraProcessing
source: Processing...
de: ProVerarbeitung...
es: Procesando...
fr: Processation...
hi: Proउपवास...
id: Prosedang...
pt: Proprocessando...
th: กำลังประมวลผล...
vi: Prođừng...

# referralInviteFriends
source: Invite Friends
de: Freunde einladen
es: invitar amigos
fr: Inviter des amis
hi: मित्रों को आमंत्रित करें
id: Undang Teman
pt: Convide amigos
th: เชิญเพื่อน
vi: Mời bạn bè

# referralYourReferralCode
source: Your Referral Code
de: Ihr Empfehlungscode
es: Su código de referencia
fr: Votre code de parrainage
hi: आपका रेफरल कोड
id: Kode Referensi Anda
pt: Seu código de referência
th: รหัสแนะนำของคุณ
vi: Mã giới thiệu của bạn

# referralLoading
source: Loading...
de: Laden...
es: Cargando...
fr: Chargement...
hi: लोड हो रहा है...
id: Memuat...
pt: Carregando...
th: กำลังโหลด...
vi: Đang tải...

# referralCopy
source: Copy
de: Kopie
es: Copiar
fr: Copie
hi: प्रतिलिपि
id: Menyalin
pt: Cópia
th: คัดลอก
vi: Sao chép

# referralShareCodeDescription
source: Share this code with friends! When they use AI 3 times, you both get rewards!
de: Teilen Sie diesen Code mit Freunden! Wenn sie dreimal KI einsetzen, erhalten Sie beide Belohnungen!
es: ¡Comparte este código con amigos! Cuando usan la IA 3 veces, ¡ambos obtienen recompensas!
fr: Partagez ce code avec vos amis ! Lorsqu’ils utilisent l’IA 3 fois, vous obtenez tous les deux des récompenses !
hi: इस कोड को दोस्तों के साथ साझा करें! जब वे 3 बार AI का उपयोग करते हैं, तो आप दोनों को पुरस्कार मिलता है!
id: Bagikan kode ini kepada teman-teman! Saat mereka menggunakan AI 3 kali, Anda berdua mendapat hadiah!
pt: Compartilhe este código com amigos! Quando eles usam IA 3 vezes, vocês dois recebem recompensas!
th: แชร์รหัสนี้กับเพื่อน! เมื่อเพื่อนใช้ AI 3 ครั้ง คุณทั้งคู่จะได้รับรางวัล!
vi: Chia sẻ mã này với bạn bè! Khi họ sử dụng AI 3 lần, cả hai bạn đều nhận được phần thưởng!

# referralEnterReferralCode
source: Enter Referral Code
de: Geben Sie den Empfehlungscode ein
es: Ingrese el código de referencia
fr: Entrez le code de référence
hi: रेफरल कोड दर्ज करें
id: Masukkan Kode Referensi
pt: Insira o código de referência
th: ใส่รหัสแนะนำ
vi: Nhập mã giới thiệu

# referralCodeHint
source: MIRO-XXXX-XXXX-XXXX
hi: मिरो-XXXX-XXXX-XXXX

# referralSubmitCode
source: Submit Code
de: Code senden
es: Enviar código
fr: Soumettre le code
hi: कोड सबमिट करें
id: Kirim Kode
pt: Enviar código
th: ส่งรหัส
vi: Gửi mã

# referralPleaseEnterCode
source: Please enter a referral code
de: Bitte geben Sie einen Empfehlungscode ein
es: Por favor ingrese un código de referencia
fr: Veuillez entrer un code de parrainage
hi: कृपया एक रेफरल कोड दर्ज करें
id: Silakan masukkan kode referral
pt: Por favor insira um código de referência
th: กรุณาใส่รหัสแนะนำ
vi: Vui lòng nhập mã giới thiệu

source: Referral code accepted!
de: Empfehlungscode akzeptiert!
es: ¡Código de referencia aceptado!
fr: Code de parrainage accepté !
hi: रेफरल कोड स्वीकार किया गया!
id: Kode referensi diterima!
pt: Código de referência aceito!
th: ยอมรับรหัสแนะนำแล้ว!
vi: Mã giới thiệu được chấp nhận!

# referralCodeCopied
source: Referral code copied to clipboard!
de: Empfehlungscode in die Zwischenablage kopiert!
es: ¡Código de referencia copiado al portapapeles!
fr: Code de parrainage copié dans le presse-papier !
hi: रेफरल कोड क्लिपबोर्ड पर कॉपी किया गया!
id: Kode referensi disalin ke clipboard!
pt: Código de referência copiado para a área de transferência!
th: คัดลอกรหัสแนะนำไปยังคลิปบอร์ดแล้ว!
vi: Mã giới thiệu được sao chép vào clipboard!

# referralEnergyBonus
source: +{energy} Energy!
de: +{energy} Energie!
es: +{energy} ¡Energía!
fr: +{energy} Énergie !
hi: +{energy} ऊर्जा!
id: +{energy} Energi!
pt: +{energy} Energia!
th: +{energy} พลังงาน!
vi: +{energy} Năng lượng!

# referralHowItWorks
source: How It Works
de: Wie es funktioniert
es: Cómo funciona
fr: Comment ça marche
hi: यह काम किस प्रकार करता है
id: Cara Kerjanya
pt: Como funciona
th: วิธีใช้งาน
vi: Nó hoạt động như thế nào

# referralStep1Title
source: Share your referral code
de: Teilen Sie Ihren Empfehlungscode
es: Comparte tu código de referencia
fr: Partagez votre code de parrainage
hi: अपना रेफरल कोड साझा करें
id: Bagikan kode referensi Anda
pt: Compartilhe seu código de referência
th: แชร์รหัสแนะนำของคุณ
vi: Chia sẻ mã giới thiệu của bạn

# referralStep1Description
source: Copy and share your MiRO ID with friends
de: Kopieren Sie Ihre MiRO-ID und teilen Sie sie mit Freunden
es: Copie y comparta su ID MiRO con amigos
fr: Copiez et partagez votre identifiant MiRO avec vos amis
hi: अपनी MiRO आईडी कॉपी करें और दोस्तों के साथ साझा करें
id: Salin dan bagikan ID MiRO Anda dengan teman
pt: Copie e compartilhe seu ID MiRO com amigos
th: คัดลอกและแชร์ MiRO ID ของคุณกับเพื่อน
vi: Sao chép và chia sẻ ID MiRO của bạn với bạn bè

# referralStep2Title
source: Friend enters your code
de: Freund gibt Ihren Code ein
es: Amigo ingresa tu código
fr: Un ami entre votre code
hi: मित्र आपका कोड दर्ज करता है
id: Teman memasukkan kode Anda
pt: Amigo digite seu código
th: เพื่อนใส่รหัสของคุณ
vi: Bạn bè nhập mã của bạn

# referralStep2Description
source: They get +20 Energy immediately
de: Sie erhalten sofort +20 Energie
es: Obtienen +20 de energía inmediatamente.
fr: Ils obtiennent immédiatement +20 d'énergie
hi: उन्हें तुरंत +20 ऊर्जा मिलती है
id: Mereka segera mendapatkan +20 Energi
pt: Eles recebem +20 de energia imediatamente
th: เพื่อนจะได้รับ +20 พลังงานทันที
vi: Họ nhận được +20 Năng lượng ngay lập tức

# referralStep3Title
source: Friend uses AI 3 times
de: Freund nutzt dreimal KI
es: Amigo usa IA 3 veces
fr: Un ami utilise l'IA 3 fois
hi: मित्र एआई का 3 बार उपयोग करता है
id: Teman menggunakan AI sebanyak 3 kali
pt: Amigo usa IA 3 vezes
th: เพื่อนใช้ AI 3 ครั้ง
vi: Người bạn sử dụng AI 3 lần

# referralStep3Description
source: When they complete 3 AI analyses
de: Wenn sie 3 KI-Analysen abgeschlossen haben
es: Cuando completen 3 análisis de IA
fr: Lorsqu'ils terminent 3 analyses d'IA
hi: जब वे 3 AI विश्लेषण पूरा कर लेते हैं
id: Saat mereka menyelesaikan 3 analisis AI
pt: Quando eles concluírem 3 análises de IA
th: เมื่อเพื่อนทำการวิเคราะห์ AI ครบ 3 ครั้ง
vi: Khi họ hoàn thành 3 phân tích AI

# referralStep4Title
source: You get rewarded!
de: Du wirst belohnt!
es: ¡Serás recompensado!
fr: Vous êtes récompensé !
hi: तुम्हें पुरस्कार मिलता है!
id: Anda mendapat imbalan!
pt: Você é recompensado!
th: คุณได้รับรางวัล!
vi: Bạn nhận được phần thưởng!

# referralStep4Description
source: You receive +5 Energy!
de: Du erhältst +5 Energie!
es: ¡Recibes +5 de energía!
fr: Vous recevez +5 Énergie !
hi: आपको +5 ऊर्जा प्राप्त होती है!
id: Anda menerima +5 Energi!
pt: Você recebe +5 de energia!
th: คุณจะได้รับ +5 พลังงาน!
vi: Bạn nhận được +5 Năng lượng!

# tierBenefitsTitle
source: Tier Benefits
de: Stufenvorteile
es: Beneficios de nivel
fr: Avantages du niveau
hi: स्तरीय लाभ
id: Manfaat Tingkat
pt: Benefícios de nível
th: สิทธิประโยชน์ของ Tier
vi: Lợi ích theo cấp độ

# tierBenefitsUnlockRewards
source: Unlock Rewards with Daily Streaks
de: Schalte Belohnungen frei mit Daily Streaks
es: Desbloquear recompensas con rachas diarias
fr: Débloquez des récompenses avec des séquences quotidiennes
hi: पुरस्कार अनलॉक करें डेली स्ट्रीक्स के साथ
id: Buka Hadiah dengan Coretan Harian
pt: Desbloquear recompensas com sequências diárias
th: ปลดล็อกรางวัล ด้วย Daily Streaks
vi: Mở khóa phần thưởng với chuỗi hàng ngày

# tierBenefitsKeepStreakDescription
source: Keep your streak alive to unlock higher tiers and earn amazing benefits!
de: Halte deinen Streak am Leben, um höhere Ränge freizuschalten und tolle Vorteile zu erhalten!
es: ¡Mantén viva tu racha para desbloquear niveles más altos y obtener increíbles beneficios!
fr: Maintenez votre séquence en vie pour débloquer des niveaux supérieurs et gagner des avantages incroyables !
hi: उच्च स्तरों को अनलॉक करने और आश्चर्यजनक लाभ अर्जित करने के लिए अपनी स्ट्रीक को जीवित रखें!
id: Pertahankan rekor Anda untuk membuka tingkatan yang lebih tinggi dan dapatkan manfaat luar biasa!
pt: Mantenha sua sequência viva para desbloquear níveis mais altos e ganhar benefícios incríveis!
th: รักษา streak ให้ต่อเนื่องเพื่อปลดล็อค tier ที่สูงขึ้นและรับสิทธิประโยชน์สุดพิเศษ!
vi: Hãy duy trì chuỗi của bạn để mở khóa các cấp cao hơn và kiếm được những lợi ích đáng kinh ngạc!

# tierBenefitsHowItWorks
source: How It Works
de: Wie es funktioniert
es: Cómo funciona
fr: Comment ça marche
hi: यह काम किस प्रकार करता है
id: Cara Kerjanya
pt: Como funciona
th: วิธีใช้งาน
vi: Nó hoạt động như thế nào

# tierBenefitsDailyEnergyReward
source: Daily Energy Reward
de: Tägliche Energiebelohnung
es: Recompensa de energía diaria
fr: Récompense énergétique quotidienne
hi: दैनिक ऊर्जा पुरस्कार
id: Hadiah Energi Harian
pt: Recompensa diária de energia
th: รางวัลพลังงานรายวัน
vi: Phần thưởng năng lượng hàng ngày
