Repository: lnxelnope/miro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, pt, th, vi

# tierBenefitsDailyEnergyDescription
source: Use AI at least once per day to earn bonus energy. Higher tiers = more daily energy!
de: Benutze KI mindestens einmal am Tag, um Bonusenergie zu verdienen. Höhere Stufen = mehr tägliche Energie!
es: Utilice la IA al menos una vez al día para ganar energía adicional. Niveles más altos = ¡más energía diaria!
fr: Utilisez l'IA au moins une fois par jour pour gagner de l'énergie bonus. Niveaux supérieurs = plus d'énergie quotidienne !
hi: बोनस ऊर्जा अर्जित करने के लिए प्रतिदिन कम से कम एक बार AI का उपयोग करें। ऊंचे स्तर = अधिक दैनिक ऊर्जा!
id: Gunakan AI setidaknya sekali sehari untuk mendapatkan energi bonus. Tingkat yang lebih tinggi = lebih banyak energi harian!
pt: Use IA pelo menos uma vez por dia para ganhar energia bônus. Níveis mais altos = mais energia diária!
th: ใช้ AI อย่างน้อย 1 ครั้งต่อวันเพื่อรับพลังงานโบนัส Tier สูงขึ้น = พลังงานรายวันมากขึ้น!
vi: Sử dụng AI ít nhất một lần mỗi ngày để kiếm thêm năng lượng. Bậc cao hơn = nhiều năng lượng hàng ngày hơn!

# tierBenefitsPurchaseBonus
source: Purchase Bonus
de: Kaufbonus
es: Bono de compra
fr: Bonus d'achat
hi: बोनस खरीदें
id: Bonus Pembelian
pt: Bônus de compra
th: โบนัสการซื้อ
vi: Tiền thưởng mua hàng

# tierBenefitsPurchaseBonusDescription
source: Gold & Diamond tiers get extra energy on every purchase (10-20% more!)
de: Gold- und Diamantstufen erhalten bei jedem Einkauf zusätzliche Energie (10–20 % mehr!)
es: Los niveles Oro y Diamante obtienen energía adicional en cada compra (¡entre un 10% y un 20% más!)
fr: Les niveaux Or et Diamant reçoivent de l'énergie supplémentaire sur chaque achat (10 à 20 % de plus !)
hi: सोने और हीरे के स्तरों को प्रत्येक खरीदारी पर अतिरिक्त ऊर्जा मिलती है (10-20% अधिक!)
id: Tingkatan Emas & Berlian mendapatkan energi ekstra pada setiap pembelian (10-20% lebih banyak!)
pt: Os níveis Gold e Diamond recebem energia extra em cada compra (10-20% a mais!)
th: Tier Gold และ Diamond ได้รับพลังงานเพิ่มในทุกการซื้อ (เพิ่ม 10-20%!)
vi: Cấp Vàng & Kim cương nhận thêm năng lượng cho mỗi lần mua hàng (thêm 10-20%!)

# tierBenefitsGracePeriod
source: Grace Period
de: Gnadenfrist
es: Período de gracia
fr: Délai de grâce
hi: मुहलत
id: Masa Tenggang
pt: Período de carência
th: ช่วงเวลาพิเศษ
vi: Thời gian ân hạn

# tierBenefitsGracePeriodDescription
source: Miss a day without losing your streak. Silver+ tiers get protection!
de: Verpassen Sie einen Tag, ohne Ihren Streak zu verlieren. Silber+-Stufen erhalten Schutz!
es: Pierde un día sin perder tu racha. ¡Los niveles Silver+ obtienen protección!
fr: Manquez une journée sans perdre votre séquence. Les niveaux Argent+ bénéficient d’une protection !
hi: अपनी लय खोए बिना एक भी दिन गँवाएँ। सिल्वर+ स्तरों को सुरक्षा मिलती है!
id: Lewatkan satu hari tanpa kehilangan pukulan Anda. Tingkatan Silver+ mendapat perlindungan!
pt: Perca um dia sem perder a sequência. Os níveis Silver+ recebem proteção!
th: พลาดวันโดยไม่เสีย streak Tier Silver+ ได้รับการปกป้อง!
vi: Bỏ lỡ một ngày mà không mất đi kỷ lục của mình. Hạng Bạc+ được bảo vệ!

# tierBenefitsAllTiers
source: All Tiers
de: Alle Stufen
es: Todos los niveles
fr: Tous les niveaux
hi: सभी स्तर
id: Semua Tingkatan
pt: Todos os níveis
th: Tier ทั้งหมด
vi: Tất cả các bậc

# tierBenefitsNew
source: NEW
de: NEU
es: NUEVO
fr: NOUVEAU
hi: नया
id: BARU
pt: NOVO
th: ใหม่
vi: MỚI

# tierBenefitsPopular
source: POPULAR
de: BELIEBT
fr: POPULAIRE
hi: लोकप्रिय
id: POPULER
th: ยอดนิยม
vi: PHỔ BIẾN

# tierBenefitsBest
source: BEST
de: AM BESTEN
es: MEJOR
fr: MEILLEUR
hi: श्रेष्ठ
id: TERBAIK
pt: MELHOR
th: ดีที่สุด
vi: TỐT NHẤT

# tierBenefitsDailyCheckIn
source: Daily Check-in
de: Täglicher Check-in
es: Registro diario
fr: Enregistrement quotidien
hi: दैनिक चेक-इन
id: Check-in Harian
pt: Check-in Diário
th: เช็คอินรายวัน
vi: Nhận phòng hàng ngày

# tierBenefitsProTips
source: Pro Tips
de: Pro Tipps
es: Pro Consejos
fr: Pro Conseils
hi: Pro टिप्स
id: Pro Tip
pt: Pro Dicas
th: เคล็ดลับ
vi: Pro Lời khuyên

# tierBenefitsTip1
source: Use AI daily to earn free energy and build your streak
de: Nutze die KI täglich, um kostenlose Energie zu verdienen und deinen Streak aufzubauen
es: Utilice la IA a diario para ganar energía gratis y aumentar su racha
fr: Utilisez l'IA quotidiennement pour gagner de l'énergie gratuite et développer votre séquence
hi: मुफ़्त ऊर्जा अर्जित करने और अपनी स्ट्रीक बनाने के लिए प्रतिदिन AI का उपयोग करें
id: Gunakan AI setiap hari untuk mendapatkan energi gratis dan meningkatkan rekor Anda
pt: Use a IA diariamente para ganhar energia grátis e construir sua sequência
th: ใช้ AI ทุกวันเพื่อรับพลังงานฟรีและสร้าง streak
vi: Sử dụng AI hàng ngày để kiếm năng lượng miễn phí và xây dựng chuỗi của bạn

# tierBenefitsTip2
source: Diamond tier earns +4 Energy per day — that's 120/month!
de: Die Diamantstufe verdient +4 Energie pro Tag – das sind 120/Monat!
es: El nivel Diamante gana +4 de energía por día, ¡eso es 120 por mes!
fr: Le niveau Diamant rapporte +4 d'énergie par jour, soit 120/mois !
hi: डायमंड टियर प्रति दिन +4 ऊर्जा कमाता है - यानी 120/माह!
id: Tingkat berlian menghasilkan +4 Energi per hari — yaitu 120/bulan!
pt: O nível Diamante ganha +4 de energia por dia – são 120/mês!
th: Tier Diamond ได้รับ +4 พลังงานต่อวัน — นั่นคือ 120/เดือน!
vi: Cấp kim cương kiếm được +4 Năng lượng mỗi ngày - tức là 120/tháng!

# tierBenefitsTip3
source: Purchase Bonus applies to ALL energy packages!
de: Der Kaufbonus gilt für ALLE Energiepakete!
es: ¡El bono de compra aplica a TODOS los paquetes de energía!
fr: Le bonus d’achat s’applique à TOUS les forfaits énergie !
hi: खरीद बोनस सभी ऊर्जा पैकेजों पर लागू होता है!
id: Bonus Pembelian berlaku untuk SEMUA paket energi!
pt: O bônus de compra se aplica a TODOS os pacotes de energia!
th: โบนัสการซื้อใช้ได้กับแพ็คเกจพลังงานทั้งหมด!
vi: Phần thưởng mua hàng áp dụng cho TẤT CẢ các gói năng lượng!

# tierBenefitsTip4
source: Grace period protects your streak if you miss a day
de: Die Schonfrist schützt Ihren Streak, wenn Sie einen Tag verpassen
es: El período de gracia protege tu racha si pierdes un día
fr: Le délai de grâce protège votre séquence si vous manquez une journée
hi: यदि आप एक दिन चूक जाते हैं तो अनुग्रह अवधि आपकी स्ट्रीक की सुरक्षा करती है
id: Masa tenggang melindungi pukulan Anda jika Anda melewatkan satu hari
pt: O período de carência protege sua seqüência se você perder um dia
th: ช่วงเวลาพิเศษปกป้อง streak ของคุณหากพลาดวัน
vi: Thời gian gia hạn sẽ bảo vệ chuỗi ngày của bạn nếu bạn bỏ lỡ một ngày

# subscriptionEnergyPass
source: Energy Pass
de: Energiepass
es: Pase de energía
fr: Pass Energie
hi: ऊर्जा पास
id: Tiket Energi
pt: Passe Energia
vi: Thẻ năng lượng

# subscriptionInAppPurchasesNotAvailable
source: In-app purchases not available
de: In-App-Käufe sind nicht verfügbar
es: Compras dentro de la aplicación no disponibles
fr: Les achats intégrés ne sont pas disponibles
hi: इन-ऐप खरीदारी उपलब्ध नहीं है
id: Pembelian dalam aplikasi tidak tersedia
pt: Compras no aplicativo não disponíveis
th: ไม่สามารถใช้ In-app purchases ได้
vi: Mua hàng trong ứng dụng không khả dụng

# subscriptionFailedToInitiatePurchase
source: Failed to initiate purchase
de: Der Kauf konnte nicht eingeleitet werden
es: No se pudo iniciar la compra
fr: Échec de l'initialisation de l'achat
hi: खरीदारी आरंभ करने में विफल
id: Gagal memulai pembelian
pt: Falha ao iniciar a compra
th: ไม่สามารถเริ่มการซื้อได้
vi: Không thể bắt đầu mua hàng

# subscriptionError
source: Error: {error}
de: Fehler: {error}
fr: Erreur : {error}
hi: त्रुटि: {error}
id: Kesalahan: {error}
pt: Erro: {error}
th: เกิดข้อผิดพลาด: {error}
vi: Lỗi: {error}

# subscriptionFailedToLoad
source: Failed to load subscription
de: Das Abonnement konnte nicht geladen werden
es: No se pudo cargar la suscripción
fr: Échec du chargement de l'abonnement
hi: सदस्यता लोड करने में विफल
id: Gagal memuat langganan
pt: Falha ao carregar assinatura
th: ไม่สามารถโหลดข้อมูลการสมัครสมาชิกได้
vi: Không thể tải đăng ký

# subscriptionUnknownError
source: Unknown error
de: Unbekannter Fehler
es: Error desconocido
fr: Erreur inconnue
hi: अज्ञात त्रुटि
id: Kesalahan tidak diketahui
pt: Erro desconhecido
th: เกิดข้อผิดพลาดที่ไม่ทราบสาเหตุ
vi: Lỗi không xác định

# subscriptionRetry
source: Retry
de: Wiederholen
es: Rever
fr: Réessayer
hi: पुन: प्रयास करें
id: Mencoba kembali
pt: Tentar novamente
th: ลองอีกครั้ง
vi: Thử lại

# subscriptionEnergyPassActive
source: Energy Pass Active
de: Energiepass aktiv
es: Pase de energía activo
fr: Pass Energie Actif
hi: ऊर्जा पास सक्रिय
id: Energi Lulus Aktif
pt: Passe de Energia Ativo
th: Energy Pass ใช้งานได้
vi: Năng lượng Pass đang hoạt động

# subscriptionUnlimitedAccess
source: You have unlimited access
de: Sie haben uneingeschränkten Zugriff
es: Tienes acceso ilimitado
fr: Vous avez un accès illimité
hi: आपके पास असीमित पहुंच है
id: Anda memiliki akses tak terbatas
pt: Você tem acesso ilimitado
th: คุณมีสิทธิ์ใช้งานไม่จำกัด
vi: Bạn có quyền truy cập không giới hạn

# subscriptionStatus
source: Status
es: Estado
fr: Statut
hi: स्थिति
th: สถานะ
vi: Trạng thái

# subscriptionRenews
source: Renews
de: Erneuert
es: Renueva
fr: Renouvelle
hi: नवीनिकृत
id: Memperbarui
pt: Renova
th: ต่ออายุ
vi: Gia hạn

# subscriptionPrice
source: Price
de: Preis
es: Precio
fr: Prix
hi: कीमत
id: Harga
pt: Preço
th: ราคา
vi: Giá

# subscriptionYourBenefits
source: Your Benefits
de: Ihre Vorteile
es: Tus beneficios
fr: Vos avantages
hi: आपके लाभ
id: Keuntungan Anda
pt: Seus benefícios
th: สิทธิประโยชน์ของคุณ
vi: Lợi ích của bạn

# subscriptionManageSubscription
source: Manage Subscription
de: Abonnement verwalten
es: Administrar suscripción
fr: Gérer l'abonnement
hi: सदस्यता प्रबंधित करें
id: Kelola Langganan
pt: Gerenciar assinatura
th: จัดการการสมัครสมาชิก
vi: Quản lý đăng ký

# subscriptionNoProductAvailable
source: No subscription product available
de: Kein Abonnementprodukt verfügbar
es: No hay producto de suscripción disponible
fr: Aucun produit d'abonnement disponible
hi: कोई सदस्यता उत्पाद उपलब्ध नहीं है
id: Tidak ada produk berlangganan yang tersedia
pt: Nenhum produto de assinatura disponível
th: ไม่มีแพ็คเกจการสมัครสมาชิก
vi: Không có sản phẩm đăng ký nào

# subscriptionWhatYouGet
source: What You Get
de: Was Sie bekommen
es: Lo que obtienes
fr: Ce que vous obtenez
hi: आपको क्या मिलता है
id: Apa yang Anda Dapatkan
pt: O que você ganha
th: สิ่งที่คุณจะได้รับ
vi: Những gì bạn nhận được

# subscriptionPerMonth
source: per month
de: pro Monat
es: por mes
fr: par mois
hi: प्रति महीने
id: per bulan
pt: por mês
th: ต่อเดือน
vi: mỗi tháng

# subscriptionSubscribeNow
source: Subscribe Now
de: Jetzt abonnieren
es: Suscríbete ahora
fr: Abonnez-vous maintenant
hi: अब सदस्यता लें
id: Berlangganan Sekarang
pt: Assine agora
th: สมัครสมาชิกเลย
vi: Đăng ký ngay

# subscriptionCancelAnytime
source: Cancel anytime
de: Jederzeit kündbar
es: Cancelar en cualquier momento
fr: Annuler à tout moment
hi: किसी भी समय रद्द करें
id: Batalkan kapan saja
pt: Cancele a qualquer momento
th: ยกเลิกได้ทุกเมื่อ
vi: Hủy bất cứ lúc nào

# subscriptionAutoRenewTerms
source: Your subscription will renew automatically. You can cancel anytime from Google Play.
de: Ihr Abonnement verlängert sich automatisch. Sie können jederzeit ab Google Play kündigen.
es: Su suscripción se renovará automáticamente. Puedes cancelar en cualquier momento desde Google Play.
fr: Votre abonnement sera renouvelé automatiquement. Vous pouvez annuler à tout moment à partir de Google Play.
hi: आपकी सदस्यता स्वतः नवीनीकृत हो जाएगी. आप Google Play से कभी भी रद्द कर सकते हैं।
id: Langganan Anda akan diperpanjang secara otomatis. Anda dapat membatalkan kapan saja dari Google Play.
pt: Sua assinatura será renovada automaticamente. Você pode cancelar a qualquer momento no Google Play.
th: การสมัครสมาชิกของคุณจะต่ออายุอัตโนมัติ คุณสามารถยกเลิกได้ทุกเมื่อจาก Google Play
vi: Đăng ký của bạn sẽ tự động gia hạn. Bạn có thể hủy bất cứ lúc nào từ Google Play.

# disclaimerHealthDisclaimer
source: Health Disclaimer
de: Haftungsausschluss für die Gesundheit
es: Descargo de responsabilidad de salud
fr: Avis de non-responsabilité concernant la santé
hi: स्वास्थ्य अस्वीकरण
id: Penafian Kesehatan
pt: Isenção de responsabilidade de saúde
th: ข้อจำกัดความรับผิด
vi: Tuyên bố miễn trừ trách nhiệm về sức khỏe

# disclaimerImportantReminders
source: Important Reminders:
de: Wichtige Hinweise:
es: Recordatorios importantes:
fr: Rappels importants :
hi: महत्वपूर्ण अनुस्मारक:
id: Pengingat Penting:
pt: Lembretes importantes:
th: ข้อควรระวังสำคัญ:
vi: Lời nhắc quan trọng:

# disclaimerBullet1
source: All nutritional data is estimated
de: Alle Nährwertangaben sind Schätzungen
es: Todos los datos nutricionales son estimados.
fr: Toutes les données nutritionnelles sont estimées
hi: सभी पोषण संबंधी डेटा का अनुमान लगाया गया है
id: Semua data nutrisi diperkirakan
pt: Todos os dados nutricionais são estimados
th: ข้อมูลโภชนาการทั้งหมดเป็นค่าประมาณ
vi: Tất cả dữ liệu dinh dưỡng được ước tính

# disclaimerBullet2
source: AI analysis may contain errors
de: Die KI-Analyse kann Fehler enthalten
es: El análisis de IA puede contener errores
fr: L'analyse de l'IA peut contenir des erreurs
hi: एआई विश्लेषण में त्रुटियां हो सकती हैं
id: Analisis AI mungkin mengandung kesalahan
pt: A análise de IA pode conter erros
th: การวิเคราะห์ AI อาจมีข้อผิดพลาด
vi: Phân tích AI có thể có lỗi

# disclaimerBullet3
source: Not a substitute for professional advice
de: Kein Ersatz für professionelle Beratung
es: No sustituye al asesoramiento profesional.
fr: Ne remplace pas les conseils d'un professionnel
hi: पेशेवर सलाह का विकल्प नहीं
id: Bukan pengganti nasihat profesional
pt: Não substitui o aconselhamento profissional
th: ไม่ใช่คำแนะนำจากผู้เชี่ยวชาญ
vi: Không thay thế cho lời khuyên chuyên nghiệp

# disclaimerBullet4
source: Consult healthcare providers for medical guidance
de: Konsultieren Sie Gesundheitsdienstleister für medizinische Beratung
es: Consulte a los proveedores de atención médica para obtener orientación médica.
fr: Consulter des prestataires de soins de santé pour obtenir des conseils médicaux
hi: चिकित्सीय मार्गदर्शन के लिए स्वास्थ्य सेवा प्रदाताओं से परामर्श लें
id: Konsultasikan dengan penyedia layanan kesehatan untuk mendapatkan panduan medis
pt: Consulte profissionais de saúde para orientação médica
th: ปรึกษาผู้ให้บริการด้านสุขภาพสำหรับคำแนะนำทางการแพทย์
vi: Tham khảo ý kiến ​​các nhà cung cấp dịch vụ chăm sóc sức khỏe để được hướng dẫn y tế

# disclaimerBullet5
source: Use at your own discretion and risk
de: Die Nutzung erfolgt nach eigenem Ermessen und auf eigenes Risiko
es: Úselo bajo su propia discreción y riesgo.
fr: Utilisez à votre propre discrétion et à vos risques
hi: अपने विवेक और जोखिम पर उपयोग करें
id: Gunakan atas kebijaksanaan dan risiko Anda sendiri
pt: Use a seu próprio critério e risco
th: ใช้ตามดุลยพินิจและความเสี่ยงของคุณเอง
vi: Sử dụng theo quyết định và rủi ro của riêng bạn

# disclaimerIUnderstand
source: I Understand
de: Ich verstehe
es: Entiendo
fr: Je comprends
hi: मैं समझता हूँ
id: Saya mengerti
pt: Eu entendo
th: ฉันเข้าใจแล้ว
vi: Tôi hiểu

# privacyPolicyTitle
source: Privacy Policy
de: Datenschutzrichtlinie
es: política de privacidad
fr: politique de confidentialité
hi: गोपनीयता नीति
id: Kebijakan Privasi
pt: política de Privacidade
th: นโยบายความเป็นส่วนตัว
vi: Chính sách bảo mật

# privacyPolicySubtitle
source: MiRO — My Intake Record Oracle
es: MiRO — Oráculo de mi registro de admisión
fr: MiRO — Mon enregistrement d'admission Oracle
hi: MiRO - मेरा इंटेक रिकॉर्ड ओरेकल
id: MiRO — Oracle Catatan Penerimaan Saya
pt: MiRO — Meu Oráculo de Registro de Ingestão
vi: MiRO — Bản ghi thu nhập của tôi Oracle

# privacyPolicyHeaderNote
source: Your food data stays on your device. Energy balance synced securely via Firebase.
de: Ihre Lebensmitteldaten bleiben auf Ihrem Gerät. Energiebilanz sicher über Firebase synchronisiert.
es: Los datos de sus alimentos permanecen en su dispositivo. Balance de energía sincronizado de forma segura a través de Firebase.
fr: Vos données alimentaires restent sur votre appareil. Bilan énergétique synchronisé en toute sécurité via Firebase.
hi: आपका भोजन डेटा आपके डिवाइस पर रहता है। ऊर्जा संतुलन Firebase के माध्यम से सुरक्षित रूप से समन्वयित किया गया।
id: Data makanan Anda tetap ada di perangkat Anda. Keseimbangan energi disinkronkan dengan aman melalui Firebase.
pt: Seus dados alimentares permanecem no seu dispositivo. Balanço de energia sincronizado com segurança via Firebase.
th: ข้อมูลอาหารของคุณเก็บไว้บนอุปกรณ์ของคุณ พลังงานซิงค์อย่างปลอดภัยผ่าน Firebase
vi: Dữ liệu thực phẩm của bạn vẫn còn trên thiết bị của bạn. Cân bằng năng lượng được đồng bộ hóa an toàn qua Firebase.

# privacyPolicySectionInformationWeCollect
source: Information We Collect
de: Informationen, die wir sammeln
es: Información que recopilamos
fr: Informations que nous collectons
hi: जानकारी हम एकत्रित करते हैं
id: Informasi yang Kami Kumpulkan
pt: Informações que coletamos
th: ข้อมูลที่เรารวบรวม
vi: Thông tin chúng tôi thu thập

# privacyPolicySectionDataStorage
source: Data Storage
de: Datenspeicherung
es: Almacenamiento de datos
fr: Stockage des données
hi: आधार सामग्री भंडारण
id: Penyimpanan Data
pt: Armazenamento de dados
th: การเก็บข้อมูล
vi: Lưu trữ dữ liệu

# privacyPolicySectionDataTransmission
source: Data Transmission to Third Parties
de: Datenübermittlung an Dritte
es: Transmisión de datos a terceros
fr: Transmission de données à des tiers
hi: तीसरे पक्ष को डेटा ट्रांसमिशन
id: Transmisi Data ke Pihak Ketiga
pt: Transmissão de Dados a Terceiros
th: การส่งข้อมูลไปยังบุคคลที่สาม
vi: Truyền dữ liệu cho bên thứ ba

# privacyPolicySectionRequiredPermissions
source: Required Permissions
de: Erforderliche Berechtigungen
es: Permisos requeridos
fr: Autorisations requises
hi: आवश्यक अनुमतियाँ
id: Izin yang Diperlukan
pt: Permissões necessárias
th: สิทธิ์ที่จำเป็น
vi: Quyền cần thiết

# privacyPolicySectionSecurity
source: Security
de: Sicherheit
es: Seguridad
fr: Sécurité
hi: सुरक्षा
id: Keamanan
pt: Segurança
th: ความปลอดภัย
vi: Bảo vệ

# privacyPolicySectionUserRights
source: User Rights
de: Benutzerrechte
es: Derechos de usuario
fr: Droits des utilisateurs
hi: प्रयोगकर्ता के अधिकार
id: Hak Pengguna
pt: Direitos do usuário
th: สิทธิ์ของผู้ใช้
vi: Quyền của người dùng

# privacyPolicySectionDataRetention
source: Data Retention
de: Datenaufbewahrung
es: Retención de datos
fr: Conservation des données
hi: डेटा प्रतिधारण
id: Retensi Data
pt: Retenção de dados
th: การเก็บรักษาข้อมูล
vi: Lưu giữ dữ liệu

# privacyPolicySectionChildrenPrivacy
source: Children's Privacy
de: Privatsphäre von Kindern
es: Privacidad de los niños
fr: Confidentialité des enfants
hi: बच्चों की गोपनीयता
id: Privasi Anak
pt: Privacidade infantil
th: ความเป็นส่วนตัวของเด็ก
vi: Quyền riêng tư của trẻ em

# privacyPolicySectionChangesToPolicy
source: Changes to This Policy
de: Änderungen an dieser Richtlinie
es: Cambios a esta política
fr: Modifications de cette politique
hi: इस नीति में परिवर्तन
id: Perubahan pada Kebijakan Ini
pt: Mudanças nesta política
th: การเปลี่ยนแปลงนโยบาย
vi: Những thay đổi đối với Chính sách này

# privacyPolicySectionDataCollectionConsent
source: Data Collection Consent
de: Einwilligung zur Datenerfassung
es: Consentimiento para la recopilación de datos
fr: Consentement à la collecte de données
hi: डेटा संग्रहण सहमति
id: Persetujuan Pengumpulan Data
pt: Consentimento para coleta de dados
th: ความยินยอมในการเก็บข้อมูล
vi: Đồng ý thu thập dữ liệu

# privacyPolicySectionPDPACompliance
source: PDPA Compliance (Thailand Personal Data Protection Act)
de: PDPA-Konformität (Thailand Personal Data Protection Act)
es: Cumplimiento de PDPA (Ley de protección de datos personales Pro de Tailandia)
fr: Conformité PDPA (loi thaïlandaise sur la protection des données personnelles Pro)
hi: पीडीपीए अनुपालन (थाईलैंड व्यक्तिगत डेटा Proटेक्शन अधिनियम)
id: Kepatuhan PDPA (Data Pribadi Thailand Protection Act)
pt: Conformidade com PDPA (Lei de Proteção de Dados Pessoais da Tailândia Pro)
th: การปฏิบัติตาม PDPA (พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล)
vi: Tuân thủ PDPA (Đạo luật về dữ liệu cá nhân của Thái Lan Protection)

# privacyPolicySectionContactUs
source: Contact Us
de: Kontaktieren Sie uns
es: Contáctenos
fr: Contactez-nous
hi: हमसे संपर्क करें
id: Hubungi kami
pt: Contate-nos
th: ติดต่อเรา
vi: Liên hệ với chúng tôi

# privacyPolicyEffectiveDate
source: Effective Date: February 18, 2026 Last Updated: February 18, 2026
de: Datum des Inkrafttretens: 18. Februar 2026 Letzte Aktualisierung: 18. Februar 2026
es: Fecha de vigencia: 18 de febrero de 2026 Última actualización: 18 de febrero de 2026
fr: Date d'entrée en vigueur : 18 février 2026 Dernière mise à jour : 18 février 2026
hi: प्रभावी तिथि: 18 फरवरी, 2026 अंतिम अद्यतन: 18 फरवरी, 2026
id: Tanggal Berlaku: 18 Februari 2026 Terakhir Diperbarui: 18 Februari 2026
pt: Data de vigência: 18 de fevereiro de 2026 Última atualização: 18 de fevereiro de 2026
th: วันที่มีผลบังคับใช้: 18 กุมภาพันธ์ 2026 อัพเดทล่าสุด: 18 กุมภาพันธ์ 2026
vi: Ngày có hiệu lực: 18 tháng 2 năm 2026 Cập nhật lần cuối: ngày 18 tháng 2 năm 2026

# termsOfServiceTitle
source: Terms of Service
de: Nutzungsbedingungen
es: Términos de servicio
fr: Conditions d'utilisation
hi: सेवा की शर्तें
id: Ketentuan Layanan
pt: Termos de Serviço
th: เงื่อนไขการใช้งาน
vi: Điều khoản dịch vụ

# termsSubtitle
source: MiRO — My Intake Record Oracle
es: MiRO — Oráculo de mi registro de admisión
fr: MiRO — Mon enregistrement d'admission Oracle
hi: MiRO - मेरा इंटेक रिकॉर्ड ओरेकल
id: MiRO — Oracle Catatan Penerimaan Saya
pt: MiRO — Meu Oráculo de Registro de Ingestão
vi: MiRO — Bản ghi thu nhập của tôi Oracle

# termsSectionAcceptanceOfTerms
source: Acceptance of Terms
de: Annahme der Bedingungen
es: Aceptación de términos
fr: Acceptation des conditions
hi: शर्तों की स्वीकृति
id: Penerimaan Persyaratan
pt: Aceitação dos Termos
th: การยอมรับเงื่อนไข
vi: Chấp nhận các điều khoản

# termsSectionServiceDescription
source: Service Description
de: Servicebeschreibung
es: Descripción del servicio
fr: Description des services
hi: सेवा विवरण
id: Deskripsi Layanan
pt: Descrição do serviço
th: คำอธิบายบริการ
vi: Mô tả dịch vụ

# termsSectionDisclaimerOfWarranties
source: Disclaimer of Warranties
de: Haftungsausschluss
es: Renuncia de garantías
fr: Exclusion de garanties
hi: वारंटियों का अस्वीकरण
id: Penafian Jaminan
pt: Isenção de responsabilidade de garantias
th: ข้อจำกัดความรับผิด
vi: Từ chối trách nhiệm bảo đảm

# termsSectionEnergySystemTerms
source: Energy System Terms
de: Begriffe des Energiesystems
es: Términos del sistema de energía
fr: Conditions du système énergétique
hi: ऊर्जा प्रणाली शर्तें
id: Istilah Sistem Energi
pt: Termos do Sistema Energético
th: เงื่อนไขระบบพลังงาน
vi: Điều khoản hệ thống năng lượng

# termsSectionUserDataAndResponsibilities
source: User Data and Responsibilities
de: Benutzerdaten und Verantwortlichkeiten
es: Datos y responsabilidades del usuario
fr: Données utilisateur et responsabilités
hi: उपयोगकर्ता डेटा और जिम्मेदारियाँ
id: Data Pengguna dan Tanggung Jawab
pt: Dados e responsabilidades do usuário
th: ข้อมูลและความรับผิดชอบของผู้ใช้
vi: Dữ liệu và trách nhiệm của người dùng

# termsSectionBackupTransfer
source: Backup & Transfer
de: Sichern und Übertragen
es: Copia de seguridad y transferencia
fr: Sauvegarde et transfert
hi: बैकअप और स्थानांतरण
id: Cadangan & Transfer
pt: Backup e transferência
th: สำรองข้อมูลและการโอนย้าย
vi: Sao lưu & Chuyển giao

# termsSectionInAppPurchases
source: In-App Purchases
de: In-App-Käufe
es: Compras dentro de la aplicación
fr: Achats intégrés
hi: इन-ऐप खरीदारी
id: Pembelian Dalam Aplikasi
pt: Compras no aplicativo
th: การซื้อในแอป
vi: Mua hàng trong ứng dụng

# termsSectionProhibitedUses
source: Prohibited Uses
de: Proverbotene Verwendungen
es: ProUsos prohibidos
fr: ProUtilisations interdites
hi: Proनिषिद्ध उपयोग
id: Promenghambat Penggunaan
pt: ProUsos proibidos
th: การใช้งานที่ห้าม
vi: ProSử dụng bị cấm
