Repository: lnxelnope/miro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, pt, th, vi

# nutritionAutoCalculated
source: Nutrition (auto-calculated by amount)
de: Nährwert (automatisch nach Menge berechnet)
es: Nutrición (calculada automáticamente por cantidad)
fr: Nutrition (auto-calculée par montant)
hi: पोषण (राशि द्वारा स्वतः गणना)
id: Nutrisi (dihitung otomatis berdasarkan jumlah)
pt: Nutrição (calculada automaticamente por quantidade)
th: โภชนาการ (คำนวณอัตโนมัติตามปริมาณ)
vi: Dinh dưỡng (tự động tính theo lượng)

# nutritionEnterZero
source: Nutrition (enter 0 if unknown)
de: Ernährung (geben Sie 0 ein, wenn unbekannt)
es: Nutrición (ingrese 0 si se desconoce)
fr: Nutrition (entrez 0 si inconnu)
hi: पोषण (यदि अज्ञात हो तो 0 दर्ज करें)
id: Nutrisi (masukkan 0 jika tidak diketahui)
pt: Nutrição (insira 0 se desconhecido)
th: โภชนาการ (กรอก 0 ถ้าไม่ทราบ)
vi: Dinh dưỡng (nhập 0 nếu không biết)

# caloriesLabel
source: Calories (kcal)
de: Kalorien (kcal)
es: Calorías (kcal)
hi: कैलोरी (kcal)
id: Kalori (kcal)
pt: Calorias (kcal)
th: แคลอรี่ (kcal)
vi: Lượng calo (kcal)

# proteinLabelShort
source: Protein (g)
es: Proteína (g)
fr: Protéine (g)
hi: Proटीन (जी)
pt: Proteína (g)
th: โปรตีน (g)

# carbsLabelShort
source: Carbs (g)
de: Kohlenhydrate (g)
es: Carbohidratos (g)
fr: Glucides (g)
hi: कार्ब्स (जी)
id: Karbohidrat (g)
pt: Carboidratos (g)
th: คาร์บ (g)
vi: Carb (g)

# fatLabelShort
source: Fat (g)
de: Fett (g)
es: Grasa (g)
fr: Graisse (g)
hi: वसा (जी)
id: Lemak (g)
pt: Gordura (g)
th: ไขมัน (g)
vi: Chất béo (g)

# mealTypeLabel
source: Meal Type
de: Art der Mahlzeit
es: Tipo de comida
fr: Type de repas
hi: भोजन का प्रकार
id: Jenis Makanan
pt: Tipo de refeição
th: ประเภทมื้อ
vi: Loại bữa ăn

source: Please enter food name first
de: Bitte geben Sie zuerst den Lebensmittelnamen ein
es: Por favor ingrese primero el nombre del alimento
fr: Veuillez d'abord saisir le nom de l'aliment
hi: कृपया पहले भोजन का नाम दर्ज करें
id: Silakan masukkan nama makanan terlebih dahulu
pt: Por favor, insira o nome do alimento primeiro
th: กรุณากรอกชื่ออาหารก่อน
vi: Vui lòng nhập tên món ăn trước

# savedAnalyzingBackground
source: ✅ Saved — analyzing in background
de: ✅ Gespeichert – Analyse im Hintergrund
es: ✅ Guardado: analizando en segundo plano
fr: ✅ Enregistré - analyse en arrière-plan
hi: ✅ सहेजा गया - पृष्ठभूमि में विश्लेषण
id: ✅ Tersimpan - menganalisis di latar belakang
pt: ✅ Salvo — analisando em segundo plano
th: ✅ บันทึกแล้ว — กำลังวิเคราะห์ในพื้นหลัง
vi: ✅ Đã lưu - phân tích ở chế độ nền

source: ✅ Food added
de: ✅ Essen hinzugefügt
es: ✅ Alimentos agregados
fr: ✅ Nourriture ajoutée
hi: ✅ भोजन जोड़ा गया
id: ✅ Makanan ditambahkan
pt: ✅ Alimentos adicionados
th: ✅ เพิ่มอาหารแล้ว
vi: ✅ Bổ sung thực phẩm

# suggestionSourceMyMeal
source: My Meal
de: Meine Mahlzeit
es: mi comida
fr: Mon repas
hi: मेरा भोजन
id: Makananku
pt: Minha refeição
th: เมนูของฉัน
vi: Bữa ăn của tôi

# suggestionSourceIngredient
source: Ingredient
de: Bestandteil
es: Ingrediente
fr: Ingrédient
hi: घटक
id: Bahan
pt: Ingrediente
th: วัตถุดิบ
vi: Nguyên liệu

# suggestionSourceDatabase
source: Database
de: Datenbank
es: Base de datos
fr: Base de données
hi: डेटाबेस
id: Basis data
pt: Banco de dados
th: ฐานข้อมูล
vi: Cơ sở dữ liệu

# editFoodTitle
source: Edit Food
de: Essen bearbeiten
es: Editar comida
fr: Modifier la nourriture
hi: भोजन संपादित करें
id: Sunting Makanan
pt: Editar comida
th: แก้ไขอาหาร
vi: Chỉnh sửa món ăn

# foodNameLabel
source: Food name
de: Lebensmittelname
es: Nombre del alimento
fr: Nom de l'aliment
hi: भोजन का नाम
id: Nama makanan
pt: Nome da comida
th: ชื่ออาหาร
vi: Tên món ăn

# changeAmountAutoUpdate
source: Change amount → calories update automatically
de: Menge ändern → Kalorien werden automatisch aktualisiert
es: Cambiar cantidad → las calorías se actualizan automáticamente
fr: Modifier la quantité → les calories sont mises à jour automatiquement
hi: मात्रा बदलें → कैलोरी स्वचालित रूप से अपडेट हो जाती है
id: Ubah jumlah → pembaruan kalori secara otomatis
pt: Alterar quantidade → calorias são atualizadas automaticamente
th: เปลี่ยนปริมาณ → แคลอรี่อัพเดทอัตโนมัติ
vi: Thay đổi lượng → lượng calo tự động cập nhật

# baseNutrition
source: Base: {calories} kcal / 1 {unit}
de: Basis: {calories} kcal / 1 {unit}
fr: Socle : {calories} kcal / 1 {unit}
hi: आधार: {calories} kcal / 1 {unit}
id: Basis: {calories} kcal / 1 {unit}
th: ค่าฐาน: {calories} kcal / 1 {unit}
vi: Cơ sở: {calories} kcal / 1 {unit}

# calculatedFromIngredients
source: Calculated from ingredients below
de: Berechnet aus den unten aufgeführten Zutaten
es: Calculado a partir de los siguientes ingredientes
fr: Calculé à partir des ingrédients ci-dessous
hi: नीचे दी गई सामग्रियों से गणना की गई
id: Dihitung dari bahan-bahan di bawah ini
pt: Calculado a partir dos ingredientes abaixo
th: คำนวณจากวัตถุดิบด้านล่าง
vi: Tính từ các thành phần dưới đây

source: Ingredients (Editable)
de: Zutaten (bearbeitbar)
es: Ingredientes (Editables)
fr: Ingrédients (modifiables)
hi: सामग्री (संपादन योग्य)
id: Bahan (Dapat Diedit)
pt: Ingredientes (editáveis)
th: วัตถุดิบ (แก้ไขได้)
vi: Thành phần (có thể chỉnh sửa)

# addIngredientButton
source: Add
de: Hinzufügen
es: Agregar
fr: Ajouter
hi: जोड़ना
id: Menambahkan
pt: Adicionar
th: เพิ่ม
vi: Thêm vào

# noIngredientsAddHint
source: No ingredients — tap "Add" to add new
de: Keine Zutaten – tippen Sie auf „Hinzufügen“, um neue hinzuzufügen
es: Sin ingredientes: toca "Agregar" para agregar nuevos
fr: Aucun ingrédient - appuyez sur "Ajouter" pour en ajouter un nouveau
hi: कोई सामग्री नहीं - नई सामग्री जोड़ने के लिए "जोड़ें" पर टैप करें
id: Tanpa bahan — ketuk "Tambah" untuk menambahkan bahan baru
pt: Sem ingredientes – toque em "Adicionar" para adicionar novos
th: ไม่มีวัตถุดิบ — กด "เพิ่ม" เพื่อเพิ่มใหม่
vi: Không có thành phần nào — nhấn "Thêm" để thêm thành phần mới

# editIngredientsHint
source: Edit name/amount → Tap search icon to search database or AI
de: Name/Betrag bearbeiten → Tippen Sie auf das Suchsymbol, um die Datenbank oder AI zu durchsuchen
es: Editar nombre/cantidad → Toque el ícono de búsqueda para buscar en la base de datos o AI
fr: Modifier le nom/montant → Appuyez sur l'icône de recherche pour rechercher la base de données ou l'IA
hi: नाम/राशि संपादित करें → डेटाबेस या एआई खोजने के लिए खोज आइकन टैप करें
id: Edit nama/jumlah → Ketuk ikon pencarian untuk mencari database atau AI
pt: Editar nome/quantidade → Toque no ícone de pesquisa para pesquisar no banco de dados ou IA
th: แก้ไขชื่อ/ปริมาณ → กดไอคอนค้นหาเพื่อค้นหาจากฐานข้อมูลหรือ AI
vi: Chỉnh sửa tên/số tiền → Nhấn vào biểu tượng tìm kiếm để tìm kiếm cơ sở dữ liệu hoặc AI

# ingredientNameHint
source: e.g. Chicken Egg
de: z.B. Hühnerei
es: p.ej. huevo de gallina
fr: par ex. Œuf de poule
hi: जैसे मुर्गी का अंडा
id: misalnya Telur Ayam
pt: por exemplo Ovo de galinha
th: เช่น ไข่ไก่
vi: ví dụ. Trứng gà

# searchDbOrAi
source: Search DB / AI
de: Suche DB/AI
es: Buscar base de datos/IA
fr: Rechercher dans la base de données/IA
hi: डीबी/एआई खोजें
id: Cari DB / AI
pt: Pesquisar banco de dados/IA
th: ค้นหาจาก DB / AI
vi: Tìm kiếm cơ sở dữ liệu/AI

# amountHint
source: Amount
de: Menge
es: Cantidad
fr: Montant
hi: मात्रा
id: Jumlah
pt: Quantia
th: ปริมาณ
vi: Số lượng

source: From Database
de: Aus der Datenbank
es: Desde la base de datos
fr: À partir de la base de données
hi: डेटाबेस से
id: Dari Basis Data
pt: Do banco de dados
th: จากฐานข้อมูล
vi: Từ cơ sở dữ liệu

# subIngredients
source: Sub-ingredients ({count})
de: Unterzutaten ({count})
es: Subingredientes ({count})
fr: Sous-ingrédients ({count})
hi: उप-सामग्री ({count})
id: Sub-bahan ({count})
pt: Subingredientes ({count})
th: วัตถุดิบย่อย ({count})
vi: Thành phần phụ ({count})

# addSubIngredient
source: Add
de: Hinzufügen
es: Agregar
fr: Ajouter
hi: जोड़ना
id: Menambahkan
pt: Adicionar
th: เพิ่ม
vi: Thêm vào

# subIngredientNameHint
source: Sub-ingredient name
de: Name der Unterzutat
es: Nombre del subingrediente
fr: Nom du sous-ingrédient
hi: उप-घटक का नाम
id: Nama sub-bahan
pt: Nome do subingrediente
th: ชื่อวัตถุดิบย่อย
vi: Tên thành phần phụ

# amountShort
source: Amt
es: cantidad
fr: Montant
hi: राशि
pt: Valor
th: ปริมาณ
vi: số tiền

# pleaseEnterSubIngredientName
source: Please enter sub-ingredient name first
de: Bitte geben Sie zuerst den Namen der Unterzutat ein
es: Por favor ingrese primero el nombre del subingrediente
fr: Veuillez d'abord saisir le nom du sous-ingrédient
hi: कृपया पहले उप-घटक का नाम दर्ज करें
id: Silakan masukkan nama sub-bahan terlebih dahulu
pt: Por favor, insira o nome do subingrediente primeiro
th: กรุณากรอกชื่อวัตถุดิบย่อยก่อน
vi: Vui lòng nhập tên thành phần phụ trước

# foundInDatabaseSub
source: Found "{name}" in database!
de: „{name}“ in der Datenbank gefunden!
es: ¡Encontré "{name}" en la base de datos!
fr: "{name}" trouvé dans la base de données !
hi: डेटाबेस में "{name}" मिला!
id: Ditemukan "{name}" di database!
pt: Encontrado "{name}" no banco de dados!
th: พบ "{name}" ในฐานข้อมูล!
vi: Đã tìm thấy "{name}" trong cơ sở dữ liệu!

# aiAnalyzedSub
source: AI analyzed "{name}" (-1 Energy)
de: KI analysierte „{name}“ (-1 Energie)
es: AI analizó "{name}" (-1 Energía)
fr: L'IA a analysé "{name}" (-1 énergie)
hi: AI ने "{name}" (-1 ऊर्जा) का विश्लेषण किया
id: AI menganalisis "{name}" (-1 Energi)
pt: IA analisou "{name}" (-1 Energia)
th: AI วิเคราะห์ "{name}" (-1 Energy)
vi: AI đã phân tích "{name}" (-1 Năng lượng)

# couldNotAnalyzeSub
source: Could not analyze sub-ingredient
de: Unterbestandteil konnte nicht analysiert werden
es: No se pudo analizar el subingrediente
fr: Impossible d'analyser le sous-ingrédient
hi: उप-घटक का विश्लेषण नहीं किया जा सका
id: Tidak dapat menganalisis sub-bahan
pt: Não foi possível analisar o subingrediente
th: ไม่สามารถวิเคราะห์วัตถุดิบย่อยได้
vi: Không thể phân tích thành phần phụ

source: Please enter ingredient name
de: Bitte geben Sie den Namen der Zutat ein
es: Por favor ingrese el nombre del ingrediente
fr: Veuillez entrer le nom de l'ingrédient
hi: कृपया घटक का नाम दर्ज करें
id: Silakan masukkan nama bahan
pt: Por favor insira o nome do ingrediente
th: กรุณากรอกชื่อวัตถุดิบ
vi: Vui lòng nhập tên thành phần

# reAnalyzeTitle
source: Re-analyze?
de: Neu analysieren?
es: ¿Volver a analizar?
fr: Réanalyser ?
hi: पुनः विश्लेषण करें?
id: Analisis ulang?
pt: Reanalisar?
th: วิเคราะห์ใหม่?
vi: Phân tích lại?

# reAnalyzeMessage
source: "{name}" already has nutrition data. Analyzing again will use 1 Energy. Continue?
de: „{name}“ verfügt bereits über Nährwertdaten. Eine erneute Analyse verbraucht 1 Energie. Weitermachen?
es: "{name}" ya tiene datos nutricionales. Analizar nuevamente consumirá 1 energía. ¿Continuar?
fr: "{name}" contient déjà des données nutritionnelles. Une nouvelle analyse utilisera 1 énergie. Continuer?
hi: "{name}" में पहले से ही पोषण डेटा है। दोबारा विश्लेषण करने पर 1 ऊर्जा का उपयोग होगा। जारी रखना?
id: "{name}" sudah memiliki data nutrisi. Menganalisis lagi akan menggunakan 1 Energi. Melanjutkan?
pt: "{name}" já possui dados nutricionais. Analisar novamente usará 1 Energia. Continuar?
th: "{name}" มีข้อมูลโภชนาการอยู่แล้ว การวิเคราะห์ใหม่จะใช้ 1 Energy ดำเนินการต่อ?
vi: "{name}" đã có dữ liệu dinh dưỡng. Phân tích lại sẽ tiêu tốn 1 Năng lượng. Tiếp tục?

# reAnalyzeButton
source: Re-analyze (1 Energy)
de: Erneut analysieren (1 Energie)
es: Volver a analizar (1 energía)
fr: Réanalyser (1 énergie)
hi: पुनः विश्लेषण करें (1 ऊर्जा)
id: Analisis ulang (1 Energi)
pt: Reanalisar (1 Energia)
th: วิเคราะห์ใหม่ (1 Energy)
vi: Phân tích lại (1 Năng lượng)

source: Amount not specified
de: Betrag nicht angegeben
es: Cantidad no especificada
fr: Montant non précisé
hi: राशि निर्दिष्ट नहीं है
id: Jumlah tidak ditentukan
pt: Valor não especificado
th: ไม่ได้ระบุปริมาณ
vi: Số tiền không được chỉ định

# amountNotSpecifiedMessage
source: Please specify amount for "{name}" first Or use default 100 g?
de: Bitte geben Sie zuerst den Betrag für „{name}“ an Oder Standard 100 g verwenden?
es: Especifique primero el monto de "{name}" ¿O usar 100 g predeterminados?
fr: Veuillez d'abord préciser le montant pour « {name} » Ou utiliser 100 g par défaut ?
hi: कृपया पहले "{name}" के लिए राशि निर्दिष्ट करें या डिफ़ॉल्ट 100 ग्राम का उपयोग करें?
id: Harap tentukan jumlah untuk "{name}" terlebih dahulu Atau pakai bawaan 100 gr?
pt: Especifique o valor para "{name}" primeiro Ou usar o padrão 100g?
th: กรุณาระบุปริมาณสำหรับ "{name}" ก่อน หรือใช้ค่าเริ่มต้น 100 g?
vi: Vui lòng chỉ định số tiền cho "{name}" trước Hoặc sử dụng 100 g mặc định?

# useDefault100g
source: Use 100 g
de: Verwenden Sie 100 g
es: Utilice 100 gramos
fr: Utiliser 100 g
hi: 100 ग्राम का प्रयोग करें
id: Gunakan 100 gram
pt: Usar 100g
th: ใช้ 100 g
vi: Dùng 100g

# aiAnalyzedResult
source: AI: "{name}" → {calories} kcal
es: IA: "{name}" → {calories} kcal
fr: IA : "{name}" → {calories} kcal
hi: एआई: "{name}" → {calories} kcal
pt: IA: "{name}" → {calories} kcal

source: Unable to analyze
de: Analyse nicht möglich
es: No se puede analizar
fr: Impossible d'analyser
hi: विश्लेषण करने में असमर्थ
id: Tidak dapat menganalisis
pt: Não é possível analisar
th: ไม่สามารถวิเคราะห์ได้
vi: Không thể phân tích

source: Today
de: Heute
es: Hoy
fr: Aujourd'hui
hi: आज
id: Hari ini
pt: Hoje
th: วันนี้
vi: Hôm nay

source: ✅ Saved successfully
de: ✅ Erfolgreich gespeichert
es: ✅ Guardado exitosamente
fr: ✅ Enregistré avec succès
hi: ✅ सफलतापूर्वक सहेजा गया
id: ✅ Berhasil disimpan
pt: ✅ Salvo com sucesso
th: ✅ บันทึกสำเร็จ
vi: ✅ Lưu thành công

source: Confirm Food Photo
de: Bestätigen Sie das Lebensmittelfoto
es: Confirmar foto de comida
fr: Confirmer la photo de la nourriture
hi: भोजन की पुष्टि करें फोटो
id: Konfirmasi Foto Makanan
pt: Confirme a foto da comida
th: ยืนยันรูปอาหาร
vi: Xác nhận ảnh món ăn

source: Photo saved automatically
de: Foto automatisch gespeichert
es: Foto guardada automáticamente
fr: Photo enregistrée automatiquement
hi: फ़ोटो स्वचालित रूप से सहेजी गई
id: Foto disimpan secara otomatis
pt: Foto salva automaticamente
th: บันทึกรูปอัตโนมัติ
vi: Ảnh được lưu tự động

# foodNameHintExample
source: e.g., Grilled chicken salad
de: z. B. gegrillter Hühnersalat
es: por ejemplo, ensalada de pollo a la parrilla
fr: par exemple, salade de poulet grillé
hi: उदाहरण के लिए, ग्रिल्ड चिकन सलाद
id: misalnya, salad ayam panggang
pt: por exemplo, salada de frango grelhado
th: เช่น สลัดไก่ย่าง
vi: ví dụ: salad gà nướng

# quantityLabel
source: Quantity
de: Menge
es: Cantidad
fr: Quantité
hi: मात्रा
id: Kuantitas
pt: Quantidade
th: ปริมาณ
vi: Số lượng

# optionalFoodInfo
source: Entering the food name and quantity is optional, but providing them will improve AI analysis accuracy.
de: Die Eingabe des Namens und der Menge des Lebensmittels ist optional, die Angabe dieser Angaben erhöht jedoch die Genauigkeit der KI-Analyse.
es: Ingresar el nombre y la cantidad del alimento es opcional, pero proporcionarlos mejorará la precisión del análisis de IA.
fr: La saisie du nom et de la quantité de l'aliment est facultative, mais leur fourniture améliorera la précision de l'analyse de l'IA.
hi: भोजन का नाम और मात्रा दर्ज करना वैकल्पिक है, लेकिन उन्हें प्रदान करने से एआई विश्लेषण सटीकता में सुधार होगा।
id: Memasukkan nama dan kuantitas makanan bersifat opsional, namun memasukkannya akan meningkatkan akurasi analisis AI.
pt: Inserir o nome e a quantidade do alimento é opcional, mas fornecê-los melhorará a precisão da análise de IA.
th: การกรอกชื่ออาหารและปริมาณเป็นทางเลือก แต่การให้ข้อมูลจะช่วยให้การวิเคราะห์ AI แม่นยำขึ้น
vi: Việc nhập tên và số lượng thực phẩm là tùy chọn, nhưng việc cung cấp chúng sẽ cải thiện độ chính xác của phân tích AI.

source: Save only
de: Nur speichern
es: Guardar solo
fr: Enregistrer uniquement
hi: केवल सहेजें
id: Simpan saja
pt: Salvar apenas
th: บันทึกเท่านั้น
vi: Chỉ lưu

# pleaseEnterValidQuantity
source: Please enter a valid quantity
de: Bitte geben Sie eine gültige Menge ein
es: Por favor introduce una cantidad válida
fr: Veuillez entrer une quantité valide
hi: कृपया एक वैध मात्रा दर्ज करें
id: Silakan masukkan jumlah yang valid
pt: Insira uma quantidade válida
th: กรุณากรอกปริมาณที่ถูกต้อง
vi: Vui lòng nhập số lượng hợp lệ

# analyzedResult
source: ✅ Analyzed: {name} — {calories} kcal
de: ✅ Analysiert: {name} — {calories} kcal
es: ✅ Analizado: {name} — {calories} kcal
fr: ✅ Analysé : {name} — {calories} kcal
hi: ✅ विश्लेषण किया गया: {name} — {calories} kcal
id: ✅ Dianalisis: {name} — {calories} kcal
pt: ✅ Analisado: {name} — {calories} kcal
th: ✅ วิเคราะห์: {name} — {calories} kcal
vi: ✅ Đã phân tích: {name} — {calories} kcal

# couldNotAnalyzeSaved
source: ⚠️ Could not analyze — saved, use "Analyze All" later
de: ⚠️ Analyse konnte nicht durchgeführt werden – gespeichert, verwenden Sie später „Alle analysieren“.
es: ⚠️ No se pudo analizar: guardado, use "Analizar todo" más tarde
fr: ⚠️ Analyse impossible — enregistré, utilisez « Tout analyser » plus tard
hi: ⚠️ विश्लेषण नहीं किया जा सका - सहेजा गया, बाद में "सभी का विश्लेषण करें" का उपयोग करें
id: ⚠️ Tidak dapat menganalisis — disimpan, gunakan "Analisis Semua" nanti
pt: ⚠️ Não foi possível analisar — ​​salvo, use "Analisar tudo" mais tarde
th: ⚠️ ไม่สามารถวิเคราะห์ได้ — บันทึกแล้ว ใช้ "วิเคราะห์ทั้งหมด" ทีหลัง
vi: ⚠️ Không thể phân tích - đã lưu, sử dụng "Phân tích tất cả" sau

# savedAnalyzeLater
source: ✅ Saved — analyze later with "Analyze All"
de: ✅ Gespeichert – später mit „Alle analysieren“ analysieren
es: ✅ Guardado: analiza más tarde con "Analizar todo"
fr: ✅ Enregistré - analysez plus tard avec "Analyser tout"
hi: ✅ सहेजा गया - बाद में "सभी का विश्लेषण करें" के साथ विश्लेषण करें
id: ✅ Tersimpan - analisis nanti dengan "Analisis Semua"
pt: ✅ Salvo — analise mais tarde com "Analisar tudo"
th: ✅ บันทึกแล้ว — วิเคราะห์ทีหลังด้วย "วิเคราะห์ทั้งหมด"
vi: ✅ Đã lưu — phân tích sau với "Phân tích tất cả"

# editIngredientTitle
source: Edit Ingredient
de: Zutat bearbeiten
es: Editar ingrediente
fr: Modifier l'ingrédient
hi: घटक संपादित करें
id: Sunting Bahan
pt: Editar ingrediente
th: แก้ไขวัตถุดิบ
vi: Chỉnh sửa thành phần

# ingredientNameRequired
source: Ingredient Name *
de: Name der Zutat *
es: Nombre del ingrediente *
fr: Nom de l'ingrédient *
hi: संघटक का नाम*
id: Nama Bahan *
pt: Nome do Ingrediente *
th: ชื่อวัตถุดิบ *
vi: Tên thành phần *

# baseAmountLabel
source: Base Amount
de: Grundbetrag
es: Monto base
fr: Montant de base
hi: आधार राशि
id: Jumlah Dasar
pt: Valor base
th: ปริมาณฐาน
vi: Số tiền cơ bản

# nutritionPerBase
source: Nutrition per {amount} {unit}
de: Ernährung pro {amount} {unit}
es: Nutrición por {amount} {unit}
fr: Nutrition par {amount} {unit}
hi: पोषण प्रति {amount} {unit}
id: Nutrisi per {amount} {unit}
pt: Nutrição por {amount} {unit}
th: โภชนาการต่อ {amount} {unit}
vi: Dinh dưỡng trên {amount} {unit}

# nutritionCalculatedPerBase
source: Nutrition calculated per {amount} {unit} — system will auto-calculate based on actual amount consumed
de: Der Nährwert wird pro {amount} {unit} berechnet – das System berechnet automatisch basierend auf der tatsächlich verbrauchten Menge
es: Nutrición calculada por {amount} {unit}: el sistema calculará automáticamente en función de la cantidad real consumida
fr: Nutrition calculée par {amount} {unit} — le système calculera automatiquement en fonction de la quantité réelle consommée
hi: पोषण की गणना प्रति {amount} {unit} - प्रणाली खपत की गई वास्तविक मात्रा के आधार पर स्वतः गणना करेगी
id: Nutrisi dihitung per {amount} {unit} — sistem akan menghitung secara otomatis berdasarkan jumlah aktual yang dikonsumsi
pt: Nutrição calculada por {amount} {unit} — o sistema calculará automaticamente com base na quantidade real consumida
th: โภชนาการคำนวณต่อ {amount} {unit} — ระบบจะคำนวณอัตโนมัติตามปริมาณที่บริโภคจริง
vi: Dinh dưỡng được tính trên {amount} {unit} — hệ thống sẽ tự động tính toán dựa trên lượng tiêu thụ thực tế

source: Create Ingredient
de: Zutat erstellen
es: Crear ingrediente
fr: Créer un ingrédient
hi: घटक बनाएँ
id: Buat Bahan
pt: Criar ingrediente
th: สร้างวัตถุดิบ
vi: Tạo thành phần

source: Save Changes
fr: Enregistrer les modifications
hi: परिवर्तनों को सुरक्षित करें
id: Simpan Perubahan
th: บันทึก

source: Please enter ingredient name first
de: Bitte geben Sie zuerst den Namen der Zutat ein
es: Por favor ingrese primero el nombre del ingrediente
fr: Veuillez d'abord entrer le nom de l'ingrédient
hi: कृपया पहले घटक का नाम दर्ज करें
id: Silakan masukkan nama bahan terlebih dahulu
pt: Por favor, insira o nome do ingrediente primeiro
th: กรุณากรอกชื่อวัตถุดิบก่อน
vi: Vui lòng nhập tên thành phần trước

# aiAnalyzedIngredient
source: AI: "{name}" {amount} {unit} → {calories} kcal
es: IA: "{name}" {amount} {unit} → {calories} kcal
fr: IA : "{name}" {amount} {unit} → {calories} kcal
hi: एआई: "{name}" {amount} {unit} → {calories} kcal
pt: IA: "{name}" {amount} {unit} → {calories} kcal

# unableToFindIngredient
source: Unable to find this ingredient
de: Diese Zutat konnte nicht gefunden werden
es: No se puede encontrar este ingrediente
fr: Impossible de trouver cet ingrédient
hi: यह घटक ढूंढने में असमर्थ
id: Tidak dapat menemukan bahan ini
pt: Não foi possível encontrar este ingrediente
th: ไม่พบวัตถุดิบนี้
vi: Không thể tìm thấy thành phần này

# searchFailed
source: Search failed: {error}
de: Suche fehlgeschlagen: {error}
es: La búsqueda falló: {error}
fr: Échec de la recherche : {error}
hi: खोज विफल: {error}
id: Pencarian gagal: {error}
pt: Falha na pesquisa: {error}
th: ค้นหาล้มเหลว: {error}
vi: Tìm kiếm không thành công: {error}

# deleteEntriesTitle
source: Delete {count} {count, plural, =1 {Entry} other {Entries}}?
de: {count} {count, plural, =1 {Entry} other {Entries}} löschen?
es: ¿Eliminar {count} {count, plural, =1 {Entry} other {Entries}}?
fr: Supprimer {count} {count, plural, =1 {Entry} other {Entries}} ?
hi: {count} {count, plural, =1 {Entry} other {Entries}} हटाएं?
id: Hapus {count} {count, plural, =1 {Entry} other {Entries}}?
pt: Excluir {count} {count, plural, =1 {Entry} other {Entries}}?
th: ลบ {count} รายการ?
vi: Xóa {count} {count, plural, =1 {Entry} other {Entries}} khác?

# deleteEntriesMessage
source: Delete {count} selected food {count, plural, =1 {entry} other {entries}}?
de: {count} ausgewähltes Lebensmittel {count, plural, =1 {entry} other {entries}} löschen?
es: ¿Eliminar {count} alimento seleccionado {count, plural, =1 {entry} other {entries}}?
fr: Supprimer {count} aliment sélectionné {count, plural, =1 {entry} other {entries}} ?
hi: {count} चयनित भोजन {count, plural, =1 {entry} other {entries}} हटाएं?
id: Hapus {count} makanan yang dipilih {count, plural, =1 {entry} other {entries}}?
pt: Excluir {count} alimento selecionado {count, plural, =1 {entry} other {entries}}?
th: ลบรายการอาหารที่เลือก {count} รายการ?
vi: Xóa {count} thực phẩm đã chọn {count, plural, =1 {entry} other {entries}}?

source: Delete All
de: Alle löschen
es: Eliminar todo
fr: Supprimer tout
hi: सभी हटा दो
id: Hapus Semua
pt: Excluir tudo
th: ลบทั้งหมด
vi: Xóa tất cả

# deletedEntries
source: Deleted {count} {count, plural, =1 {entry} other {entries}}
de: Gelöscht {count} {count, plural, =1 {entry} other {entries}}
es: Eliminado {count} {count, plural, =1 {entry} other {entries}}
fr: Supprimé {count} {count, plural, =1 {entry} other {entries}}
hi: हटाया गया {count} {count, plural, =1 {entry} other {entries}}
id: Dihapus {count} {count, plural, =1 {entry} other {entries}}
pt: Excluído {count} {count, plural, =1 {entry} other {entries}}
th: ลบ {count} รายการแล้ว
vi: Đã xóa {count} {count, plural, =1 {entry} other {entries}}
