Repository: lnxelnope/miro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, pt, th, vi

# movedEntriesToDate
source: Moved {count} {count, plural, =1 {entry} other {entries}} to {date}
de: {count} {count, plural, =1 {entry} other {entries}} nach {date} verschoben
es: Se movió {count} {count, plural, =1 {entry} other {entries}} a {date}
fr: Déplacé {count} {count, plural, =1 {entry} other {entries}} vers {date}
hi: {count} {count, plural, =1 {entry} other {entries}} को {date} में ले जाया गया
id: Memindahkan {count} {count, plural, =1 {entry} other {entries}} ke {date}
pt: Movido {count} {count, plural, =1 {entry} other {entries}} para {date}
th: ย้าย {count} รายการไป {date}
vi: Đã chuyển {count} {count, plural, =1 {entry} other {entries}} sang {date}

# allSelectedAlreadyAnalyzed
source: All selected entries are already analyzed
de: Alle ausgewählten Einträge sind bereits analysiert
es: Todas las entradas seleccionadas ya están analizadas
fr: Toutes les entrées sélectionnées sont déjà analysées
hi: सभी चयनित प्रविष्टियों का विश्लेषण पहले ही किया जा चुका है
id: Semua entri yang dipilih sudah dianalisis
pt: Todas as entradas selecionadas já foram analisadas
th: รายการที่เลือกทั้งหมดถูกวิเคราะห์แล้ว
vi: Tất cả các mục đã chọn đã được phân tích

# analyzeCancelledSelected
source: Cancelled — {success} analyzed
de: Abgebrochen – {success} analysiert
es: Cancelado - {success} analizado
fr: Annulé — {success} analysé
hi: रद्द किया गया - {success} का विश्लेषण किया गया
id: Dibatalkan — {success} dianalisis
pt: Cancelado — {success} analisado
th: ยกเลิกแล้ว — วิเคราะห์สำเร็จ {success} รายการ
vi: Đã hủy — {success} đã phân tích

# analyzedEntriesAll
source: Analyzed {success} {success, plural, =1 {entry} other {entries}}
de: Analysiert {success} {success, plural, =1 {entry} other {entries}}
es: Analizado {success} {success, plural, =1 {entry} other {entries}}
fr: Analysé {success} {success, plural, =1 {entry} other {entries}}
hi: विश्लेषण किया गया {success} {success, plural, =1 {entry} other {entries}}
id: Menganalisis {success} {success, plural, =1 {entry} other {entries}}
pt: Analisado {success} {success, plural, =1 {entry} other {entries}}
th: วิเคราะห์สำเร็จ {success} รายการ
vi: Đã phân tích {success} {success, plural, =1 {entry} other {entries}}

# analyzedEntriesPartial
source: Analyzed {success}/{total} ({failed} failed)
de: Analysiert {success}/{total} ({failed} fehlgeschlagen)
es: Analizado {success}/{total} ({failed} falló)
fr: Analysé {success}/{total} ({failed} a échoué)
hi: विश्लेषण किया गया {success}/{total} ({failed} विफल)
id: Menganalisis {success}/{total} ({failed} gagal)
pt: Analisado {success}/{total} ({failed} falhou)
th: วิเคราะห์สำเร็จ {success}/{total} ({failed} ล้มเหลว)
vi: Đã phân tích {success}/{total} ({failed} không thành công)

source: No entries yet
de: Noch keine Einträge
es: Aún no hay entradas
fr: Aucune entrée pour l'instant
hi: अभी तक कोई प्रविष्टि नहीं
id: Belum ada entri
pt: Nenhuma entrada ainda
th: ยังไม่มีรายการ
vi: Chưa có mục nào

source: Select all
de: Alles auswählen
es: Seleccionar todo
fr: Tout sélectionner
hi: सबका चयन करें
id: Pilih semua
pt: Selecionar tudo
th: เลือกทั้งหมด
vi: Chọn tất cả

source: Deselect all
de: Alle abwählen
es: Deseleccionar todo
fr: Tout désélectionner
hi: सबको अचयनित करो
id: Batalkan pilihan semua
pt: Desmarcar tudo
th: ยกเลิกการเลือกทั้งหมด
vi: Bỏ chọn tất cả

source: Move to date
de: Auf den neuesten Stand verschieben
es: Mover a la fecha
fr: Déplacer à ce jour
hi: तिथि पर जाएँ
id: Pindah ke tanggal
pt: Mover para a data
th: ย้ายไปวันที่
vi: Chuyển đến ngày

source: Analyze selected
de: Analyze
es: Analyze
fr: Analyser la sélection
hi: चयनित विश्लेषण करें
id: Analisis yang dipilih
pt: Analyze
th: วิเคราะห์
vi: Analyze

# deleteTooltip
source: Delete
de: Löschen
es: Borrar
fr: Supprimer
hi: मिटाना
id: Menghapus
pt: Excluir
th: ลบ
vi: Xóa bỏ

source: Move
de: Bewegen
es: Mover
fr: Se déplacer
hi: कदम
id: Bergerak
pt: Mover
th: ย้าย
vi: Di chuyển

# deleteTooltipAction
source: Delete
de: Löschen
es: Borrar
fr: Supprimer
hi: मिटाना
id: Menghapus
pt: Excluir
th: ลบ
vi: Xóa bỏ

# switchToModeTitle
source: Switch to {mode} mode?
de: In den {mode}-Modus wechseln?
es: ¿Cambiar al modo {mode}?
fr: Passer en mode {mode} ?
hi: {mode} मोड पर स्विच करें?
id: Beralih ke mode {mode}?
pt: Mudar para o modo {mode}?
th: เปลี่ยนเป็นโหมด {mode}?
vi: Chuyển sang chế độ {mode}?

# switchToModeMessage
source: This item was analyzed as {current}. Re-analyzing as {newMode} will use 1 Energy. Continue?
de: Dieses Element wurde als {current} analysiert. Eine erneute Analyse als {newMode} wird 1 Energie verbrauchen. Weitermachen?
es: Este elemento fue analizado como {current}. Volver a analizar como {newMode} utilizará 1 energía. ¿Continuar?
fr: Cet élément a été analysé comme {current}. Une nouvelle analyse en tant que {newMode} utilisera 1 énergie. Continuer?
hi: इस आइटम का विश्लेषण {current} के रूप में किया गया था। {newMode} के रूप में पुनः विश्लेषण करने पर 1 ऊर्जा का उपयोग होगा। जारी रखना?
id: Item ini dianalisis sebagai {current}. Menganalisis ulang sebagai {newMode} akan menggunakan 1 Energi. Melanjutkan?
pt: Este item foi analisado como {current}. Reanalisar como {newMode} usará 1 energia. Continuar?
th: รายการนี้ถูกวิเคราะห์เป็น {current} การวิเคราะห์ใหม่เป็น {newMode} จะใช้ 1 Energy ดำเนินการต่อ?
vi: Mục này được phân tích là {current}. Phân tích lại thành {newMode} sẽ tiêu tốn 1 Năng lượng. Tiếp tục?

source: Analyzing as {mode}...
de: Analysiert als {mode}...
es: Analizando como {mode}...
fr: Analyse comme {mode}...
hi: {mode} के रूप में विश्लेषण किया जा रहा है...
id: Menganalisis sebagai {mode}...
pt: Analisando como {mode}...
th: กำลังวิเคราะห์เป็น {mode}...
vi: Đang phân tích dưới dạng {mode}...

source: ✅ Re-analyzed as {mode}
de: ✅ Neu analysiert als {mode}
es: ✅ Reanalizado como {mode}
fr: ✅ Ré-analysé comme {mode}
hi: ✅ {mode} के रूप में पुनः विश्लेषण किया गया
id: ✅ Dianalisis ulang sebagai {mode}
pt: ✅ Reanalisado como {mode}
th: ✅ วิเคราะห์ใหม่เป็น {mode} แล้ว
vi: ✅ Phân tích lại thành {mode}

source: ❌ Analysis failed
de: ❌ Analyse fehlgeschlagen
es: ❌ El análisis falló
fr: ❌ L'analyse a échoué
hi: ❌ विश्लेषण विफल रहा
id: ❌ Analisis gagal
pt: ❌ Falha na análise
th: ❌ วิเคราะห์ล้มเหลว
vi: ❌ Phân tích thất bại

# aiAnalysisComplete
source: ✅ AI analyzed and saved
de: ✅ KI analysiert und gespeichert
es: ✅ IA analizada y guardada
fr: ✅ IA analysée et enregistrée
hi: ✅ AI ने विश्लेषण किया और सहेजा
id: ✅ AI dianalisis dan disimpan
pt: ✅ IA analisada e salva
th: ✅ วิเคราะห์และบันทึกแล้ว
vi: ✅ AI phân tích và lưu trữ

source: Change Meal Type
de: Ändern Sie die Art der Mahlzeit
es: Cambiar tipo de comida
fr: Changer le type de repas
hi: भोजन का प्रकार बदलें
id: Ubah Jenis Makanan
pt: Alterar tipo de refeição
th: เปลี่ยนประเภทมื้อ
vi: Thay đổi loại bữa ăn

source: Move to Another Date
de: Zu einem anderen Datum verschieben
es: Pasar a otra fecha
fr: Déplacer à une autre date
hi: किसी अन्य तिथि पर जाएँ
id: Pindah ke Tanggal Lain
pt: Mudar para outra data
th: ย้ายไปวันที่อื่น
vi: Chuyển sang ngày khác

source: Current: {date}
de: Aktuell: {date}
es: Actual: {date}
fr: Actuel : {date}
hi: वर्तमान: {date}
id: Saat ini: {date}
pt: Atual: {date}
th: ปัจจุบัน: {date}
vi: Hiện tại: {date}

source: Cancel Date Change
de: Datumsänderung abbrechen
es: Cancelar cambio de fecha
fr: Annuler le changement de date
hi: दिनांक परिवर्तन रद्द करें
id: Batalkan Perubahan Tanggal
pt: Cancelar alteração de data
th: ยกเลิกการเปลี่ยนวันที่
vi: Hủy thay đổi ngày

source: Undo
de: Rückgängig machen
es: Deshacer
fr: Défaire
hi: पूर्ववत
id: Membuka
pt: Desfazer
th: ยกเลิก
vi: Hoàn tác

source: Chat History
de: Chat-Verlauf
es: Historial de chat
fr: Historique des discussions
hi: चैट का इतिहास
id: Riwayat Obrolan
pt: Histórico de bate-papo
th: ประวัติการแชท
vi: Lịch sử trò chuyện

source: New chat
de: Neuer Chat
es: Nuevo chat
fr: Nouvelle discussion
hi: नई चैट
id: Obrolan baru
pt: Novo bate-papo
th: แชทใหม่
vi: Trò chuyện mới

source: Quick Actions
de: Schnelle Aktionen
es: Acciones Rápidas
fr: Actions rapides
hi: त्वरित कार्रवाई
id: Tindakan Cepat
pt: Ações rápidas
th: การกระทำด่วน
vi: Thao tác nhanh

source: Clear
de: Klar
es: Claro
fr: Clair
hi: स्पष्ट
id: Jernih
pt: Claro
th: ล้าง
vi: Thông thoáng

source: Hello! I'm Miro
de: Hallo! Ich bin Miro
es: ¡Hola! Soy Miro
fr: Bonjour! Je m'appelle Miro
hi: नमस्ते! मैं Miro हूं
id: Halo! saya Miro
pt: Olá! Eu sou Miro
th: สวัสดี! ผมคือ Miro
vi: Xin chào! Tôi là Miro

source: Tell me what you ate today!
de: Sag mir, was du heute gegessen hast!
es: ¡Cuéntame qué comiste hoy!
fr: Dis-moi ce que tu as mangé aujourd'hui !
hi: मुझे बताओ तुमने आज क्या खाया!
id: Katakan padaku apa yang kamu makan hari ini!
pt: Me conta o que você comeu hoje!
th: บอกผมว่าคุณกินอะไรวันนี้!
vi: Hãy cho tôi biết hôm nay bạn đã ăn gì!

source: Tell me what you ate...
de: Sag mir, was du gegessen hast...
es: Dime que comiste...
fr: Dis-moi ce que tu as mangé...
hi: बताओ तुमने क्या खाया...
id: Katakan padaku apa yang kamu makan...
pt: Me conta o que você comeu...
th: บอกผมว่าคุณกินอะไร...
vi: Hãy cho tôi biết bạn đã ăn gì...

# clearHistoryTitle
source: Clear history?
de: Verlauf löschen?
es: ¿Borrar historial?
fr: Effacer l'historique ?
hi: इतिहास मिटा दें?
id: Hapus riwayat?
pt: Limpar histórico?
th: ล้างประวัติ?
vi: Xóa lịch sử?

# clearHistoryMessage
source: All messages in this session will be deleted.
de: Alle Nachrichten in dieser Sitzung werden gelöscht.
es: Todos los mensajes de esta sesión serán eliminados.
fr: Tous les messages de cette session seront supprimés.
hi: इस सत्र के सभी संदेश हटा दिए जाएंगे.
id: Semua pesan di sesi ini akan dihapus.
pt: Todas as mensagens nesta sessão serão excluídas.
th: ข้อความทั้งหมดในเซสชันนี้จะถูกลบ
vi: Tất cả tin nhắn trong phiên này sẽ bị xóa.

# chatHistoryTitle
source: Chat History
de: Chat-Verlauf
es: Historial de chat
fr: Historique des discussions
hi: चैट का इतिहास
id: Riwayat Obrolan
pt: Histórico de bate-papo
th: ประวัติการแชท
vi: Lịch sử trò chuyện

# newLabel
source: New
de: Neu
es: Nuevo
fr: Nouveau
hi: नया
id: Baru
pt: Novo
th: ใหม่
vi: Mới

source: No chat history yet
de: Noch kein Chatverlauf
es: Aún no hay historial de chat
fr: Pas encore d'historique de discussion
hi: अभी तक कोई चैट इतिहास नहीं है
id: Belum ada riwayat obrolan
pt: Ainda não há histórico de bate-papo
th: ยังไม่มีประวัติการแชท
vi: Chưa có lịch sử trò chuyện

source: Active
de: Aktiv
es: Activo
fr: Actif
hi: सक्रिय
id: Aktif
pt: Ativo
th: ใช้งานอยู่
vi: Tích cực

# deleteChatTitle
source: Delete chat?
de: Chat löschen?
es: ¿Eliminar chat?
fr: Supprimer le chat ?
hi: चैट हटाएं?
id: Hapus obrolan?
pt: Excluir bate-papo?
th: ลบแชท?
vi: Xóa cuộc trò chuyện?

# deleteChatMessage
source: Delete "{title}"?
de: „{title}“ löschen?
es: ¿Eliminar "{title}"?
fr: Supprimer "{title}" ?
hi: "{title}" हटाएं?
id: Hapus "{title}"?
pt: Excluir "{title}"?
th: ลบ "{title}"?
vi: Xóa "{title}"?

# weeklySummaryTitle
source: 📊 Weekly Summary ({start} - {end})
de: 📊 Wöchentliche Zusammenfassung ({start} - {end})
es: 📊 Resumen semanal ({start} - {end})
fr: 📊 Résumé hebdomadaire ({start} - {end})
hi: 📊 साप्ताहिक सारांश ({start} - {end})
id: 📊 Ringkasan Mingguan ({start} - {end})
pt: 📊 Resumo semanal ({start} - {end})
th: สรุปรายสัปดาห์ ({start} - {end})
vi: 📊 Tổng hợp hàng tuần ({start} - {end})

# overTarget
source: {amount} over target
de: {amount} über dem Ziel
es: {amount} sobre el objetivo
fr: {amount} au-dessus de l'objectif
hi: {amount} लक्ष्य से अधिक
id: {amount} melebihi target
pt: {amount} acima do alvo
th: {amount} เกินเป้าหมาย
vi: {amount} vượt mục tiêu

# underTarget
source: {amount} under target
de: {amount} unter Ziel
es: {amount} por debajo del objetivo
fr: {amount} sous l'objectif
hi: {amount} लक्ष्य के अंतर्गत
id: {amount} di bawah target
pt: {amount} abaixo do alvo
th: {amount} ต่ำกว่าเป้าหมาย
vi: {amount} dưới mục tiêu

# noFoodLoggedThisWeek
source: No food logged this week yet.
de: Diese Woche wurden noch keine Lebensmittel protokolliert.
es: Aún no se han registrado alimentos esta semana.
fr: Aucun aliment n'a encore été enregistré cette semaine.
hi: इस सप्ताह अभी तक कोई भोजन लॉग नहीं हुआ है।
id: Belum ada makanan yang dicatat minggu ini.
pt: Nenhum alimento registrado esta semana ainda.
th: ยังไม่มีอาหารบันทึกในสัปดาห์นี้
vi: Chưa có món ăn nào được ghi lại trong tuần này.

# averageKcalPerDay
source: 🔥 Average: {average} kcal/day
de: 🔥 Durchschnitt: {average} kcal/Tag
es: 🔥 Promedio: {average} kcal/día
fr: 🔥 Moyenne : {average} kcal/jour
hi: 🔥 औसत: {average} kcal/दिन
id: 🔥 Rata-rata: {average} kcal/hari
pt: 🔥 Média: {average} kcal/dia
th: ค่าเฉลี่ย: {average} kcal/วัน
vi: 🔥 Trung bình: {average} kcal/ngày

# targetKcalPerDay
source: 🎯 Target: {target} kcal/day
de: 🎯 Ziel: {target} kcal/Tag
es: 🎯 Objetivo: {target} kcal/día
fr: 🎯 Objectif : {target} kcal/jour
hi: 🎯 लक्ष्य: {target} kcal/दिन
id: 🎯 Target: {target} kcal/hari
pt: 🎯 Meta: {target} kcal/dia
th: เป้าหมาย: {target} kcal/วัน
vi: 🎯 Mục tiêu: {target} kcal/ngày

# resultOverTarget
source: 📈 Result: {amount} kcal over target
de: 📈 Ergebnis: {amount} kcal über dem Ziel
es: 📈 Resultado: {amount} kcal sobre el objetivo
fr: 📈 Résultat : {amount} kcal au-dessus de l'objectif
hi: 📈 परिणाम: {amount} kcal लक्ष्य से अधिक
id: 📈 Hasil: {amount} kcal melebihi target
pt: 📈 Resultado: {amount} kcal acima da meta
th: ผลลัพธ์: {amount} kcal เกินเป้าหมาย
vi: 📈 Kết quả: {amount} kcal vượt mục tiêu

# resultUnderTarget
source: 📈 Result: {amount} kcal under target — Great job! 💪
de: 📈 Ergebnis: {amount} kcal unter Ziel – Tolle Arbeit! 💪
es: 📈 Resultado: {amount} kcal por debajo del objetivo - ¡Excelente trabajo! 💪
fr: 📈 Résultat : {amount} kcal sous l'objectif — Excellent travail ! 💪
hi: 📈 परिणाम: {amount} kcal लक्ष्य के अंतर्गत - बढ़िया काम! 💪
id: 📈 Hasil: {amount} kcal di bawah target — Kerja bagus! 💪
pt: 📈 Resultado: {amount} kcal abaixo da meta - Ótimo trabalho! 💪
th: ผลลัพธ์: {amount} kcal ต่ำกว่าเป้าหมาย — ทำได้ดีมาก! 💪
vi: 📈 Kết quả: {amount} kcal dưới mục tiêu — Làm tốt lắm! 💪

# failedToLoadWeeklySummary
source: ❌ Failed to load weekly summary: {error}
de: ❌ Die wöchentliche Zusammenfassung konnte nicht geladen werden: {error}
es: ❌ No se pudo cargar el resumen semanal: {error}
fr: ❌ Échec du chargement du résumé hebdomadaire : {error}
hi: ❌ साप्ताहिक सारांश लोड करने में विफल: {error}
id: ❌ Gagal memuat ringkasan mingguan: {error}
pt: ❌ Falha ao carregar o resumo semanal: {error}
th: ❌ โหลดสรุปรายสัปดาห์ล้มเหลว: {error}
vi: ❌ Không tải được tóm tắt hàng tuần: {error}

# monthlySummaryTitle
source: 📊 Monthly Summary ({month} {year})
de: 📊 Monatliche Zusammenfassung ({month} {year})
es: 📊 Resumen mensual ({month} {year})
fr: 📊 Résumé mensuel ({month} {year})
hi: 📊 मासिक सारांश ({month} {year})
id: 📊 Ringkasan Bulanan ({month} {year})
pt: 📊 Resumo Mensal ({month} {year})
th: สรุปรายเดือน ({month} {year})
vi: 📊 Tóm tắt hàng tháng ({month} {year})

# totalDays
source: 📅 Total Days: {days}
de: 📅 Gesamttage: {days}
es: 📅 Días totales: {days}
fr: 📅 Nombre total de jours : {days}
hi: 📅 कुल दिन: {days}
id: 📅 Jumlah Hari: {days}
pt: 📅 Total de dias: {days}
th: จำนวนวันทั้งหมด: {days}
vi: 📅 Tổng số ngày: {days}

# totalConsumed
source: 🔥 Total Consumed: {calories} kcal
de: 🔥 Gesamtverbrauch: {calories} kcal
es: 🔥 Total consumido: {calories} kcal
fr: 🔥 Total consommé : {calories} kcal
hi: 🔥 कुल खपत: {calories} kcal
id: 🔥 Jumlah yang Dikonsumsi: {calories} kcal
pt: 🔥 Total Consumido: {calories} kcal
th: บริโภคทั้งหมด: {calories} kcal
vi: 🔥 Tổng lượng tiêu thụ: {calories} kcal

# targetTotal
source: 🎯 Target Total: {target} kcal
de: 🎯 Gesamtziel: {target} kcal
es: 🎯 Total objetivo: {target} kcal
fr: 🎯 Total cible : {target} kcal
hi: 🎯 कुल लक्ष्य: {target} kcal
id: 🎯 Jumlah Sasaran: {target} kcal
pt: 🎯 Meta Total: {target} kcal
th: เป้าหมายรวม: {target} kcal
vi: 🎯 Tổng mục tiêu: {target} kcal

# averageKcalPerDayShort
source: 📈 Average: {average} kcal/day
de: 📈 Durchschnitt: {average} kcal/Tag
es: 📈 Promedio: {average} kcal/día
fr: 📈 Moyenne : {average} kcal/jour
hi: 📈 औसत: {average} kcal/दिन
id: 📈 Rata-rata: {average} kcal/hari
pt: 📈 Média: {average} kcal/dia
th: ค่าเฉลี่ย: {average} kcal/วัน
vi: 📈 Trung bình: {average} kcal/ngày

# overTargetThisMonth
source: ⚠️ {amount} kcal over target this month
de: ⚠️ {amount} kcal über dem Ziel diesen Monat
es: ⚠️ {amount} kcal superó el objetivo este mes
fr: ⚠️ {amount} kcal au-dessus de l'objectif ce mois-ci
hi: ⚠️ {amount} kcal इस माह लक्ष्य से अधिक
id: ⚠️ {amount} kcal melebihi target bulan ini
pt: ⚠️ {amount} kcal acima da meta este mês
th: ⚠️ {amount} kcal เกินเป้าหมายในเดือนนี้
vi: ⚠️ {amount} kcal vượt mục tiêu tháng này

# underTargetThisMonth
source: ✅ {amount} kcal under target — Excellent! 💪
de: ✅ {amount} kcal unter Ziel – Ausgezeichnet! 💪
es: ✅ {amount} kcal por debajo del objetivo - ¡Excelente! 💪
fr: ✅ {amount} kcal sous l'objectif — Excellent ! 💪
hi: ✅ {amount} kcal लक्ष्य के अंतर्गत - उत्कृष्ट! 💪
id: ✅ {amount} kcal di bawah target — Luar biasa! 💪
pt: ✅ {amount} kcal abaixo da meta - Excelente! 💪
th: ✅ {amount} kcal ต่ำกว่าเป้าหมาย — ยอดเยี่ยม! 💪
vi: ✅ {amount} kcal dưới mục tiêu — Tuyệt vời! 💪

# failedToLoadMonthlySummary
source: ❌ Failed to load monthly summary: {error}
de: ❌ Monatliche Zusammenfassung konnte nicht geladen werden: {error}
es: ❌ No se pudo cargar el resumen mensual: {error}
fr: ❌ Échec du chargement du résumé mensuel : {error}
hi: ❌ मासिक सारांश लोड करने में विफल: {error}
id: ❌ Gagal memuat ringkasan bulanan: {error}
pt: ❌ Falha ao carregar o resumo mensal: {error}
th: ❌ โหลดสรุปรายเดือนล้มเหลว: {error}
vi: ❌ Không tải được bản tóm tắt hàng tháng: {error}

# localAiHelpTitle
source: 🤖 Local AI Help
de: 🤖 Lokale KI-Hilfe
es: 🤖 Ayuda local de IA
fr: 🤖 Aide IA locale
hi: 🤖 स्थानीय एआई सहायता
id: 🤖 Bantuan AI Lokal
pt: 🤖 Ajuda local de IA
th: 🤖 คำแนะนำ Local AI
vi: 🤖 Trợ giúp AI cục bộ

# localAiHelpFormat
source: Format: [food] [amount] [unit]
de: Format: [Essen] [Menge] [Einheit]
es: Formato: [alimento] [cantidad] [unidad]
fr: Format : [nourriture] [quantité] [unité]
hi: प्रारूप: [भोजन] [राशि] [इकाई]
id: Format: [makanan] [jumlah] [satuan]
pt: Formato: [comida] [quantidade] [unidade]
th: รูปแบบ: [อาหาร] [ปริมาณ] [หน่วย]
vi: Định dạng: [thực phẩm] [số lượng] [đơn vị]

# localAiHelpExamples
source: Examples: • chicken 100g and rice 200g • pizza 2 slices • apple 1 piece, banana 1 piece
de: Beispiele: • Huhn 100 g und Reis 200 g • Pizza 2 Scheiben • Apfel 1 Stück, Banane 1 Stück
es: Ejemplos: • pollo 100 g y arroz 200 g • pizza 2 porciones • manzana 1 pieza, plátano 1 pieza
fr: Exemples : • poulet 100 g et riz 200 g • pizza 2 tranches • pomme 1 morceau, banane 1 morceau
hi: उदाहरण: • चिकन 100 ग्राम और चावल 200 ग्राम • पिज़्ज़ा 2 स्लाइस • सेब 1 टुकड़ा, केला 1 टुकड़ा
id: Contoh: • ayam 100g dan nasi 200g • pizza 2 potong • apel 1 buah, pisang 1 buah
pt: Exemplos: • frango 100g e arroz 200g • pizza 2 fatias • maçã 1 peça, banana 1 peça
th: ตัวอย่าง: • chicken 100g and rice 200g • pizza 2 slices • apple 1 piece, banana 1 piece
vi: Ví dụ: • thịt gà 100g và cơm 200g • pizza 2 lát • táo 1 miếng, chuối 1 miếng

# localAiHelpNote
source: Note: English only, basic parsing Switch to Miro AI for better results!
de: Hinweis: Nur Englisch, einfache Analyse Wechseln Sie zu Miro AI, um bessere Ergebnisse zu erzielen!
es: Nota: solo inglés, análisis básico ¡Cambie a Miro AI para obtener mejores resultados!
fr: Remarque : anglais uniquement, analyse de base Passez à Miro AI pour de meilleurs résultats !
hi: नोट: केवल अंग्रेजी, बुनियादी विश्लेषण बेहतर परिणामों के लिए Miro AI पर स्विच करें!
id: Catatan: Hanya bahasa Inggris, penguraian dasar Beralih ke Miro AI untuk hasil yang lebih baik!
pt: Nota: somente em inglês, análise básica Mude para Miro AI para obter melhores resultados!
th: หมายเหตุ: ภาษาอังกฤษเท่านั้น การแยกคำพื้นฐาน เปลี่ยนไปใช้ Miro AI เพื่อผลลัพธ์ที่ดีกว่า!
vi: Lưu ý: chỉ có tiếng Anh, phân tích cú pháp cơ bản Chuyển sang Miro AI để có kết quả tốt hơn!

# hiNoFoodLogged
source: 🤖 Hi! No food logged yet today. Target: {target} kcal — Ready to start logging? 🍽️
de: 🤖 Hallo! Heute wurde noch kein Futter protokolliert. Ziel: {target} kcal – Bereit, mit der Protokollierung zu beginnen? 🍽️
es: 🤖 ¡Hola! Aún no se ha registrado ningún alimento hoy. Objetivo: {target} kcal: ¿Listo para comenzar a iniciar sesión? 🍽️
fr: 🤖 Salut ! Aucun aliment n'a encore été enregistré aujourd'hui. Cible : {target} kcal — Prêt à commencer la journalisation ? 🍽️
hi: 🤖हाय! आज अभी तक कोई भोजन लॉग नहीं हुआ है। लक्ष्य: {target} kcal — लॉगिंग शुरू करने के लिए तैयार हैं? 🍽️
id: 🤖 Hai! Belum ada makanan yang dicatat hari ini. Target: {target} kcal — Siap memulai logging? 🍽️
pt: 🤖 Olá! Nenhum alimento registrado ainda hoje. Alvo: {target} kcal — Pronto para começar a registrar? 🍽️
th: 🤖 สวัสดี! ยังไม่มีอาหารบันทึกวันนี้ เป้าหมาย: {target} kcal — พร้อมเริ่มบันทึกแล้วหรือยัง? 🍽️
vi: 🤖 Xin chào! Hôm nay chưa có món ăn nào được ghi lại. Mục tiêu: {target} kcal — Sẵn sàng bắt đầu ghi nhật ký chưa? 🍽️

# hiKcalLeft
source: 🤖 Hi! You have {remaining} kcal left for today. Ready to log your meals? 😊
de: 🤖 Hallo! Sie haben für heute noch {remaining} kcal übrig. Sind Sie bereit, Ihre Mahlzeiten zu protokollieren? 😊
es: 🤖 ¡Hola! Te queda {remaining} kcal para hoy. ¿Listo para registrar tus comidas? 😊
fr: 🤖 Salut ! Il vous reste {remaining} kcal pour aujourd'hui. Prêt à enregistrer vos repas ? 😊
hi: 🤖हाय! आपके पास आज के लिए {remaining} kcal शेष है। क्या आप अपना भोजन लॉग करने के लिए तैयार हैं? 😊
id: 🤖 Hai! Anda memiliki {remaining} kcal tersisa untuk hari ini. Siap mencatat makanan Anda? 😊
pt: 🤖 Olá! Você tem {remaining} kcal restante por hoje. Pronto para registrar suas refeições? 😊
th: 🤖 สวัสดี! คุณเหลือ {remaining} kcal สำหรับวันนี้ พร้อมบันทึกมื้ออาหารแล้วหรือยัง? 😊
vi: 🤖 Xin chào! Bạn còn {remaining} kcal cho ngày hôm nay. Sẵn sàng để đăng nhập bữa ăn của bạn? 😊

# hiOverTarget
source: 🤖 Hi! You've consumed {calories} kcal today. {over} kcal over target — Let's keep tracking! 💪
de: 🤖 Hallo! Sie haben heute {calories} kcal verbraucht. {over} __SW0__ über dem Ziel – Bleiben wir dran! 💪
es: 🤖 ¡Hola! Has consumido {calories} kcal hoy. {over} __SW0__ sobre el objetivo: ¡sigamos rastreando! 💪
fr: 🤖 Salut ! Vous avez consommé {calories} kcal aujourd'hui. {over} __SW0__ au-dessus de l'objectif — Continuons à suivre ! 💪
hi: 🤖हाय! आपने आज {calories} kcal का सेवन किया है। {over} __SW0__ लक्ष्य से अधिक - आइए ट्रैकिंग करते रहें! 💪
id: 🤖 Hai! Anda telah mengonsumsi {calories} kcal hari ini. {over} __SW0__ melebihi target — Ayo terus lacak! 💪
pt: 🤖 Olá! Você consumiu {calories} kcal hoje. {over} __SW0__ acima da meta — Vamos continuar acompanhando! 💪
th: 🤖 สวัสดี! คุณบริโภค {calories} kcal วันนี้ {over} kcal เกินเป้าหมาย — มาบันทึกกันต่อ! 💪
vi: 🤖 Xin chào! Bạn đã tiêu thụ {calories} kcal hôm nay. {over} __SW0__ vượt mục tiêu — Hãy tiếp tục theo dõi! 💪

# hiReadyToLog
source: 🤖 Hi! Ready to log your meals? 😊
de: 🤖 Hallo! Sind Sie bereit, Ihre Mahlzeiten zu protokollieren? 😊
es: 🤖 ¡Hola! ¿Listo para registrar tus comidas? 😊
fr: 🤖 Salut ! Prêt à enregistrer vos repas ? 😊
hi: 🤖हाय! क्या आप अपना भोजन लॉग करने के लिए तैयार हैं? 😊
id: 🤖 Hai! Siap mencatat makanan Anda? 😊
pt: 🤖 Olá! Pronto para registrar suas refeições? 😊
th: 🤖 สวัสดี! พร้อมบันทึกมื้ออาหารแล้วหรือยัง? 😊
vi: 🤖 Xin chào! Sẵn sàng để đăng nhập bữa ăn của bạn? 😊

source: Not enough Energy
de: Nicht genug Energie
es: No hay suficiente energía
fr: Pas assez d'énergie
hi: बहुत ज्यादा ऊर्जा नहीं
id: Energi tidak cukup
pt: Energia insuficiente
th: Energy ไม่พอ
vi: Không đủ năng lượng
