Repository: lnxelnope/miro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, pt, th, vi

# mealBudgetBalanced
source: Total {total} kcal = Goal {goal} kcal
de: Gesamt {total} kcal = Ziel {goal} __SW0__
es: Total {total} kcal = Meta {goal} __SW0__
fr: Total {total} kcal = Objectif {goal} __SW0__
hi: कुल {total} kcal = लक्ष्य {goal} __SW0__
id: Jumlah {total} kcal = Sasaran {goal} __SW0__
pt: Total {total} kcal = Meta {goal} __SW0__
th: รวม {total} kcal = เป้าหมาย {goal} kcal
vi: Tổng số {total} kcal = Mục tiêu {goal} __SW0__

# mealBudgetRemaining
source: Total {total} / {goal} kcal ({remaining} remaining)
de: Gesamt {total} / {goal} kcal ({remaining} verbleibend)
es: Total {total} / {goal} kcal ({remaining} restante)
fr: Total {total} / {goal} kcal ({remaining} restant)
hi: कुल {total} / {goal} kcal ({remaining} शेष)
id: Jumlah {total} / {goal} kcal ({remaining} tersisa)
pt: Total {total} / {goal} kcal ({remaining} restante)
th: รวม {total} / {goal} kcal (เหลือ {remaining})
vi: Tổng cộng {total} / {goal} kcal (còn lại {remaining})

# lockMealsHint
source: Lock 3 meals to auto-calculate the 4th
de: Sperren Sie 3 Mahlzeiten, um die vierte automatisch zu berechnen
es: Bloquea 3 comidas para calcular automáticamente la 4ta.
fr: Verrouillez 3 repas pour calculer automatiquement le 4ème
hi: चौथे की स्वतः गणना करने के लिए 3 भोजन लॉक करें
id: Kunci 3 makanan untuk menghitung makanan ke-4 secara otomatis
pt: Bloqueie 3 refeições para calcular automaticamente a 4ª
th: ล็อค 3 มื้อเพื่อคำนวณมื้อที่ 4 อัตโนมัติ
vi: Khóa 3 bữa để tự động tính ngày thứ 4

# breakfastLabel
source: Breakfast
de: Frühstück
es: Desayuno
fr: Petit-déjeuner
hi: नाश्ता
id: Sarapan
pt: Café da manhã
th: เช้า
vi: Bữa sáng

# lunchLabel
source: Lunch
de: Mittagessen
es: Almuerzo
fr: Déjeuner
hi: दिन का खाना
id: Makan siang
pt: Almoço
th: กลางวัน
vi: Bữa trưa

# dinnerLabel
source: Dinner
de: Abendessen
es: Cena
fr: Dîner
hi: रात का खाना
id: Makan malam
pt: Jantar
th: เย็น
vi: Bữa tối

# snackLabel
source: Snack
es: Bocadillo
fr: Collation
hi: नाश्ता
id: Camilan
pt: Lanche
th: ของว่าง
vi: Đồ ăn vặt

source: {percent}% of daily goal
de: {percent} % des Tagesziels
es: {percent}% del objetivo diario
fr: {percent} % de l'objectif quotidien
hi: दैनिक लक्ष्य का {percent}%
id: {percent}% dari target harian
pt: {percent}% da meta diária
th: {percent}% ของเป้าหมายรายวัน
vi: {percent}% mục tiêu hàng ngày

source: Smart Suggestion Range
de: Smart-Suggestion-Bereich
es: Rango de sugerencias inteligentes
fr: Gamme de suggestions intelligentes
hi: स्मार्ट सुझाव रेंज
id: Rentang Saran Cerdas
pt: Faixa de sugestões inteligentes
th: ช่วงคำแนะนำอัจฉริยะ
vi: Phạm vi đề xuất thông minh

# smartSuggestionHow
source: How does Smart Suggestion work?
de: Wie funktioniert Smart Suggestion?
es: ¿Cómo funciona la sugerencia inteligente?
fr: Comment fonctionne la suggestion intelligente ?
hi: स्मार्ट सुझाव कैसे काम करता है?
id: Bagaimana cara kerja Saran Cerdas?
pt: Como funciona a Sugestão Inteligente?
th: Smart Suggestion ทำงานอย่างไร?
vi: Đề xuất thông minh hoạt động như thế nào?

# smartSuggestionDesc
source: We suggest foods from your My Meals, ingredients, and yesterday's meals that fit your per-meal budget. This threshold controls how flexible the suggestions are. For example, if your lunch budget is 700 kcal and threshold is {threshold} kcal, we'll suggest foods between {min}–{max} kcal.
de: Wir schlagen Ihnen Lebensmittel aus „Meine Mahlzeiten“, Zutaten und Mahlzeiten von gestern vor, die zu Ihrem Budget pro Mahlzeit passen. Dieser Schwellenwert steuert, wie flexibel die Vorschläge sind. Wenn Ihr Budget für das Mittagessen beispielsweise 700 kcal beträgt und der Schwellenwert {threshold} __SW0__ beträgt, schlagen wir Lebensmittel zwischen {min} und {max} __SW0__ vor.
es: Le sugerimos alimentos de Mis comidas, ingredientes y comidas de ayer que se ajusten a su presupuesto por comida. Este umbral controla la flexibilidad de las sugerencias. Por ejemplo, si su presupuesto para el almuerzo es 700 kcal y el umbral es {threshold} __SW0__, le sugeriremos alimentos entre {min}–{max} __SW0__.
fr: Nous vous suggérons des aliments de vos Mes repas, des ingrédients et des repas d'hier qui correspondent à votre budget par repas. Ce seuil contrôle la flexibilité des suggestions. Par exemple, si votre budget déjeuner est de 700 kcal et que votre seuil est de {threshold} __SW0__, nous vous suggérerons des aliments compris entre {min} et {max} __SW0__.
hi: हम आपके मेरे भोजन, सामग्री और कल के भोजन से ऐसे खाद्य पदार्थों का सुझाव देते हैं जो आपके प्रति भोजन बजट के अनुरूप हों। यह सीमा नियंत्रित करती है कि सुझाव कितने लचीले हैं। उदाहरण के लिए, यदि आपके दोपहर के भोजन का बजट 700 kcal है और सीमा {threshold} __SW0__ है, तो हम {min}–{max} __SW0__ के बीच भोजन का सुझाव देंगे।
id: Kami menyarankan makanan dari Makanan Saya, bahan-bahan, dan makanan kemarin yang sesuai dengan anggaran makan Anda. Ambang batas ini mengontrol seberapa fleksibel saran tersebut. Misalnya, jika anggaran makan siang Anda adalah 700 kcal dan ambang batasnya adalah {threshold} __SW0__, kami akan menyarankan makanan antara {min}–{max} __SW0__.
pt: Sugerimos alimentos de Minhas Refeições, ingredientes e refeições de ontem que cabem no seu orçamento por refeição. Este limite controla a flexibilidade das sugestões. Por exemplo, se o seu orçamento para almoço for 700 kcal e o limite for {threshold} __SW0__, sugeriremos alimentos entre {min}–{max} __SW0__.
th: เราจะแนะนำอาหารจากเมนูของฉัน วัตถุดิบ และอาหารเมื่อวานที่เหมาะกับงบประมาณต่อมื้อของคุณ ค่า threshold นี้ควบคุมความยืดหยุ่นของคำแนะนำ ตัวอย่างเช่น ถ้างบประมาณมื้อกลางวันของคุณคือ 700 kcal และ threshold คือ {threshold} kcal เราจะแนะนำอาหารระหว่าง {min}–{max} kcal
vi: Chúng tôi đề xuất các món ăn từ Bữa ăn của tôi, nguyên liệu và bữa ăn của ngày hôm qua phù hợp với ngân sách mỗi bữa của bạn. Ngưỡng này kiểm soát mức độ linh hoạt của các đề xuất. Ví dụ: nếu ngân sách ăn trưa của bạn là 700 kcal và ngưỡng là {threshold} __SW0__, chúng tôi sẽ đề xuất các món ăn trong khoảng {min}–{max} __SW0__.

source: Suggestion Threshold
de: Vorschlagsschwelle
es: Umbral de sugerencia
fr: Seuil de suggestion
hi: सुझाव सीमा
id: Ambang Saran
pt: Limite de sugestão
th: ค่า Threshold คำแนะนำ
vi: Ngưỡng đề xuất

# suggestionThresholdDesc
source: Allow foods ± {threshold} kcal from meal budget
de: Erlauben Sie Lebensmittel ± {threshold} kcal vom Essensbudget
es: Permitir alimentos ± {threshold} kcal del presupuesto de comidas
fr: Autoriser les aliments ± {threshold} kcal du budget repas
hi: भोजन बजट से खाद्य पदार्थों की अनुमति दें ± {threshold} kcal
id: Izinkan makanan ± {threshold} kcal dari anggaran makan
pt: Permitir alimentos ± {threshold} kcal do orçamento de refeições
th: อนุญาตอาหาร ± {threshold} kcal จากงบประมาณมื้อ
vi: Cho phép thực phẩm ± {threshold} kcal từ ngân sách bữa ăn

# goalsSavedSuccess
source: Goals saved successfully!
de: Tore erfolgreich gespeichert!
es: ¡Objetivos guardados exitosamente!
fr: Objectifs enregistrés avec succès !
hi: लक्ष्य सफलतापूर्वक सहेजे गए!
id: Gol berhasil disimpan!
pt: Metas salvas com sucesso!
th: บันทึกเป้าหมายสำเร็จ!
vi: Đã lưu mục tiêu thành công!

# canOnlyLockTwoMacros
source: Can only lock 2 macros at once
de: Es können nur 2 Makros gleichzeitig gesperrt werden
es: Sólo se pueden bloquear 2 macros a la vez
fr: Ne peut verrouiller que 2 macros à la fois
hi: एक बार में केवल 2 मैक्रोज़ को लॉक किया जा सकता है
id: Hanya bisa mengunci 2 makro sekaligus
pt: Só é possível bloquear 2 macros de uma vez
th: ล็อคได้แค่ 2 แมโครพร้อมกัน
vi: Chỉ có thể khóa 2 macro cùng lúc

# canOnlyLockThreeMeals
source: Can only lock 3 meals; the 4th auto-calculates
de: Es können nur 3 Mahlzeiten gesperrt werden; Der 4. berechnet automatisch
es: Sólo se pueden bloquear 3 comidas; el cuarto se calcula automáticamente
fr: Ne peut verrouiller que 3 repas ; le 4ème calcule automatiquement
hi: केवल 3 भोजन लॉक कर सकते हैं; चौथा स्वतः गणना करता है
id: Hanya dapat mengunci 3 kali makan; perhitungan otomatis ke-4
pt: Só é possível bloquear 3 refeições; o 4º calcula automaticamente
th: ล็อคได้แค่ 3 มื้อ มื้อที่ 4 จะคำนวณอัตโนมัติ
vi: Chỉ được khóa 3 bữa; lần thứ 4 tự động tính toán

# tabMeals
source: Meals
de: Mahlzeiten
es: Comidas
fr: Repas
hi: भोजन
id: Makanan
pt: Refeições
th: เมนู
vi: Các bữa ăn

# tabIngredients
source: Ingredients
de: Zutaten
es: Ingredientes
fr: Ingrédients
hi: सामग्री
id: Bahan-bahan
pt: Ingredientes
th: วัตถุดิบ
vi: Thành phần

source: Search meals or ingredients...
de: Suchen Sie nach Mahlzeiten oder Zutaten...
es: Buscar comidas o ingredientes...
fr: Rechercher des repas ou des ingrédients...
hi: भोजन या सामग्री खोजें...
id: Cari makanan atau bahan...
pt: Pesquisar refeições ou ingredientes...
th: ค้นหาเมนูหรือวัตถุดิบ...
vi: Tìm kiếm bữa ăn hoặc thành phần...

source: Create New Meal
de: Neue Mahlzeit erstellen
es: Crear nueva comida
fr: Créer un nouveau repas
hi: नया भोजन बनाएं
id: Buat Makanan Baru
pt: Criar nova refeição
th: สร้างเมนูใหม่
vi: Tạo bữa ăn mới

source: Add Ingredient
de: Zutat hinzufügen
es: Agregar ingrediente
fr: Ajouter un ingrédient
hi: सामग्री जोड़ें
id: Tambahkan Bahan
pt: Adicionar ingrediente
th: เพิ่มวัตถุดิบ
vi: Thêm thành phần

source: No meals yet
de: Noch keine Mahlzeiten
es: Aún no hay comidas
fr: Pas encore de repas
hi: अभी तक भोजन नहीं
id: Belum ada makanan
pt: Ainda não há refeições
th: ยังไม่มีเมนู
vi: Chưa có bữa ăn nào

# noMealsYetDesc
source: Analyze food with AI to auto-save meals or create one manually
de: Analysieren Sie Lebensmittel mit KI, um Mahlzeiten automatisch zu speichern oder erstellen Sie eines manuell
es: Analice los alimentos con IA para guardarlos automáticamente o crear uno manualmente
fr: Analysez les aliments avec l'IA pour sauvegarder automatiquement les repas ou créez-en un manuellement
hi: भोजन को स्वतः सहेजने के लिए AI के साथ भोजन का विश्लेषण करें या मैन्युअल रूप से एक बनाएं
id: Analisis makanan dengan AI untuk menyimpan makanan secara otomatis atau buat secara manual
pt: Analise alimentos com IA para salvar refeições automaticamente ou crie um manualmente
th: วิเคราะห์อาหารด้วย AI เพื่อบันทึกเมนูอัตโนมัติ หรือสร้างด้วยมือ
vi: Phân tích thực phẩm bằng AI để tự động lưu bữa ăn hoặc tạo một cách thủ công

source: No ingredients yet
de: Noch keine Zutaten
es: Aún no hay ingredientes
fr: Pas encore d'ingrédients
hi: अभी तक कोई सामग्री नहीं
id: Belum ada bahan
pt: Ainda não há ingredientes
th: ยังไม่มีวัตถุดิบ
vi: Chưa có thành phần nào

# noIngredientsYetDesc
source: When you analyze food with AI ingredients will be saved automatically
de: Wenn Sie Lebensmittel mit KI analysieren Zutaten werden automatisch gespeichert
es: Cuando analizas alimentos con IA Los ingredientes se guardarán automáticamente.
fr: Quand vous analysez des aliments avec l’IA les ingrédients seront enregistrés automatiquement
hi: जब आप एआई के साथ भोजन का विश्लेषण करते हैं सामग्री स्वचालित रूप से सहेजी जाएगी
id: Saat Anda menganalisis makanan dengan AI bahan akan disimpan secara otomatis
pt: Quando você analisa alimentos com IA ingredientes serão salvos automaticamente
th: เมื่อคุณวิเคราะห์อาหารด้วย AI วัตถุดิบจะถูกบันทึกอัตโนมัติ
vi: Khi bạn phân tích thực phẩm bằng AI thành phần sẽ được lưu tự động

# mealCreated
source: Created "{name}"
de: Erstellt „{name}“
es: Creado "{name}"
fr: "{name}" créé
hi: "{name}" बनाया गया
id: Dibuat "{name}"
pt: Criado "{name}"
th: สร้าง "{name}" แล้ว
vi: Đã tạo "{name}"

# mealLogged
source: Logged "{name}"
de: Protokolliert „{name}“
es: Registrado "{name}"
fr: Enregistré "{name}"
hi: लॉग किया गया "{name}"
id: Tercatat "{name}"
pt: Registrado "{name}"
th: บันทึก "{name}" แล้ว
vi: Đã ghi nhật ký "{name}"

# ingredientAmount
source: Amount ({unit})
de: Betrag ({unit})
es: Importe ({unit})
fr: Montant ({unit})
hi: राशि ({unit})
id: Jumlah ({unit})
pt: Quantidade ({unit})
th: ปริมาณ ({unit})
vi: Số tiền ({unit})

# ingredientLogged
source: Logged "{name}" {amount}{unit}
de: Protokolliert „{name}“ {amount}{unit}
es: Registrado "{name}" {amount}{unit}
fr: Enregistré "{name}" {amount}{unit}
hi: लॉग किया गया "{name}" {amount}{unit}
id: Tercatat "{name}" {amount}{unit}
pt: Registrado "{name}" {amount}{unit}
th: บันทึก "{name}" {amount}{unit} แล้ว
vi: Đã ghi "{name}" {amount}{unit}

source: Meal not found
de: Mahlzeit nicht gefunden
es: Comida no encontrada
fr: Repas introuvable
hi: भोजन नहीं मिला
id: Makanan tidak ditemukan
pt: Refeição não encontrada
th: ไม่พบเมนู
vi: Không tìm thấy bữa ăn

# mealUpdated
source: Updated "{name}"
de: „{name}“ aktualisiert
es: Actualizado "{name}"
fr: "{name}" mis à jour
hi: अपडेट किया गया "{name}"
id: Diperbarui "{name}"
pt: "{name}" atualizado
th: อัพเดท "{name}" แล้ว
vi: Đã cập nhật "{name}"

# deleteMealTitle
source: Delete Meal?
de: Mahlzeit löschen?
es: ¿Eliminar comida?
fr: Supprimer le repas ?
hi: भोजन हटाएं?
id: Hapus Makanan?
pt: Excluir refeição?
th: ลบเมนู?
vi: Xóa bữa ăn?

# deleteMealNote
source: Ingredients will not be deleted.
de: Zutaten werden nicht gelöscht.
es: Los ingredientes no se eliminarán.
fr: Les ingrédients ne seront pas supprimés.
hi: सामग्री हटाई नहीं जाएगी.
id: Bahan-bahannya tidak akan dihapus.
pt: Os ingredientes não serão excluídos.
th: วัตถุดิบจะไม่ถูกลบ
vi: Thành phần sẽ không bị xóa.

source: Meal deleted
de: Mahlzeit gelöscht
es: Comida eliminada
fr: Repas supprimé
hi: भोजन हटा दिया गया
id: Makanan dihapus
pt: Refeição excluída
th: ลบเมนูแล้ว
vi: Đã xóa bữa ăn

# ingredientCreated
source: Created "{name}"
de: Erstellt „{name}“
es: Creado "{name}"
fr: "{name}" créé
hi: "{name}" बनाया गया
id: Dibuat "{name}"
pt: Criado "{name}"
th: สร้าง "{name}" แล้ว
vi: Đã tạo "{name}"

source: Ingredient not found
de: Zutat nicht gefunden
es: Ingrediente no encontrado
fr: Ingrédient introuvable
hi: घटक नहीं मिला
id: Bahan tidak ditemukan
pt: Ingrediente não encontrado
th: ไม่พบวัตถุดิบ
vi: Không tìm thấy thành phần

# ingredientUpdated
source: Updated "{name}"
de: „{name}“ aktualisiert
es: Actualizado "{name}"
fr: "{name}" mis à jour
hi: अपडेट किया गया "{name}"
id: Diperbarui "{name}"
pt: "{name}" atualizado
th: อัพเดท "{name}" แล้ว
vi: Đã cập nhật "{name}"

# deleteIngredientTitle
source: Delete Ingredient?
de: Zutat löschen?
es: ¿Eliminar ingrediente?
fr: Supprimer l'ingrédient ?
hi: संघटक हटाएँ?
id: Hapus Bahan?
pt: Excluir ingrediente?
th: ลบวัตถุดิบ?
vi: Xóa thành phần?

source: Ingredient deleted
de: Zutat gelöscht
es: Ingrediente eliminado
fr: Ingrédient supprimé
hi: घटक हटा दिया गया
id: Bahan dihapus
pt: Ingrediente excluído
th: ลบวัตถุดิบแล้ว
vi: Thành phần đã bị xóa

source: No ingredients data
de: Keine Angaben zu Inhaltsstoffen
es: Sin datos de ingredientes
fr: Aucune donnée sur les ingrédients
hi: कोई सामग्री डेटा नहीं
id: Tidak ada data bahan
pt: Sem dados de ingredientes
th: ไม่มีข้อมูลวัตถุดิบ
vi: Không có dữ liệu thành phần

source: Use This Meal
de: Verwenden Sie diese Mahlzeit
es: Utilice esta comida
fr: Utilisez ce repas
hi: इस भोजन का प्रयोग करें
id: Gunakan Makanan Ini
pt: Use esta refeição
th: ใช้เมนูนี้
vi: Sử dụng bữa ăn này

# errorLoading
source: Error loading: {error}
de: Fehler beim Laden: {error}
es: Error al cargar: {error}
fr: Erreur de chargement : {error}
hi: लोड करने में त्रुटि: {error}
id: Kesalahan saat memuat: {error}
pt: Erro ao carregar: {error}
th: เกิดข้อผิดพลาดในการโหลด: {error}
vi: Lỗi tải: {error}

# scanFoundNewImages
source: Found {count} new images on {date}
de: {count} neue Bilder gefunden auf {date}
es: Se encontraron {count} nuevas imágenes en {date}
fr: J'ai trouvé {count} nouvelles images sur {date}
hi: {date} पर {count} नई छवियाँ मिलीं
id: Menemukan {count} gambar baru di {date}
pt: Encontradas {count} novas imagens em {date}
th: พบรูปภาพใหม่ {count} รูปใน {date}
vi: Đã tìm thấy {count} hình ảnh mới trên {date}

# scanNoNewImages
source: No new images found on {date}
de: Keine neuen Bilder gefunden auf {date}
es: No se encontraron nuevas imágenes en {date}
fr: Aucune nouvelle image trouvée sur {date}
hi: {date} पर कोई नई छवि नहीं मिली
id: Tidak ada gambar baru yang ditemukan di {date}
pt: Nenhuma nova imagem encontrada em {date}
th: ไม่พบรูปภาพใหม่ใน {date}
vi: Không tìm thấy hình ảnh mới nào trên {date}

# aiAnalysisRemaining
source: AI Analysis: {remaining}/{total} remaining today
de: KI-Analyse: {remaining}/{total} verbleiben heute
es: Análisis de IA: {remaining}/{total} restantes hoy
fr: Analyse IA : {remaining}/{total} restants aujourd'hui
hi: एआई विश्लेषण: {remaining}/{total} आज शेष है
id: Analisis AI: {remaining}/{total} tersisa hari ini
pt: Análise de IA: {remaining}/{total} restantes hoje
th: AI Analysis: เหลือ {remaining}/{total} ครั้งวันนี้
vi: Phân tích AI: {remaining}/{total} còn lại hôm nay

# upgradeToProUnlimited
source: Upgrade to Pro for unlimited use
de: Upgrade auf Pro für unbegrenzte Nutzung
es: Actualice a Pro para uso ilimitado
fr: Passez à Pro pour une utilisation illimitée
hi: असीमित उपयोग के लिए Pro पर अपग्रेड करें
id: Tingkatkan ke Pro untuk penggunaan tak terbatas
pt: Atualize para Pro para uso ilimitado
th: อัพเกรด Pro เพื่อใช้งานไม่จำกัด
vi: Nâng cấp lên Pro để sử dụng không giới hạn

source: Upgrade
es: Mejora
fr: Mise à niveau
hi: उन्नत करना
id: Meningkatkan
pt: Atualizar
th: อัพเกรด
vi: Nâng cấp

source: Confirm Delete
de: Bestätigen Sie Löschen
es: Confirmar eliminación
fr: Confirmer la suppression
hi: हटाने की पुष्टि करें
id: Konfirmasi Hapus
pt: Confirmar exclusão
th: ยืนยันการลบ
vi: Xác nhận Xóa

# confirmDeleteMessage
source: Do you want to delete "{name}"?
de: Möchten Sie „{name}“ löschen?
es: ¿Quieres eliminar "{name}"?
fr: Voulez-vous supprimer « {name} » ?
hi: क्या आप "{name}" को हटाना चाहते हैं?
id: Apakah Anda ingin menghapus "{name}"?
pt: Deseja excluir "{name}"?
th: คุณต้องการลบ "{name}"?
vi: Bạn có muốn xóa "{name}" không?

# entryDeletedSuccess
source: ✅ Entry deleted successfully
de: ✅ Eintrag erfolgreich gelöscht
es: ✅ Entrada eliminada exitosamente
fr: ✅ Entrée supprimée avec succès
hi: ✅ प्रविष्टि सफलतापूर्वक हटा दी गई
id: ✅ Entri berhasil dihapus
pt: ✅ Entrada excluída com sucesso
th: ✅ ลบรายการสำเร็จ
vi: ✅ Xóa bài viết thành công

# entryDeleteError
source: ❌ Error: {error}
de: ❌ Fehler: {error}
fr: ❌ Erreur : {error}
hi: ❌ त्रुटि: {error}
id: ❌ Kesalahan: {error}
pt: ❌ Erro: {error}
th: ❌ เกิดข้อผิดพลาด: {error}
vi: ❌ Lỗi: {error}

# batchAnalyzeItems
source: {count} items (batch)
de: {count} Artikel (Charge)
es: {count} artículos (lote)
fr: {count} articles (lot)
hi: {count} आइटम (बैच)
id: {count} item (kumpulan)
pt: {count} itens (lote)
th: {count} รายการ (batch)
vi: {count} mặt hàng (đợt)

# analyzeCancelled
source: Cancelled — analyzed {success} items successfully
de: Abgebrochen – {success} Elemente erfolgreich analysiert
es: Cancelado: analizó {success} elementos correctamente
fr: Annulé – analyse réussie des éléments {success}
hi: रद्द किया गया - {success} आइटम का सफलतापूर्वक विश्लेषण किया गया
id: Dibatalkan — berhasil menganalisis item {success}
pt: Cancelado — itens {success} analisados ​​com sucesso
th: ยกเลิกแล้ว - วิเคราะห์สำเร็จ {success} รายการ
vi: Đã hủy — đã phân tích thành công {success} mục

# analyzeSuccessAll
source: ✅ Analyzed {success} items successfully
de: ✅ {success} Elemente erfolgreich analysiert
es: ✅ Se analizaron {success} elementos con éxito
fr: ✅ Analyse réussie des éléments {success}
hi: ✅ {success} आइटम का सफलतापूर्वक विश्लेषण किया गया
id: ✅ Berhasil menganalisis item {success}
pt: ✅ Itens {success} analisados ​​com sucesso
th: ✅ วิเคราะห์สำเร็จ {success} รายการ
vi: ✅ Đã phân tích thành công {success} mục

# analyzeSuccessPartial
source: ⚠️ Analyzed {success}/{total} items ({failed} failed)
de: ⚠️ Analysierte {success}/{total} Elemente ({failed} fehlgeschlagen)
es: ⚠️ Elementos {success}/{total} analizados ({failed} falló)
fr: ⚠️ Analyse des éléments {success}/{total} ({failed} a échoué)
hi: ⚠️ {success}/{total} आइटम का विश्लेषण किया गया ({failed} विफल)
id: ⚠️ Menganalisis item {success}/{total} ({failed} gagal)
pt: ⚠️ Itens {success}/{total} analisados ​​({failed} falhou)
th: ⚠️ วิเคราะห์สำเร็จ {success}/{total} รายการ ({failed} ล้มเหลว)
vi: ⚠️ Đã phân tích {success}/{total} mục ({failed} không thành công)

# pullToScanMeal
source: Pull to scan your meal
de: Ziehen Sie, um Ihre Mahlzeit zu scannen
es: Tira para escanear tu comida
fr: Tirez pour scanner votre repas
hi: अपने भोजन को स्कैन करने के लिए खींचें
id: Tarik untuk memindai makanan Anda
pt: Puxe para digitalizar sua refeição
th: ดึงลงเพื่อสแกนมื้ออาหาร
vi: Kéo để quét bữa ăn của bạn

source: Analyze All
de: Alles analysieren
es: Analizar todo
fr: Analyser tout
hi: सभी का विश्लेषण करें
id: Analisis Semua
pt: Analisar tudo
th: วิเคราะห์ทั้งหมด
vi: Phân tích tất cả

# addFoodTitle
source: Add Food
de: Essen hinzufügen
es: Agregar comida
fr: Ajouter de la nourriture
hi: भोजन जोड़ें
id: Tambahkan Makanan
pt: Adicionar comida
th: เพิ่มอาหาร
vi: Thêm thức ăn

# foodNameRequired
source: Food Name *
de: Lebensmittelname *
es: Nombre del alimento *
fr: Nom de l'aliment *
hi: भोजन का नाम*
id: Nama Makanan *
pt: Nome do alimento *
th: ชื่ออาหาร *
vi: Tên món ăn *

# foodNameHint
source: e.g. Fried Rice with Shrimp
de: Geben Sie zum Suchen ein, z. B. gebratener Reis, Papayasalat
es: Escriba para buscar, p. arroz frito, ensalada de papaya
fr: Tapez pour rechercher, par ex. riz frit, salade de papaye
hi: खोजने के लिए टाइप करें उदा. तला हुआ चावल, पपीता सलाद
id: Ketik untuk mencari mis. nasi goreng, salad pepaya
pt: Digite para pesquisar, por exemplo arroz frito, salada de mamão
th: พิมพ์เพื่อค้นหา เช่น ข้าวผัด ส้มตำ
vi: Nhập để tìm kiếm, ví dụ: cơm chiên, gỏi đu đủ

# selectedFromMyMeal
source: ✅ Selected from My Meal — nutrition data auto-filled
de: ✅ Aus „Meine Mahlzeit“ ausgewählt – Nährwertdaten werden automatisch ausgefüllt
es: ✅ Seleccionado de Mi comida: datos nutricionales autocompletados
fr: ✅ Sélectionné dans Mon repas - données nutritionnelles remplies automatiquement
hi: ✅ मेरा भोजन से चयनित - पोषण डेटा स्वतः भरा हुआ
id: ✅ Dipilih dari Makanan Saya - data nutrisi terisi secara otomatis
pt: ✅ Selecionado em Minha Refeição - dados nutricionais preenchidos automaticamente
th: ✅ เลือกจากเมนูของฉัน — ข้อมูลโภชนาการเติมอัตโนมัติ
vi: ✅ Được chọn từ Bữa ăn của tôi - dữ liệu dinh dưỡng được tự động điền

# foundInDatabase
source: ✅ Found in database — nutrition data auto-filled
de: ✅ In der Datenbank gefunden – Nährwertdaten werden automatisch ausgefüllt
es: ✅ Encontrado en la base de datos: datos nutricionales autocompletados
fr: ✅ Trouvé dans la base de données — données nutritionnelles remplies automatiquement
hi: ✅ डेटाबेस में मिला - पोषण डेटा स्वतः भरा हुआ
id: ✅ Ditemukan di database — data nutrisi terisi secara otomatis
pt: ✅ Encontrado no banco de dados – dados nutricionais preenchidos automaticamente
th: ✅ พบในฐานข้อมูล — ข้อมูลโภชนาการเติมอัตโนมัติ
vi: ✅ Có trong cơ sở dữ liệu — dữ liệu dinh dưỡng được tự động điền

# saveAndAnalyze
source: Save & Analyze
de: Speichern und analysieren
es: Guardar y analizar
fr: Enregistrer et analyser
hi: सहेजें और विश्लेषण करें
id: Simpan & Analisis
pt: Salvar e analisar
th: บันทึกและวิเคราะห์
vi: Lưu & Phân tích

# notFoundInDatabase
source: Not found in database — will be analyzed in background
de: Nicht in der Datenbank gefunden – wird im Hintergrund analysiert
es: No encontrado en la base de datos: se analizará en segundo plano
fr: Introuvable dans la base de données — sera analysé en arrière-plan
hi: डेटाबेस में नहीं मिला - पृष्ठभूमि में विश्लेषण किया जाएगा
id: Tidak ditemukan di database — akan dianalisis di latar belakang
pt: Não encontrado no banco de dados — será analisado em segundo plano
th: ไม่พบในฐานข้อมูล — จะวิเคราะห์ในพื้นหลัง
vi: Không tìm thấy trong cơ sở dữ liệu - sẽ được phân tích ở chế độ nền

# amountLabel
source: Amount
de: Menge
es: Cantidad
fr: Montant
hi: मात्रा
id: Jumlah
pt: Quantia
th: ปริมาณ
vi: Số lượng

# unitLabel
source: Unit
de: Einheit
es: Unidad
fr: Unité
hi: इकाई
id: Satuan
pt: Unidade
th: หน่วย
vi: Đơn vị
