Repository: lnxelnope/miro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, pt, th, vi

# seasonalQuestDaysLeft
source: {days} days left
de: Noch {days} Tage
es: Quedan {days} días
fr: {days} jours restants
hi: {days} दिन बचे हैं
id: {days} hari tersisa
pt: {days} dias restantes
th: เหลืออีก {days} วัน
vi: {days} ngày còn lại

# seasonalQuestRewardDaily
source: +{reward}E / day
de: +{reward}E / Tag
es: +{reward}E / día
fr: +{reward}E / jour
hi: +{reward}E/दिन
id: +{reward}E / hari
pt: +{reward}E/dia
th: +{reward}E / วัน
vi: +{reward}E/ngày

# seasonalQuestRewardOnce
source: +{reward}E one-time
de: +{reward}E einmalig
es: +{reward}E una vez
fr: +{reward}E une fois
hi: +{reward}E एक बार
id: +{reward}E satu kali
pt: +{reward}E uma vez
th: +{reward}E ครั้งเดียว
vi: +{reward}E một lần

# seasonalQuestClaimed
source: Claimed!
de: Behauptet!
es: ¡Reclamado!
fr: Réclamé !
hi: दावा किया!
id: Diklaim!
pt: Reivindicado!
th: รับแล้ว!
vi: Đã xác nhận quyền sở hữu!

# seasonalQuestClaimedToday
source: Claimed today
de: Heute beansprucht
es: Reclamado hoy
fr: Réclamé aujourd'hui
hi: आज दावा किया गया
id: Diklaim hari ini
pt: Reivindicado hoje
th: วันนี้รับไปแล้ว
vi: Đã xác nhận hôm nay

# errorFailed
source: Failed
de: Fehlgeschlagen
es: Fallido
fr: Échoué
hi: असफल
id: Gagal
pt: Fracassado
th: ล้มเหลว
vi: Thất bại

# errorFailedToClaim
source: Failed to claim
de: Anspruch konnte nicht geltend gemacht werden
es: No se pudo reclamar
fr: Échec de la réclamation
hi: दावा करने में विफल
id: Gagal mengklaim
pt: Falha ao reivindicar
th: เคลมไม่สำเร็จ
vi: Không thể yêu cầu

# errorGeneric
source: Error: {error}
de: Fehler: {error}
fr: Erreur : {error}
hi: त्रुटि: {error}
id: Kesalahan: {error}
pt: Erro: {error}
th: เกิดข้อผิดพลาด: {error}
vi: Lỗi: {error}

# milestoneNoMilestonesToClaim
source: No milestones to claim yet
de: Es sind noch keine Meilensteine ​​zu beanspruchen
es: Aún no hay hitos que reclamar
fr: Aucun jalon à revendiquer pour l'instant
hi: दावा करने के लिए अभी तक कोई मील का पत्थर नहीं है
id: Belum ada pencapaian yang dapat diklaim
pt: Ainda não há marcos para reivindicar
th: ยังไม่มี milestone ที่เคลมได้
vi: Chưa có cột mốc nào để yêu cầu

# milestoneClaimedEnergy
source: 🎁 Claimed +{energy} Energy!
de: 🎁 +{energy} Energie beansprucht!
es: 🎁 ¡Reclamó +{energy} Energía!
fr: 🎁 Réclamé +{energy} Énergie !
hi: 🎁दावा किया गया +{energy} ऊर्जा!
id: 🎁 Diklaim +{energy} Energi!
pt: 🎁 Energia reivindicada +{energy}!
th: 🎁 เคลมได้ +{energy} Energy!
vi: 🎁 Đã xác nhận +{energy} Năng lượng!

# milestoneTitle
source: Milestones
de: Meilensteine
es: Hitos
fr: Jalons
hi: मील के पत्थर
id: Tonggak sejarah
pt: Conquistas
vi: Các cột mốc quan trọng

# milestoneUseEnergyComplete
source: Use Energy {threshold}
de: Energie nutzen {threshold}
es: Usar energía {threshold}
fr: Utiliser l'énergie {threshold}
hi: ऊर्जा का उपयोग करें {threshold}
id: Gunakan Energi {threshold}
pt: Usar Energia {threshold}
th: ใช้ Energy ครบ {threshold}
vi: Sử dụng năng lượng {threshold}

# milestoneNext
source: Next: {threshold}E
de: Weiter: {threshold}E
es: Siguiente: {threshold}E
fr: Suivant : {threshold}E
hi: अगला: {threshold}E
id: Berikutnya: {threshold}E
pt: Próximo: {threshold}E
th: ถัดไป: {threshold}E
vi: Tiếp theo: {threshold}E

# milestoneAllComplete
source: All milestones completed!
de: Alle Meilensteine ​​erreicht!
es: ¡Todos los hitos completados!
fr: Toutes les étapes franchies !
hi: सभी मील के पत्थर पूरे हो गए!
id: Semua pencapaian selesai!
pt: Todos os marcos concluídos!
th: ทุก Milestone สำเร็จแล้ว!
vi: Tất cả các cột mốc đã hoàn thành!

# noEnergyTitle
source: Out of Energy
de: Keine Energie mehr
es: Sin energía
fr: À court d'énergie
hi: ऊर्जा से बाहर
id: Kehabisan Energi
pt: Sem energia
th: Energy หมด
vi: Hết năng lượng

# noEnergyContent
source: You need 1 Energy to analyze food with AI
de: Sie benötigen 1 Energie, um Lebensmittel mit KI zu analysieren
es: Necesitas 1 Energía para analizar alimentos con IA
fr: Vous avez besoin de 1 énergie pour analyser les aliments avec l'IA
hi: एआई के साथ भोजन का विश्लेषण करने के लिए आपको 1 ऊर्जा की आवश्यकता है
id: Anda membutuhkan 1 Energi untuk menganalisis makanan dengan AI
pt: Você precisa de 1 energia para analisar alimentos com IA
th: คุณต้องการ 1 Energy เพื่อวิเคราะห์อาหารด้วย AI
vi: Bạn cần 1 Năng lượng để phân tích thực phẩm bằng AI

# noEnergyTip
source: You can still log food manually (without AI) for free
de: Sie können Lebensmittel weiterhin kostenlos manuell (ohne KI) protokollieren
es: Aún puedes registrar alimentos manualmente (sin IA) de forma gratuita
fr: Vous pouvez toujours enregistrer les aliments manuellement (sans IA) gratuitement
hi: आप अभी भी भोजन को मैन्युअल रूप से (एआई के बिना) निःशुल्क लॉग कर सकते हैं
id: Anda masih bisa mencatat makanan secara manual (tanpa AI) secara gratis
pt: Você ainda pode registrar alimentos manualmente (sem IA) gratuitamente
th: คุณยังสามารถบันทึกอาหารด้วยมือ (ไม่ใช้ AI) ได้ฟรี
vi: Bạn vẫn có thể đăng nhập đồ ăn thủ công (không cần AI) miễn phí

# noEnergyLater
source: Later
de: Später
es: Más tarde
fr: Plus tard
hi: बाद में
id: Nanti
pt: Mais tarde
th: ไว้ทีหลัง
vi: Sau đó

# noEnergyWatchAd
source: Watch Ad ({remaining}/3)
de: Anzeige ansehen ({remaining}/3)
es: Ver anuncio ({remaining}/3)
fr: Regarder l'annonce ({remaining}/3)
hi: विज्ञापन देखें ({remaining}/3)
id: Tonton Iklan ({remaining}/3)
pt: Assistir ao anúncio ({remaining}/3)
th: ดูโฆษณา ({remaining}/3)
vi: Xem Quảng Cáo ({remaining}/3)

# noEnergyBuyEnergy
source: Buy Energy
de: Kaufen Sie Energie
es: Comprar Energía
fr: Acheter de l'énergie
hi: ऊर्जा खरीदें
id: Beli Energi
pt: Comprar energia
th: ซื้อ Energy
vi: Mua năng lượng

# tierBronze
source: Bronze
es: Bronce
hi: पीतल
id: Perunggu
vi: đồng

# tierSilver
source: Silver
de: Silber
es: Plata
fr: Argent
hi: चाँदी
id: Perak
pt: Prata
vi: Bạc

# tierGold
source: Gold
es: Oro
fr: Or
hi: सोना
id: Emas
pt: Ouro
vi: Vàng

# tierDiamond
source: Diamond
de: Diamant
es: Diamante
fr: Diamant
hi: डायमंड
id: Berlian
pt: Diamante
vi: Kim cương

# tierStarter
source: Starter
de: Anlasser
es: Motor de arranque
fr: Démarreur
hi: स्टार्टर
pt: Iniciante
vi: người mới bắt đầu

# tierUpCongratulations
source: 🎉 Congratulations!
de: 🎉 Herzlichen Glückwunsch!
es: 🎉 ¡Felicidades!
fr: 🎉 Félicitations !
hi: 🎉बधाई हो!
id: 🎉 Selamat!
pt: 🎉 Parabéns!
th: 🎉 ยินดีด้วย!
vi: 🎉 Xin chúc mừng!

# tierUpYouReached
source: You reached {tier}!
de: Du hast {tier} erreicht!
es: ¡Llegaste a {tier}!
fr: Vous avez atteint {tier} !
hi: आप {tier} तक पहुंच गए!
id: Anda mencapai {tier}!
pt: Você alcançou {tier}!
th: คุณเลื่อนเป็น {tier}!
vi: Bạn đã đạt đến {tier}!

# tierUpMotivation
source: Track calories like a pro Your dream body is getting closer!
de: Verfolgen Sie Kalorien wie ein Profi Ihr Traumkörper rückt immer näher!
es: Realiza un seguimiento de las calorías como un profesional ¡El cuerpo de tus sueños está cada vez más cerca!
fr: Suivez les calories comme un pro Votre corps de rêve se rapproche !
hi: एक प्रोफेशनल की तरह कैलोरी ट्रैक करें आपके सपनों का शरीर करीब आ रहा है!
id: Lacak kalori seperti seorang profesional Tubuh impian Anda semakin dekat!
pt: Monitore calorias como um profissional O corpo dos seus sonhos está cada vez mais próximo!
th: Track calories เก่งมาก หุ่นในฝันใกล้จะเป็นจริงแล้ว!
vi: Theo dõi lượng calo như một người chuyên nghiệp Cơ thể mơ ước của bạn đang đến gần hơn!

# tierUpReward
source: +{reward}E Reward!
de: +{reward}E Belohnung!
es: +{reward}E ¡Recompensa!
fr: +{reward}E Récompense !
hi: +{reward}E इनाम!
id: +{reward}E Hadiah!
pt: +{reward}E Recompensa!
vi: +{reward}E Phần thưởng!

# referralAllLevelsClaimed
source: All levels claimed!
de: Alle Level erreicht!
es: ¡Todos los niveles reclamados!
fr: Tous les niveaux revendiqués !
hi: सभी स्तरों पर दावा किया गया!
id: Semua level diklaim!
pt: Todos os níveis reivindicados!
th: เคลมครบทุก level แล้ว!
vi: Tất cả các cấp độ được yêu cầu!

# referralLevel
source: Level {level}: {subtitle}
de: Stufe {level}: {subtitle}
es: Nivel {level}: {subtitle}
fr: Niveau {level} : {subtitle}
hi: स्तर {level}: {subtitle}
id: Tingkat {level}: {subtitle}
pt: Nível {level}: {subtitle}
vi: Cấp độ {level}: {subtitle}

# referralProgress
source: [{current}/{target}] (Level {level}/{total})
de: [{current}/{target}] (Stufe {level}/{total})
es: [{current}/{target}] (Nivel {level}/{total})
fr: [{current}/{target}] (Niveau {level}/{total})
hi: [{current}/{target}] (स्तर {level}/{total})
id: [{current}/{target}] (Tingkat {level}/{total})
pt: [{current}/{target}] (Nível {level}/{total})
vi: [{current}/{target}] (Cấp {level}/{total})

# referralClaimedLevel
source: 🎁 Claimed Level {level}: +{reward} Energy!
de: 🎁 Beanspruchtes Level {level}: +{reward} Energie!
es: 🎁 Nivel reclamado {level}: +{reward} ¡Energía!
fr: 🎁 Niveau revendiqué {level} : +{reward} Énergie !
hi: 🎁 दावा किया गया स्तर {level}: +{reward} ऊर्जा!
id: 🎁 Level yang Diklaim {level}: +{reward} Energi!
pt: 🎁 Nível reivindicado {level}: +{reward} Energia!
th: 🎁 เคลม Level {level}: +{reward} Energy!
vi: 🎁 Cấp yêu cầu {level}: +{reward} Năng lượng!

# challengeUseAi10
source: Use Energy 10
de: Nutze Energie 10
es: Usar energía 10
fr: Utiliser l'énergie 10
hi: ऊर्जा का प्रयोग करें 10
id: Gunakan Energi 10
pt: Usar Energia 10
th: ใช้ Energy 10
vi: Sử dụng năng lượng 10

# specifyIngredients
source: Specify Known Ingredients
de: Geben Sie bekannte Zutaten an
es: Especificar ingredientes conocidos
fr: Préciser les ingrédients connus
hi: ज्ञात सामग्री निर्दिष्ट करें
id: Tentukan Bahan yang Diketahui
pt: Especifique ingredientes conhecidos
th: ระบุวัตถุดิบที่รู้
vi: Chỉ định các thành phần đã biết

# specifyIngredientsOptional
source: Specify known ingredients (optional)
de: Geben Sie bekannte Zutaten an (optional)
es: Especificar ingredientes conocidos (opcional)
fr: Préciser les ingrédients connus (facultatif)
hi: ज्ञात सामग्री निर्दिष्ट करें (वैकल्पिक)
id: Tentukan bahan-bahan yang diketahui (opsional)
pt: Especifique ingredientes conhecidos (opcional)
th: ระบุวัตถุดิบที่รู้ (optional)
vi: Chỉ định các thành phần đã biết (tùy chọn)

# specifyIngredientsHint
source: Enter the ingredients you know, and AI will discover hidden seasonings, oils, and sauces for you.
de: Geben Sie die Zutaten ein, die Sie kennen, und die KI entdeckt für Sie versteckte Gewürze, Öle und Saucen.
es: Ingrese los ingredientes que conoce y la IA descubrirá condimentos, aceites y salsas ocultos para usted.
fr: Entrez les ingrédients que vous connaissez et l'IA découvrira pour vous les assaisonnements, les huiles et les sauces cachés.
hi: वे सामग्री दर्ज करें जिन्हें आप जानते हैं, और एआई आपके लिए छिपे हुए सीज़निंग, तेल और सॉस की खोज करेगा।
id: Masukkan bahan-bahan yang Anda tahu, dan AI akan menemukan bumbu, minyak, dan saus tersembunyi untuk Anda.
pt: Insira os ingredientes que você conhece e a IA descobrirá temperos, óleos e molhos escondidos para você.
th: ใส่วัตถุดิบหลักที่คุณรู้ แล้ว AI จะค้นหาเครื่องปรุง น้ำมัน ซอส และวัตถุดิบย่อยที่ซ่อนอยู่ให้
vi: Nhập các thành phần bạn biết và AI sẽ khám phá các loại gia vị, dầu và nước sốt ẩn cho bạn.

source: Send to AI
de: An AI senden
es: Enviar a IA
fr: Envoyer à l'IA
hi: एआई को भेजें
id: Kirim ke AI
pt: Enviar para IA
th: ส่งตรวจ AI
vi: Gửi tới AI

# reanalyzeWithIngredients
source: Add Ingredients & Re-analyze
de: Zutaten hinzufügen und erneut analysieren
es: Agregue ingredientes y vuelva a analizar
fr: Ajouter des ingrédients et réanalyser
hi: सामग्री जोड़ें और पुनः विश्लेषण करें
id: Tambahkan Bahan & Analisis Ulang
pt: Adicione ingredientes e analise novamente
th: เพิ่มวัตถุดิบ & วิเคราะห์ใหม่
vi: Thêm thành phần & phân tích lại

# reanalyzeButton
source: Re-analyze (1 Energy)
de: Erneut analysieren (1 Energie)
es: Volver a analizar (1 energía)
fr: Réanalyser (1 énergie)
hi: पुनः विश्लेषण करें (1 ऊर्जा)
id: Analisis ulang (1 Energi)
pt: Reanalisar (1 Energia)
th: วิเคราะห์ใหม่ (1 Energy)
vi: Phân tích lại (1 Năng lượng)

source: Ingredients saved
de: Zutaten gespart
es: Ingredientes guardados
fr: Ingrédients sauvegardés
hi: सामग्री सहेजी गई
id: Bahan-bahannya disimpan
pt: Ingredientes salvos
th: บันทึกวัตถุดิบแล้ว
vi: Đã lưu thành phần

# pleaseAddAtLeastOneIngredient
source: Please add at least 1 ingredient
de: Bitte fügen Sie mindestens 1 Zutat hinzu
es: Por favor agregue al menos 1 ingrediente
fr: Veuillez ajouter au moins 1 ingrédient
hi: कृपया कम से कम 1 सामग्री जोड़ें
id: Silakan tambahkan setidaknya 1 bahan
pt: Adicione pelo menos 1 ingrediente
th: กรุณาเพิ่มวัตถุดิบอย่างน้อย 1 รายการ
vi: Vui lòng thêm ít nhất 1 thành phần

# hiddenIngredientsDiscovered
source: Hidden ingredients discovered by AI
de: Versteckte Zutaten von KI entdeckt
es: Ingredientes ocultos descubiertos por la IA
fr: Ingrédients cachés découverts par l'IA
hi: एआई द्वारा खोजे गए छिपे हुए तत्व
id: Bahan tersembunyi ditemukan oleh AI
pt: Ingredientes ocultos descobertos pela IA
th: วัตถุดิบที่ AI ค้นพบ
vi: Thành phần ẩn được phát hiện bởi AI

# retroScanTitle
source: Scan Recent Photos?
de: Aktuelle Fotos scannen?
es: ¿Escanear fotos recientes?
fr: Scanner les photos récentes ?
hi: हाल की तस्वीरें स्कैन करें?
id: Pindai Foto Terbaru?
pt: Digitalizar fotos recentes?
th: สแกนรูปย้อนหลัง?
vi: Quét ảnh gần đây?

# retroScanDescription
source: We can scan your photos from the last 7 days to automatically find food photos and add them to your diary.
de: Wir können Ihre Fotos der letzten 7 Tage scannen, um automatisch Lebensmittelfotos zu finden und sie Ihrem Tagebuch hinzuzufügen.
es: Podemos escanear sus fotos de los últimos 7 días para encontrar automáticamente fotos de alimentos y agregarlas a su diario.
fr: Nous pouvons numériser vos photos des 7 derniers jours pour trouver automatiquement des photos de plats et les ajouter à votre agenda.
hi: हम स्वचालित रूप से भोजन की तस्वीरें ढूंढने और उन्हें आपकी डायरी में जोड़ने के लिए पिछले 7 दिनों की आपकी तस्वीरें स्कैन कर सकते हैं।
id: Kami dapat memindai foto Anda dari 7 hari terakhir untuk secara otomatis menemukan foto makanan dan menambahkannya ke buku harian Anda.
pt: Podemos digitalizar suas fotos dos últimos 7 dias para encontrar automaticamente fotos de alimentos e adicioná-las ao seu diário.
th: เราสามารถสแกนรูปภาพ 7 วันที่ผ่านมา เพื่อค้นหารูปอาหารและเพิ่มลง diary ให้อัตโนมัติ
vi: Chúng tôi có thể quét ảnh của bạn trong 7 ngày qua để tự động tìm ảnh đồ ăn và thêm chúng vào nhật ký của bạn.

# retroScanNote
source: Only food photos are detected — other photos are ignored. No photos leave your device.
de: Es werden nur Lebensmittelfotos erkannt – andere Fotos werden ignoriert. Es verlassen keine Fotos Ihr Gerät.
es: Solo se detectan fotografías de alimentos; las demás fotografías se ignoran. No salen fotos de tu dispositivo.
fr: Seules les photos de nourriture sont détectées – les autres photos sont ignorées. Aucune photo ne quitte votre appareil.
hi: केवल भोजन की तस्वीरें पहचानी जाती हैं - अन्य तस्वीरें नजरअंदाज कर दी जाती हैं। कोई भी फ़ोटो आपके डिवाइस को नहीं छोड़ता.
id: Hanya foto makanan yang terdeteksi — foto lainnya diabaikan. Tidak ada foto yang keluar dari perangkat Anda.
pt: Apenas fotos de comida são detectadas – outras fotos são ignoradas. Nenhuma foto sai do seu dispositivo.
th: ตรวจจับเฉพาะรูปอาหาร — รูปอื่นจะถูกข้าม ไม่มีรูปถูกส่งออกนอกเครื่อง
vi: Chỉ phát hiện được ảnh đồ ăn - các ảnh khác sẽ bị bỏ qua. Không có ảnh nào rời khỏi thiết bị của bạn.

# retroScanStart
source: Scan My Photos
de: Scannen Sie meine Fotos
es: Escanear mis fotos
fr: Scanner mes photos
hi: मेरी तस्वीरें स्कैन करें
id: Pindai Foto Saya
pt: Digitalizar minhas fotos
th: สแกนรูปของฉัน
vi: Quét ảnh của tôi

# retroScanSkip
source: Skip for now
de: Überspringen Sie es vorerst
es: Saltar por ahora
fr: Passer pour l'instant
hi: अभी के लिए छोड़ दे
id: Lewati untuk saat ini
pt: Pular por enquanto
th: ข้ามไปก่อน
vi: Bỏ qua bây giờ

# retroScanInProgress
source: Scanning...
de: Scannen...
es: Exploración...
fr: Balayage...
hi: स्कैन किया जा रहा है...
id: Memindai...
pt: Digitalizando...
th: กำลังสแกน...
vi: Đang quét...

# retroScanTagline
source: MiRO is transforming your food photos into health data.
de: MiRO verändert Ihr Lebensmittelfotos in Gesundheitsdaten umwandeln.
es: MiRO está transformando tu fotos de alimentos en datos de salud.
fr: MiRO transforme votre photos alimentaires en données de santé.
hi: MiRO आपका परिवर्तन कर रहा है स्वास्थ्य डेटा में भोजन की तस्वीरें।
id: MiRO mengubah Anda foto makanan menjadi data kesehatan.
pt: MiRO está transformando seu fotos de alimentos em dados de saúde.
th: MiRO กำลังเปลี่ยนรูปอาหารของคุณ ให้เป็นข้อมูลสุขภาพ
vi: MiRO đang biến đổi bạn ảnh thực phẩm vào dữ liệu sức khỏe.

# retroScanFetchingPhotos
source: Fetching recent photos...
de: Aktuelle Fotos werden abgerufen...
es: Obteniendo fotos recientes...
fr: Récupération de photos récentes...
hi: हाल की तस्वीरें लाई जा रही हैं...
id: Mengambil foto terbaru...
pt: Buscando fotos recentes...
th: กำลังดึงรูปภาพล่าสุด...
vi: Đang tìm nạp các ảnh gần đây...

# retroScanAnalyzing
source: Detecting food photos...
de: Lebensmittelfotos werden erkannt...
es: Detectando fotos de comida...
fr: Détection de photos de nourriture...
hi: खाने की फ़ोटो का पता लगाया जा रहा है...
id: Mendeteksi foto makanan...
pt: Detectando fotos de comida...
th: กำลังตรวจจับรูปอาหาร...
vi: Đang phát hiện ảnh đồ ăn...

# retroScanPhotosFound
source: {count} photos found in last 7 days
de: {count} Fotos in den letzten 7 Tagen gefunden
es: {count} fotos encontradas en los últimos 7 días
fr: {count} photos trouvées au cours des 7 derniers jours
hi: पिछले 7 दिनों में {count} तस्वीरें मिलीं
id: {count} foto ditemukan dalam 7 hari terakhir
pt: {count} fotos encontradas nos últimos 7 dias
th: พบ {count} รูปใน 7 วันที่ผ่านมา
vi: {count} ảnh được tìm thấy trong 7 ngày qua

# retroScanCompleteTitle
source: Scan Complete!
de: Scan abgeschlossen!
es: ¡Escaneo completo!
fr: Analyse terminée !
hi: स्कैन पूर्ण!
id: Pemindaian Selesai!
pt: Digitalização concluída!
th: สแกนเสร็จแล้ว!
vi: Quét hoàn tất!

# retroScanCompleteDesc
source: Found {count} food photos! They've been added to your timeline, ready for AI analysis.
de: {count} Essensfotos gefunden! Sie wurden Ihrer Zeitleiste hinzugefügt und sind bereit für die KI-Analyse.
es: ¡Encontré {count} fotos de comida! Se agregaron a su línea de tiempo, listos para el análisis de IA.
fr: J'ai trouvé {count} photos de nourriture ! Ils ont été ajoutés à votre chronologie, prêts pour l'analyse de l'IA.
hi: {count} भोजन की तस्वीरें मिलीं! उन्हें आपकी टाइमलाइन में जोड़ दिया गया है, एआई विश्लेषण के लिए तैयार हैं।
id: Menemukan {count} foto makanan! Mereka telah ditambahkan ke timeline Anda, siap untuk analisis AI.
pt: Encontrei {count} fotos de comida! Eles foram adicionados à sua linha do tempo, prontos para análise de IA.
th: พบ {count} รูปอาหาร! เพิ่มลง timeline แล้ว พร้อมให้ AI วิเคราะห์
vi: Đã tìm thấy {count} ảnh đồ ăn! Chúng đã được thêm vào dòng thời gian của bạn, sẵn sàng cho phân tích AI.

# retroScanNoResultsTitle
source: No Food Photos Found
de: Keine Lebensmittelfotos gefunden
es: No se encontraron fotos de comida
fr: Aucune photo de nourriture trouvée
hi: खाने की कोई फ़ोटो नहीं मिली
id: Tidak Ada Foto Makanan Ditemukan
pt: Nenhuma foto de comida encontrada
th: ไม่พบรูปอาหาร
vi: Không tìm thấy ảnh đồ ăn

# retroScanNoResultsDesc
source: No food photos detected in the last 7 days. Try taking a photo of your next meal!
de: In den letzten 7 Tagen wurden keine Lebensmittelfotos erkannt. Versuchen Sie, ein Foto von Ihrer nächsten Mahlzeit zu machen!
es: No se detectaron fotos de comida en los últimos 7 días. ¡Intenta tomar una foto de tu próxima comida!
fr: Aucune photo de nourriture détectée au cours des 7 derniers jours. Essayez de prendre une photo de votre prochain repas !
hi: पिछले 7 दिनों में भोजन की कोई फ़ोटो नहीं मिली। अपने अगले भोजन की फ़ोटो लेने का प्रयास करें!
id: Tidak ada foto makanan yang terdeteksi dalam 7 hari terakhir. Coba ambil foto makanan Anda berikutnya!
pt: Nenhuma foto de comida detectada nos últimos 7 dias. Experimente tirar uma foto da sua próxima refeição!
th: ไม่พบรูปอาหารใน 7 วันที่ผ่านมา ลองถ่ายรูปมื้อต่อไปดูนะ!
vi: Không phát hiện thấy ảnh đồ ăn nào trong 7 ngày qua. Hãy thử chụp ảnh bữa ăn tiếp theo của bạn!

# retroScanAnalyzeHint
source: Tap "Analyze All" on your timeline to get AI nutrition analysis for these entries.
de: Tippen Sie in Ihrer Chronik auf „Alle analysieren“, um eine KI-Ernährungsanalyse für diese Einträge zu erhalten.
es: Toque "Analizar todo" en su línea de tiempo para obtener un análisis nutricional de IA para estas entradas.
fr: Appuyez sur « Tout analyser » sur votre chronologie pour obtenir une analyse nutritionnelle par l'IA pour ces entrées.
hi: इन प्रविष्टियों के लिए एआई पोषण विश्लेषण प्राप्त करने के लिए अपनी टाइमलाइन पर "सभी का विश्लेषण करें" पर टैप करें।
id: Ketuk "Analisis Semua" di timeline Anda untuk mendapatkan analisis nutrisi AI untuk entri ini.
pt: Toque em “Analisar tudo” na sua linha do tempo para obter análises nutricionais de IA para essas entradas.
th: กด "วิเคราะห์ทั้งหมด" บน timeline เพื่อให้ AI วิเคราะห์โภชนาการ
vi: Nhấn vào "Phân tích tất cả" trên dòng thời gian của bạn để nhận phân tích dinh dưỡng AI cho các mục này.

# retroScanDone
source: Got it!
de: Habe es!
es: ¡Entiendo!
fr: J'ai compris!
hi: समझ गया!
id: Mengerti!
pt: Entendi!
th: เข้าใจแล้ว!
vi: Hiểu rồi!

# welcomeEndTitle
source: Welcome to MiRO!
de: Willkommen bei MiRO!
es: ¡Bienvenido a MiRO!
fr: Bienvenue sur MiRO !
hi: MiRO में आपका स्वागत है!
id: Selamat datang di MiRO!
pt: Bem-vindo ao MiRO!
th: ยินดีต้อนรับสู่ MiRO!
vi: Chào mừng đến với MiRO!

# welcomeEndMessage
source: MiRO is at your service.
de: MiRO steht Ihnen zur Verfügung.
es: MiRO está a su servicio.
fr: MiRO est à votre service.
hi: MiRO आपकी सेवा में है.
id: MiRO siap melayani Anda.
pt: MiRO está ao seu serviço.
th: MiRO ยินดีรับใช้
vi: MiRO sẵn sàng phục vụ bạn.

# welcomeEndJourney
source: Have a nice journey together!!
de: Habt eine schöne gemeinsame Reise!!
es: ¡¡Buen viaje juntos!!
fr: Bon voyage ensemble !!
hi: साथ में अच्छी यात्रा करें!!
id: Semoga perjalananmu menyenangkan bersama!!
pt: Tenham uma boa viagem juntos!!
vi: Chúc bạn có một chuyến đi vui vẻ cùng nhau!!

# welcomeEndStart
source: Let's Start!
de: Fangen wir an!
es: ¡Empecemos!
fr: Commençons !
hi: चलो शुरू करो!
id: Ayo Mulai!
pt: Vamos começar!
th: เริ่มใช้งานเลย!
vi: Hãy bắt đầu!
