Repository: lnxelnope/miro
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, pt, th, vi

# termsSectionIntellectualProperty
source: Intellectual Property
de: Intellektuelles Property
es: Propiedad intelectual Pro
fr: Propriété intellectuelle Pro
hi: बौद्धिक Property
id: Intelektual Property
pt: Propriedade intelectual Pro
th: ทรัพย์สินทางปัญญา
vi: Trí tuệ Property

# termsSectionLimitationOfLiability
source: Limitation of Liability
de: Haftungsbeschränkung
es: Limitación de responsabilidad
fr: Limitation de responsabilité
hi: दायित्व की सीमा
id: Batasan Tanggung Jawab
pt: Limitação de responsabilidade
th: ข้อจำกัดความรับผิด
vi: Giới hạn trách nhiệm pháp lý

# termsSectionServiceTermination
source: Service Termination
de: Dienstbeendigung
es: Terminación del servicio
fr: Résiliation du service
hi: सेवा समाप्ति
id: Pengakhiran Layanan
pt: Rescisão do serviço
th: การยกเลิกบริการ
vi: Chấm dứt dịch vụ

# termsSectionChangesToTerms
source: Changes to Terms
de: Änderungen der Bedingungen
es: Cambios a los términos
fr: Modifications des conditions
hi: शर्तों में परिवर्तन
id: Perubahan Ketentuan
pt: Mudanças nos Termos
th: การเปลี่ยนแปลงเงื่อนไข
vi: Thay đổi điều khoản

# termsSectionGoverningLaw
source: Governing Law
de: Geltendes Recht
es: Ley aplicable
fr: Loi applicable
hi: शासी कानून
id: Hukum yang Mengatur
pt: Lei Aplicável
th: กฎหมายที่ใช้บังคับ
vi: Luật điều chỉnh

# termsSectionContactUs
source: Contact Us
de: Kontaktieren Sie uns
es: Contáctenos
fr: Contactez-nous
hi: हमसे संपर्क करें
id: Hubungi kami
pt: Contate-nos
th: ติดต่อเรา
vi: Liên hệ với chúng tôi

# termsAcknowledgment
source: By using MiRO, you acknowledge that you have read, understood, and agree to these Terms of Service.
de: Durch die Nutzung von MiRO bestätigen Sie, dass Sie diese Nutzungsbedingungen gelesen und verstanden haben und ihnen zustimmen.
es: Al utilizar MiRO, usted reconoce que ha leído, comprendido y aceptado estos Términos de servicio.
fr: En utilisant MiRO, vous reconnaissez que vous avez lu, compris et accepté ces conditions d'utilisation.
hi: MiRO का उपयोग करके, आप स्वीकार करते हैं कि आपने सेवा की इन शर्तों को पढ़, समझ लिया है और उनसे सहमत हैं।
id: Dengan menggunakan MiRO, Anda menyatakan bahwa Anda telah membaca, memahami, dan menyetujui Ketentuan Layanan ini.
pt: Ao usar MiRO, você reconhece que leu, compreendeu e concorda com estes Termos de Serviço.
th: โดยการใช้ MiRO คุณยอมรับว่าคุณได้อ่าน เข้าใจ และยอมรับเงื่อนไขการใช้งานเหล่านี้แล้ว
vi: Bằng cách sử dụng MiRO, bạn xác nhận rằng bạn đã đọc, hiểu và đồng ý với các Điều khoản dịch vụ này.

# termsLastUpdated
source: Last updated: February 15, 2026
de: Letzte Aktualisierung: 15. Februar 2026
es: Última actualización: 15 de febrero de 2026
fr: Dernière mise à jour : 15 février 2026
hi: अंतिम अद्यतन: 15 फरवरी, 2026
id: Terakhir diperbarui: 15 Februari 2026
pt: Última atualização: 15 de fevereiro de 2026
th: อัพเดทล่าสุด: 15 กุมภาพันธ์ 2026
vi: Cập nhật lần cuối: ngày 15 tháng 2 năm 2026

# profileAndSettings
source: Profile & Settings
de: ProDatei und Einstellungen
es: Proarchivo y configuración
fr: Profichier et paramètres
hi: Proफ़ाइल और सेटिंग्स
id: Profile & Pengaturan
pt: Proarquivo e configurações
th: โปรไฟล์และการตั้งค่า
vi: Protệp & Cài đặt

# errorOccurred
source: Error: {error}
de: Fehler: {error}
fr: Erreur : {error}
hi: त्रुटि: {error}
id: Kesalahan: {error}
pt: Erro: {error}
th: เกิดข้อผิดพลาด: {error}
vi: Lỗi: {error}

# healthGoalsSection
source: Health Goals
de: Gesundheitsziele
es: Metas de salud
fr: Objectifs de santé
hi: स्वास्थ्य लक्ष्य
id: Tujuan Kesehatan
pt: Metas de saúde
th: เป้าหมายสุขภาพ
vi: Mục tiêu sức khỏe

source: Daily Goals
de: Tägliche Ziele
es: Metas Diarias
fr: Objectifs quotidiens
hi: दैनिक लक्ष्य
id: Tujuan Harian
pt: Metas Diárias
th: เป้าหมายรายวัน
vi: Mục tiêu hàng ngày

# chatAiModeSection
source: Chat AI Mode
de: Chat-KI-Modus
es: Modo IA de chat
fr: Mode IA de discussion
hi: चैट एआई मोड
id: Mode AI Obrolan
pt: Modo IA de bate-papo
th: โหมด Chat AI
vi: Chế độ AI trò chuyện

# selectAiPowersChat
source: Select which AI powers your chat
de: Wählen Sie aus, welche KI Ihren Chat antreibt
es: Selecciona qué IA impulsa tu chat
fr: Sélectionnez quelle IA alimente votre chat
hi: चुनें कि कौन सा AI आपकी चैट को शक्ति प्रदान करता है
id: Pilih AI mana yang mendukung obrolan Anda
pt: Selecione qual IA potencializa seu bate-papo
th: เลือก AI ที่จะใช้ในแชท
vi: Chọn AI hỗ trợ cuộc trò chuyện của bạn

source: Miro AI
de: Miro KI
es: Miro IA
fr: Miro IA
hi: Miro ऐ
pt: Miro IA

# miroAiSubtitle
source: Powered by Gemini • Multi-language • High accuracy
de: Unterstützt von Gemini • Mehrsprachig • Hohe Genauigkeit
es: Desarrollado por Gemini • Varios idiomas • Alta precisión
fr: Propulsé par Gemini • Multilingue • Haute précision
hi: Gemini द्वारा संचालित • बहुभाषी • उच्च सटीकता
id: Didukung oleh Gemini • Multi-bahasa • Akurasi tinggi
pt: Desenvolvido por Gemini • Multilíngue • Alta precisão
th: ใช้ Gemini • รองรับหลายภาษา • ความแม่นยำสูง
vi: Được cung cấp bởi Gemini • Đa ngôn ngữ • Độ chính xác cao

source: Local AI
de: Lokale KI
es: IA local
fr: IA locale
hi: स्थानीय ए.आई
id: AI lokal
pt: IA local
vi: AI cục bộ

# localAiSubtitle
source: On-device • English only • Basic accuracy
de: Auf dem Gerät • Nur Englisch • Grundlegende Genauigkeit
es: En el dispositivo • Solo inglés • Precisión básica
fr: Sur l'appareil • En anglais uniquement • Précision de base
hi: डिवाइस पर • केवल अंग्रेज़ी • बुनियादी सटीकता
id: Di perangkat • Hanya dalam bahasa Inggris • Akurasi dasar
pt: No dispositivo • Somente em inglês • Precisão básica
th: ทำงานบนอุปกรณ์ • ภาษาอังกฤษเท่านั้น • ความแม่นยำพื้นฐาน
vi: Trên thiết bị • Chỉ tiếng Anh • Độ chính xác cơ bản

source: Free
de: Frei
es: Gratis
fr: Gratuit
hi: मुक्त
id: Bebas
pt: Livre
th: ฟรี
vi: Miễn phí

# cuisinePreferenceSection
source: Cuisine Preference
de: Küchenpräferenz
es: Preferencia de cocina
fr: Préférence culinaire
hi: व्यंजन प्राथमिकता
id: Preferensi Masakan
pt: Preferência de cozinha
th: อาหารที่ชอบ
vi: Sở thích ẩm thực

source: Preferred Cuisine
de: Bevorzugte Küche
es: Cocina preferida
fr: Cuisine préférée
hi: पसंदीदा व्यंजन
id: Masakan Pilihan
pt: Cozinha preferida
th: อาหารที่ชอบ
vi: Món ăn ưa thích

source: Select Your Cuisine
de: Wählen Sie Ihre Küche
es: Selecciona tu cocina
fr: Sélectionnez votre cuisine
hi: अपना व्यंजन चुनें
id: Pilih Masakan Anda
pt: Selecione sua cozinha
th: เลือกอาหารที่คุณชอบ
vi: Chọn món ăn của bạn

# photoScanSection
source: Photo Scan
de: Fotoscan
es: Escaneo de fotos
fr: Numérisation de photos
hi: फोटो स्कैन
id: Pemindaian Foto
pt: Digitalização de fotos
th: สแกนรูปภาพ
vi: Quét ảnh

# languageSection
source: Language
de: Sprache
es: Idioma
fr: Langue
hi: भाषा
id: Bahasa
pt: Linguagem
th: ภาษา
vi: Ngôn ngữ

# languageTitle
source: Language / ภาษา
de: Sprache / ภาษา
es: Idioma / ภาษา
fr: Langue / ภาษา
hi: भाषा / भाषा
id: Bahasa / ภาษา
pt: Idioma / Português
vi: Ngôn ngữ / ภาษา

# selectLanguage
source: Select Language / เลือกภาษา
de: Wählen Sie Sprache / Sprachen
es: Seleccionar idioma / เลือกภาษา
fr: Sélectionnez la langue / เลือกภาษา
hi: भाषा चुनें / भाषा चुनें
id: Pilih Bahasa / Bahasa
pt: Selecione o idioma / เลือกภาษา
vi: Chọn Ngôn ngữ / Ngôn ngữ

source: System Default
de: Systemstandard
es: Valor predeterminado del sistema
fr: Système par défaut
hi: प्रणालीगत चूक
id: Bawaan Sistem
pt: Padrão do sistema
th: ตามระบบ
vi: Mặc định hệ thống

# systemDefaultSublabel
source: ตามระบบ
hi: धन्यवाद
pt: Mais

source: English
de: Englisch
es: Inglés
fr: Anglais
hi: अंग्रेज़ी
id: Bahasa inggris
pt: Inglês
vi: Tiếng Anh

# englishSublabel
source: อังกฤษ
hi: ठीक है
pt: O que é isso?

# thai
source: ไทย (Thai)
es: ไทย (tailandés)
fr: ไทย (thaïlandais)
hi: ไทย (थाई)
id: ไทย (Thailand)
pt: ไทย (tailandês)
vi: ไทย (Thái)

# thaiSublabel
source: ภาษาไทย
hi: धन्यवाद

# closeBilingual
source: Close / ปิด
de: Schließen / schließen
es: Cerrar / ปิด
fr: Fermer / ปิด
hi: बंद करें / बंद करें
id: Tutup / ปิด
pt: Fechar / Fechar
vi: Đóng / ปิด

# languageChangedTo
source: Language changed to {language}
de: Die Sprache wurde in {language} geändert.
es: Idioma cambiado a {language}
fr: Langue modifiée en {language}
hi: भाषा बदलकर {language} कर दी गई
id: Bahasa diubah menjadi {language}
pt: Idioma alterado para {language}
th: เปลี่ยนภาษาเป็น {language}
vi: Ngôn ngữ đã thay đổi thành {language}

# accountSection
source: Account
de: Konto
es: Cuenta
fr: Compte
hi: खाता
id: Akun
pt: Conta
th: บัญชี
vi: Tài khoản

source: MiRO ID
es: MiRO identificación
fr: ID MiRO
hi: MiRO आईडी

source: MiRO ID copied!
de: MiRO ID kopiert!
es: MiRO ¡ID copiada!
fr: MiRO ID copié !
hi: MiRO आईडी कॉपी की गई!
id: MiRO ID disalin!
pt: MiRO ID copiado!
th: คัดลอก MiRO ID แล้ว!
vi: MiRO ID đã được sao chép!

source: Invite Friends
de: Freunde einladen
es: invitar amigos
fr: Inviter des amis
hi: मित्रों को आमंत्रित करें
id: Undang Teman
pt: Convide amigos
th: เชิญเพื่อน
vi: Mời bạn bè

# inviteFriendsSubtitle
source: Share your referral code and earn rewards!
de: Teilen Sie Ihren Empfehlungscode und verdienen Sie Prämien!
es: ¡Comparte tu código de referencia y gana recompensas!
fr: Partagez votre code de parrainage et gagnez des récompenses !
hi: अपना रेफरल कोड साझा करें और पुरस्कार अर्जित करें!
id: Bagikan kode referensi Anda dan dapatkan hadiah!
pt: Compartilhe seu código de indicação e ganhe recompensas!
th: แชร์รหัสแนะนำของคุณและรับรางวัล!
vi: Chia sẻ mã giới thiệu của bạn và kiếm phần thưởng!

source: Unlimited AI + Double rewards
de: Unbegrenzte KI + doppelte Belohnungen
es: IA ilimitada + recompensas dobles
fr: IA illimitée + récompenses doubles
hi: असीमित एआई + दोहरा पुरस्कार
id: AI tanpa batas + Hadiah ganda
pt: IA ilimitada + recompensas em dobro
th: AI ไม่จำกัด + รางวัลสองเท่า
vi: AI không giới hạn + Phần thưởng gấp đôi

source: Plan
de: Planen
hi: योजना
id: Rencana
pt: Plano
th: แผน
vi: Kế hoạch

source: Monthly
de: Monatlich
es: Mensual
fr: Mensuel
hi: महीने के
id: Bulanan
pt: Mensal
th: รายเดือน
vi: hàng tháng

source: Started
de: Begonnen
es: Comenzó
fr: Commencé
hi: शुरू कर दिया
id: Dimulai
pt: Iniciado
th: เริ่มเมื่อ
vi: Đã bắt đầu

source: Renews
de: Erneuert
es: Renueva
fr: Renouvelle
hi: नवीनिकृत
id: Memperbarui
pt: Renova
th: ต่ออายุ
vi: Gia hạn

source: Expires
de: Läuft ab
es: Vence
fr: Expire
hi: समय-सीमा समाप्त
id: Kedaluwarsa
pt: Expira
th: หมดอายุ
vi: Hết hạn

source: Auto-Renew
de: Automatische Verlängerung
es: Renovación automática
fr: Renouvellement automatique
hi: ऑटो नवीनीकृत
id: Perpanjangan Otomatis
pt: Renovação automática
th: ต่ออัตโนมัติ
vi: Tự động gia hạn

source: On
de: An
es: En
fr: Sur
hi: पर
id: Pada
pt: Sobre
th: เปิด
vi: TRÊN

source: Off
de: Aus
es: Apagado
fr: Désactivé
hi: बंद
id: Mati
pt: Desligado
th: ปิด
vi: Tắt

source: Tap to manage subscription
de: Tippen Sie hier, um das Abonnement zu verwalten
es: Toca para administrar la suscripción
fr: Appuyez pour gérer l'abonnement
hi: सदस्यता प्रबंधित करने के लिए टैप करें
id: Ketuk untuk mengelola langganan
pt: Toque para gerenciar a assinatura
th: แตะเพื่อจัดการการสมัครสมาชิก
vi: Nhấn để quản lý đăng ký

# dataSection
source: Data
de: Daten
es: Datos
fr: Données
hi: डेटा
pt: Dados
th: ข้อมูล
vi: dữ liệu

source: Backup Data
de: Sicherungsdaten
es: Datos de copia de seguridad
fr: Sauvegarde des données
hi: बैकअप डेटा
id: Data Cadangan
pt: Dados de backup
th: สำรองข้อมูล
vi: Sao lưu dữ liệu

# backupDataSubtitle
source: Energy + Food History → save as file
de: Energie- und Lebensmittelverlauf → als Datei speichern
es: Energía + Historial de alimentos → guardar como archivo
fr: Énergie + Historique alimentaire → enregistrer en tant que fichier
hi: ऊर्जा + खाद्य इतिहास → फ़ाइल के रूप में सहेजें
id: Energi + Riwayat Makanan → simpan sebagai file
pt: Energia + Histórico Alimentar → salvar como arquivo
th: พลังงาน + ประวัติอาหาร → บันทึกเป็นไฟล์
vi: Năng lượng + Lịch sử thực phẩm → lưu dưới dạng tệp

source: Restore from Backup
de: Aus Backup wiederherstellen
es: Restaurar desde copia de seguridad
fr: Restaurer à partir d'une sauvegarde
hi: बैकअप से पुनर्स्थापित करें
id: Pulihkan dari Cadangan
pt: Restaurar do backup
th: กู้คืนจากสำรองข้อมูล
vi: Khôi phục từ bản sao lưu

# restoreFromBackupSubtitle
source: Import data from backup file
de: Daten aus Sicherungsdatei importieren
es: Importar datos desde un archivo de copia de seguridad
fr: Importer des données à partir d'un fichier de sauvegarde
hi: बैकअप फ़ाइल से डेटा आयात करें
id: Impor data dari file cadangan
pt: Importar dados do arquivo de backup
th: นำเข้าข้อมูลจากไฟล์สำรอง
vi: Nhập dữ liệu từ tập tin sao lưu

# clearAllDataTitle
source: Clear all data?
de: Alle Daten löschen?
es: ¿Borrar todos los datos?
fr: Effacer toutes les données ?
hi: सारा डेटा साफ़ करें?
id: Hapus semua data?
pt: Limpar todos os dados?
th: ล้างข้อมูลทั้งหมด?
vi: Xóa tất cả dữ liệu?

# clearAllDataContent
source: All data will be deleted: • Food entries • My Meals • Ingredients • Goals • Personal info This cannot be undone!
de: Alle Daten werden gelöscht: • Lebensmitteleinträge • Meine Mahlzeiten • Zutaten • Ziele • Persönliche Informationen Dies kann nicht rückgängig gemacht werden!
es: Todos los datos serán eliminados: • Entradas de alimentos • Mis comidas • Ingredientes • Metas • Información personal ¡Esto no se puede deshacer!
fr: Toutes les données seront supprimées : • Entrées alimentaires • Mes repas • Ingrédients • Objectifs • Informations personnelles Cela ne peut pas être annulé !
hi: सारा डेटा हटा दिया जाएगा: • खाद्य प्रविष्टियाँ • मेरा भोजन • सामग्री • लक्ष्य • व्यक्तिगत जानकारी इसे पूर्ववत नहीं किया जा सकता!
id: Semua data akan dihapus: • Entri makanan • Makanan Saya • Bahan • Tujuan • Informasi pribadi Hal ini tidak dapat dibatalkan!
pt: Todos os dados serão excluídos: • Entradas de alimentação • Minhas refeições • Ingredientes • Metas • Informações pessoais Isso não pode ser desfeito!
th: ข้อมูลทั้งหมดจะถูกลบ: • รายการอาหาร • อาหารของฉัน • ส่วนผสม • เป้าหมาย • ข้อมูลส่วนตัว ไม่สามารถกู้คืนได้!
vi: Tất cả dữ liệu sẽ bị xóa: • Mục món ăn • Bữa ăn của tôi • Thành phần • Mục tiêu • Thông tin cá nhân Điều này không thể được hoàn tác!

# allDataClearedSuccess
source: All data cleared successfully
de: Alle Daten erfolgreich gelöscht
es: Todos los datos se borraron exitosamente
fr: Toutes les données ont été effacées avec succès
hi: सभी डेटा सफलतापूर्वक साफ़ कर दिया गया
id: Semua data berhasil dihapus
pt: Todos os dados apagados com sucesso
th: ล้างข้อมูลทั้งหมดเรียบร้อย
vi: Tất cả dữ liệu đã được xóa thành công

# aboutSection
source: About
de: Um
es: Acerca de
fr: À propos
hi: के बारे में
id: Tentang
pt: Sobre
th: เกี่ยวกับ
vi: Về

source: Version
es: Versión
hi: संस्करण
id: Versi
pt: Versão
th: เวอร์ชัน
vi: Phiên bản

source: Health Disclaimer
de: Haftungsausschluss für die Gesundheit
es: Descargo de responsabilidad de salud
fr: Avis de non-responsabilité concernant la santé
hi: स्वास्थ्य अस्वीकरण
id: Penafian Kesehatan
pt: Isenção de responsabilidade de saúde
th: ข้อจำกัดความรับผิดด้านสุขภาพ
vi: Tuyên bố miễn trừ trách nhiệm về sức khỏe

source: Important legal information
de: Wichtige rechtliche Informationen
es: Información legal importante
fr: Informations juridiques importantes
hi: महत्वपूर्ण कानूनी जानकारी
id: Informasi hukum penting
pt: Informações legais importantes
th: ข้อมูลกฎหมายสำคัญ
vi: Thông tin pháp lý quan trọng

source: Show Tutorial Again
de: Tutorial erneut anzeigen
es: Mostrar tutorial nuevamente
fr: Afficher à nouveau le didacticiel
hi: ट्यूटोरियल दोबारा दिखाएँ
id: Tampilkan Tutorial Lagi
pt: Mostrar tutorial novamente
th: แสดงทัวร์อีกครั้ง
vi: Hiển thị lại hướng dẫn

source: View feature tour
de: Feature-Tour ansehen
es: Ver recorrido de funciones
fr: Voir la présentation des fonctionnalités
hi: फीचर टूर देखें
id: Lihat tur fitur
pt: Ver tour pelos recursos
th: ดูทัวร์ฟีเจอร์
vi: Xem chuyến tham quan tính năng

# showTutorialDialogTitle
source: Show Tutorial
de: Tutorial anzeigen
es: Mostrar tutorial
fr: Afficher le didacticiel
hi: टूटोरियल्स दिखाना
id: Tampilkan Tutorial
pt: Mostrar tutorial
th: แสดงทัวร์
vi: Hiển thị hướng dẫn

# showTutorialDialogContent
source: This will show the feature tour that highlights: • Energy System • Pull-to-Refresh Photo Scan • Chat with Miro AI You will return to the Home screen.
de: Dadurch wird die Feature-Tour angezeigt, die Folgendes hervorhebt: • Energiesystem • Pull-to-Refresh-Fotoscan • Chatten Sie mit Miro AI Sie kehren zum Startbildschirm zurück.
es: Esto mostrará el recorrido principal que destaca: • Sistema de energía • Escaneo de fotografías con función de extracción y actualización • Chatea con Miro AI Volverá a la pantalla de inicio.
fr: Cela affichera la présentation des fonctionnalités qui met en évidence : • Système énergétique • Numérisation de photos par extraction pour actualiser • Discutez avec l'IA Miro Vous reviendrez à l'écran d'accueil.
hi: यह वह फीचर टूर दिखाएगा जो निम्न पर प्रकाश डालता है: • ऊर्जा प्रणाली • पुल-टू-रिफ्रेश फोटो स्कैन • Miro AI के साथ चैट करें आप होम स्क्रीन पर वापस आ जायेंगे.
id: Ini akan menampilkan tur fitur yang menyoroti: • Sistem Energi • Pemindaian Foto Tarik untuk Menyegarkan • Ngobrol dengan Miro AI Anda akan kembali ke layar Beranda.
pt: Isso mostrará o tour de recursos que destaca: • Sistema Energético • Digitalização de fotos com puxar para atualizar • Converse com Miro IA Você retornará à tela inicial.
th: จะแสดงทัวร์ฟีเจอร์ที่เน้น: • ระบบพลังงาน • ดึงลงเพื่อสแกนรูปภาพ • แชทกับ Miro AI คุณจะกลับไปที่หน้าหลัก
vi: Điều này sẽ hiển thị chuyến tham quan tính năng nổi bật: • Hệ thống năng lượng • Quét ảnh kéo để làm mới • Trò chuyện với Miro AI Bạn sẽ quay lại Màn hình chính.

# showTutorialButton
source: Show Tutorial
de: Tutorial anzeigen
es: Mostrar tutorial
fr: Afficher le didacticiel
hi: टूटोरियल्स दिखाना
id: Tampilkan Tutorial
pt: Mostrar tutorial
th: แสดงทัวร์
vi: Hiển thị hướng dẫn

# tutorialResetMessage
source: Tutorial reset! Go to Home screen to view it.
de: Tutorial zurückgesetzt! Gehen Sie zum Startbildschirm, um es anzuzeigen.
es: ¡Restablecimiento del tutorial! Vaya a la pantalla de inicio para verlo.
fr: Réinitialisation du tutoriel ! Accédez à l’écran d’accueil pour le voir.
hi: ट्यूटोरियल रीसेट! इसे देखने के लिए होम स्क्रीन पर जाएँ।
id: Penyetelan ulang tutorial! Buka layar Beranda untuk melihatnya.
pt: Redefinição do tutorial! Vá para a tela inicial para visualizá-lo.
th: รีเซ็ตทัวร์แล้ว! ไปที่หน้าหลักเพื่อดู
vi: Đặt lại hướng dẫn! Đi tới Màn hình chính để xem nó.

source: Food Analysis Tutorial
de: Tutorial zur Lebensmittelanalyse
es: Tutorial de análisis de alimentos
fr: Tutoriel d'analyse des aliments
hi: खाद्य विश्लेषण ट्यूटोरियल
id: Tutorial Analisis Makanan
pt: Tutorial de Análise de Alimentos
th: ทัวร์การวิเคราะห์อาหาร
vi: Hướng dẫn phân tích thực phẩm

# foodAnalysisTutorialSubtitle
source: Learn how to use food analysis features
de: Erfahren Sie, wie Sie die Funktionen zur Lebensmittelanalyse nutzen
es: Aprenda a utilizar las funciones de análisis de alimentos
fr: Apprenez à utiliser les fonctionnalités d'analyse des aliments
hi: जानें कि खाद्य विश्लेषण सुविधाओं का उपयोग कैसे करें
id: Pelajari cara menggunakan fitur analisis makanan
pt: Aprenda como usar recursos de análise de alimentos
th: เรียนรู้วิธีใช้ฟีเจอร์วิเคราะห์อาหาร
vi: Tìm hiểu cách sử dụng các tính năng phân tích thực phẩm

source: Backup Created!
de: Backup erstellt!
es: Copia de seguridad creada!
fr: Sauvegarde créée !
hi: बैकअप बनाया गया!
id: Cadangan Dibuat!
pt: Backup criado!
th: สร้างสำรองข้อมูลสำเร็จ!
vi: Đã tạo bản sao lưu!

# backupCreatedContent
source: Your backup file has been created successfully.
de: Ihre Sicherungsdatei wurde erfolgreich erstellt.
es: Su archivo de respaldo se ha creado exitosamente.
fr: Votre fichier de sauvegarde a été créé avec succès.
hi: आपकी बैकअप फ़ाइल सफलतापूर्वक बनाई गई है.
id: File cadangan Anda telah berhasil dibuat.
pt: Seu arquivo de backup foi criado com sucesso.
th: สร้างไฟล์สำรองข้อมูลสำเร็จแล้ว
vi: Tệp sao lưu của bạn đã được tạo thành công.

# backupChooseDestination
source: Where would you like to save your backup?
de: Wo möchten Sie Ihr Backup speichern?
es: ¿Dónde le gustaría guardar su copia de seguridad?
fr: Où souhaitez-vous enregistrer votre sauvegarde ?
hi: आप अपना बैकअप कहाँ सहेजना चाहेंगे?
id: Di mana Anda ingin menyimpan cadangan Anda?
pt: Onde você gostaria de salvar seu backup?
th: ต้องการบันทึก Backup ไว้ที่ไหน?
vi: Bạn muốn lưu bản sao lưu của mình ở đâu?

# backupSaveToDevice
source: Save to Device
de: Auf Gerät speichern
es: Guardar en dispositivo
fr: Enregistrer sur l'appareil
hi: डिवाइस में सहेजें
id: Simpan ke Perangkat
pt: Salvar no dispositivo
th: บันทึกลงเครื่อง
vi: Lưu vào thiết bị

# backupSaveToDeviceDesc
source: Save to a folder you choose on this device
de: Speichern Sie es in einem von Ihnen ausgewählten Ordner auf diesem Gerät
es: Guardar en una carpeta que elijas en este dispositivo
fr: Enregistrer dans un dossier de votre choix sur cet appareil
hi: इस डिवाइस पर आपके द्वारा चुने गए फ़ोल्डर में सहेजें
id: Simpan ke folder yang Anda pilih di perangkat ini
pt: Salve em uma pasta de sua escolha neste dispositivo
th: เลือกโฟลเดอร์ที่ต้องการบันทึก
vi: Lưu vào thư mục bạn chọn trên thiết bị này

# backupShareToOther
source: Share to Other Device
de: Mit anderem Gerät teilen
es: Compartir con otro dispositivo
fr: Partager sur un autre appareil
hi: अन्य डिवाइस पर साझा करें
id: Bagikan ke Perangkat Lain
pt: Compartilhar para outro dispositivo
th: ส่งไปเครื่องอื่น
vi: Chia sẻ với thiết bị khác

# backupShareToOtherDesc
source: Send via Line, Email, Google Drive, etc.
de: Senden Sie per Telefon, E-Mail, Google-Laufwerk usw.
es: Enviar por línea, correo electrónico, unidad Google, etc.
fr: Envoyez par ligne, e-mail, lecteur Google, etc.
hi: लाइन, ईमेल, Google ड्राइव आदि के माध्यम से भेजें।
id: Kirim melalui Line, Email, Google Drive, dll.
pt: Enviar via linha, e-mail, unidade Google, etc.
th: ส่งผ่าน Line, Email, Google Drive ฯลฯ
vi: Gửi qua Line, Email, Google Drive, v.v.

# backupSavedSuccess
source: Backup Saved!
de: Backup gespeichert!
es: Copia de seguridad guardada!
fr: Sauvegarde enregistrée !
hi: बैकअप सहेजा गया!
id: Cadangan Tersimpan!
pt: Backup salvo!
th: บันทึก Backup สำเร็จ!
vi: Đã lưu bản sao lưu!

# backupSavedSuccessContent
source: Your backup file has been saved to your chosen location.
de: Ihre Sicherungsdatei wurde an dem von Ihnen gewählten Speicherort gespeichert.
es: Su archivo de copia de seguridad se ha guardado en la ubicación elegida.
fr: Votre fichier de sauvegarde a été enregistré à l'emplacement choisi.
hi: आपकी बैकअप फ़ाइल आपके चुने हुए स्थान पर सहेजी गई है।
id: File cadangan Anda telah disimpan ke lokasi pilihan Anda.
pt: Seu arquivo de backup foi salvo no local escolhido.
th: ไฟล์สำรองข้อมูลถูกบันทึกไปยังโฟลเดอร์ที่เลือกแล้ว
vi: Tệp sao lưu của bạn đã được lưu vào vị trí bạn đã chọn.

source: Important:
de: Wichtig:
es: Importante:
hi: महत्वपूर्ण:
id: Penting:
pt: Importante:
th: สำคัญ:
vi: Quan trọng:
